{
  "full_text": "1E's main offices are in the US, in India, and in the UK. We've also got offices in Ireland, but we've got people situated in Canada, South Africa, and Europe as well. The employees at 1E travel across the world to collaborate together. They also go out to meet customers. 130 of our employees are using the travel solution. The reason we chose Navan was because it was a platform that catered for three solutions in one. So one was booking of travel, one was the expense side, and the third was the credit card piece. So we had everything in one platform. It was just a lot easier to use and it gave that ownership to individuals within the company, whilst we still maintain that control centrally. 1E were booking their travel with Egencia prior to me joining. The Egencia contract came to an end because we weren't getting the inventory that we wanted on the system. The employees at 1E have really enjoyed the Navan solutions. And that showed through the customer satisfaction rate of 82% and a net promoter score of +70. As the person managing global travel previously, I found the old travel process quite clunky. It had to go through quite a few approval chains and often there was a lot of discrepancies with the platform that didn't sync up with the real time. The previous travel process was inaccurate and often unreliable. 1E used the Silicon Valley platform for both expenses and credit cards. Unfortunately, it wasn't the best system. The data for the SVB credit cards wasn't real-time, so people couldn't add their receipts straight away. People would forget to do it because it was on a delay. It was one person that was managing it, he would often have to chase and chase and chase for receipts. Now with Navan, the receipt issue has dropped, so there's minimum chasing of receipts because it's just a click of a button and it's uploaded. So the three words to describe Navan would be simple, user-friendly, and time-saving. The implementation of Navan was very simple and easy, and the implementation was probably an hour, two hours' work at the most. With the expense side, my favorite... well, I've got lots of favorite features because I've got a lot more control now over the expenses. You know, I've got reporting visibility, which is amazing. We can control that. Navan has helped 1E make lots of savings in the travel bookings. So far to date, we've saved 18% in air travel and 14% in hotels. Before we had Navan, we had a whole person dedicated to expenses. Since we've introduced Navan, that individual has been repurposed to do another role in finance. So we've actually saved on a whole head by installing Navan. Having Navan in place has allowed the finance team to get away from their day-to-day checking of individual expenses and it's freed up time to focus on more strategic initiatives that we've got in place. If I could describe Navan in one word, it would be effortless.",
  "segments": [
    {
      "start": 0.0,
      "end": 14.7,
      "text": "1E's main offices are in the US, in India, and in the UK. We've also got offices in Ireland, but we've got people situated in Canada, South Africa, and Europe as well."
    },
    {
      "start": 14.7,
      "end": 20.9,
      "text": "The employees at 1E travel across the world to collaborate together. They also go out to meet customers."
    },
    {
      "start": 20.9,
      "end": 24.5,
      "text": "130 of our employees are using the travel solution."
    },
    {
      "start": 24.5,
      "end": 39.4,
      "text": "The reason we chose Navan was because it was a platform that catered for three solutions in one. So one was booking of travel, one was the expense side, and the third was the credit card piece. So we had everything in one platform."
    },
    {
      "start": 39.4,
      "end": 50.3,
      "text": "It was just a lot easier to use and it gave that ownership to individuals within the company, whilst we still maintain that control centrally."
    },
    {
      "start": 50.3,
      "end": 57.1,
      "text": "1E were booking their travel with Egencia prior to me joining."
    },
    {
      "start": 57.1,
      "end": 63.9,
      "text": "The Egencia contract came to an end because we weren't getting the inventory that we wanted on the system."
    },
    {
      "start": 63.9,
      "end": 71.0,
      "text": "The employees at 1E have really enjoyed the Navan solutions."
    },
    {
      "start": 71.0,
      "end": 80.0,
      "text": "And that showed through the customer satisfaction rate of 82% and a net promoter score of +70."
    },
    {
      "start": 80.0,
      "end": 96.0,
      "text": "As the person managing global travel previously, I found the old travel process quite clunky. It had to go through quite a few approval chains and often there was a lot of discrepancies with the platform that didn't sync up with the real time."
    },
    {
      "start": 96.0,
      "end": 100.8,
      "text": "The previous travel process was inaccurate and often unreliable."
    },
    {
      "start": 100.8,
      "end": 105.5,
      "text": "1E used the Silicon Valley platform for both expenses and credit cards."
    },
    {
      "start": 105.5,
      "end": 118.0,
      "text": "Unfortunately, it wasn't the best system. The data for the SVB credit cards wasn't real-time, so people couldn't add their receipts straight away. People would forget to do it because it was on a delay."
    },
    {
      "start": 118.0,
      "end": 125.1,
      "text": "It was one person that was managing it, he would often have to chase and chase and chase for receipts."
    },
    {
      "start": 125.1,
      "end": 134.4,
      "text": "Now with Navan, the receipt issue has dropped, so there's minimum chasing of receipts because it's just a click of a button and it's uploaded."
    },
    {
      "start": 134.4,
      "end": 142.1,
      "text": "So the three words to describe Navan would be simple, user-friendly, and time-saving."
    },
    {
      "start": 142.1,
      "end": 154.5,
      "text": "The implementation of Navan was very simple and easy, and the implementation was probably an hour, two hours' work at the most."
    },
    {
      "start": 154.5,
      "end": 165.0,
      "text": "With the expense side, my favorite... well, I've got lots of favorite features because I've got a lot more control now over the expenses."
    },
    {
      "start": 165.0,
      "end": 169.5,
      "text": "You know, I've got reporting visibility, which is amazing. We can control that."
    },
    {
      "start": 169.5,
      "end": 177.5,
      "text": "Navan has helped 1E make lots of savings in the travel bookings."
    },
    {
      "start": 177.5,
      "end": 184.8,
      "text": "So far to date, we've saved 18% in air travel and 14% in hotels."
    },
    {
      "start": 184.8,
      "end": 192.5,
      "text": "Before we had Navan, we had a whole person dedicated to expenses."
    },
    {
      "start": 192.5,
      "end": 204.0,
      "text": "Since we've introduced Navan, that individual has been repurposed to do another role in finance. So we've actually saved on a whole head by installing Navan."
    },
    {
      "start": 204.0,
      "end": 218.0,
      "text": "Having Navan in place has allowed the finance team to get away from their day-to-day checking of individual expenses and it's freed up time to focus on more strategic initiatives that we've got in place."
    },
    {
      "start": 218.0,
      "end": 227.0,
      "text": "If I could describe Navan in one word, it would be effortless."
    }
  ]
}