{
  "full_text": "Is your company's travel spend giving you a permanent headache? Try Navan, the travel and expense platform that saves companies cash. It all starts with preventing out-of-policy spend at the source. Travel policies show employees exactly what they can and can't book. Since Navan has a huge inventory, we show you all the best options and deals from every travel provider. With Navan, employees are motivated to save even more. When booking travel below policy, employees earn Navan rewards toward their next vacation. It's fully funded by us, so your company keeps all those juicy savings. Using Navan is a no-brainer. It's free to get started. So, what's the wait? Start saving today.",
  "segments": [
    {
      "start": 0.0,
      "end": 3.9,
      "text": "Is your company's travel spend giving you a permanent headache?"
    },
    {
      "start": 3.9,
      "end": 7.8,
      "text": "Try Navan, the travel and expense platform that saves companies cash."
    },
    {
      "start": 7.8,
      "end": 12.3,
      "text": "It all starts with preventing out-of-policy spend at the source."
    },
    {
      "start": 12.3,
      "end": 17.5,
      "text": "Travel policies show employees exactly what they can and can't book."
    },
    {
      "start": 17.5,
      "end": 24.0,
      "text": "Since Navan has a huge inventory, we show you all the best options and deals from every travel provider."
    },
    {
      "start": 24.0,
      "end": 27.2,
      "text": "With Navan, employees are motivated to save even more."
    },
    {
      "start": 27.2,
      "end": 34.6,
      "text": "When booking travel below policy, employees earn Navan rewards toward their next vacation."
    },
    {
      "start": 34.6,
      "end": 38.8,
      "text": "It's fully funded by us, so your company keeps all those juicy savings."
    },
    {
      "start": 38.8,
      "end": 42.4,
      "text": "Using Navan is a no-brainer. It's free to get started."
    },
    {
      "start": 42.4,
      "end": 50.0,
      "text": "So, what's the wait? Start saving today."
    }
  ]
}