{
  "full_text": "Deputy is the people platform for hourly work. We operate in three main geos: here in the US, in Australia, and in the UK. And for us at Deputy, we really see travel as a way to, you know, invest in our people, our culture, and really our future. Prior to using Navan, we used a company called Egencia. And what we found with Egencia is that it just wasn't really fit for purpose for a global business like ours. We were not at all getting the corporate rates that we expected, and we need an intuitive system that each individual can plan their travel on their own. Egencia did not provide that to us. And so we went out and looked for a new system, a new platform, and Navan clicked all the boxes for us. Once we selected Navan as our partner, the implementation could not have been easier. The entire process lasted less than 30 days. It was just a few weeks and we were up and running. As a global business, we're operating in all different time zones. We need to have 24/7 support. We need somebody accessible on the other end of the line, whether that's by phone or by chat. And Navan has always been there for us when we've needed them. And so having somebody who's there when you're panicked, when your flight gets canceled, when your hotel maybe isn't what you expected, Navan is always there. So we're seeing really great savings from Navan. I actually just heard from our VP of Finance. We saw over 10% savings in just the first half of 2025 from the negotiated rates that we're seeing from Navan Travel. When we're booking travel, there are a number of different choices that employees have at their fingertips. So many of these policies that we have are for our employees' safety and security. And we want to make sure that we're maintaining that when the employees are booking their travel. We're also, of course, maintaining a budget. And so we want to have oversight when the employees are booking travel and adherence to those policies so that we can stay within budget and make sure that everybody's safe. So at Deputy, we value travel so much and we want our employees to get excited about travel. The last thing that we want is for people to be bogged down by the administrative burden of travel. And Navan helps us to wipe all of that away. It just makes it easy for us and people can focus on visiting our employees, our customers, and focus on what matters.",
  "segments": [
    {
      "start": 0.0,
      "end": 4.5,
      "text": "Deputy is the people platform for hourly work."
    },
    {
      "start": 4.5,
      "end": 8.0,
      "text": "We operate in three main geos: here in the US, in Australia, and in the UK."
    },
    {
      "start": 8.0,
      "end": 18.5,
      "text": "And for us at Deputy, we really see travel as a way to invest in our people, our culture, and really our future."
    },
    {
      "start": 18.5,
      "end": 21.5,
      "text": "Prior to using Navan, we used a company called Egencia."
    },
    {
      "start": 21.5,
      "end": 28.5,
      "text": "And what we found with Egencia is that it just wasn't really fit for purpose for a global business like ours."
    },
    {
      "start": 28.5,
      "end": 33.0,
      "text": "We were not at all getting the corporate rates that we expected,"
    },
    {
      "start": 33.0,
      "end": 38.0,
      "text": "and we need an intuitive system that each individual can plan their travel on their own."
    },
    {
      "start": 38.0,
      "end": 40.5,
      "text": "Egencia did not provide that to us."
    },
    {
      "start": 40.5,
      "end": 47.0,
      "text": "And so we went out and looked for a new system, a new platform, and Navan clicked all the boxes for us."
    },
    {
      "start": 47.0,
      "end": 52.0,
      "text": "Once we selected Navan as our partner, the implementation could not have been easier."
    },
    {
      "start": 52.0,
      "end": 57.5,
      "text": "The entire process lasted less than 30 days. It was just a few weeks and we were up and running."
    },
    {
      "start": 57.5,
      "end": 64.0,
      "text": "As a global business, we're operating in all different time zones. We need to have 24/7 support."
    },
    {
      "start": 64.0,
      "end": 71.5,
      "text": "We need somebody accessible on the other end of the line, whether that's by phone or by chat."
    },
    {
      "start": 71.5,
      "end": 74.5,
      "text": "And Navan has always been there for us when we've needed them."
    },
    {
      "start": 74.5,
      "end": 84.5,
      "text": "And so having somebody who's there when you're panicked, when your flight gets canceled, when your hotel maybe isn't what you expected, Navan is always there."
    },
    {
      "start": 84.5,
      "end": 88.0,
      "text": "So we're seeing really great savings from Navan."
    },
    {
      "start": 88.0,
      "end": 98.0,
      "text": "I actually just heard from our VP of Finance. We saw over 10% savings in just the first half of 2025 from the negotiated rates that we're seeing from Navan Travel."
    },
    {
      "start": 98.0,
      "end": 105.0,
      "text": "When we're booking travel, there are a number of different choices that employees have at their fingertips."
    },
    {
      "start": 105.0,
      "end": 113.0,
      "text": "So many of these policies that we have are for our employees' safety and security. And we want to make sure that we're maintaining that when the employees are booking their travel."
    },
    {
      "start": 113.0,
      "end": 118.0,
      "text": "We're also, of course, maintaining a budget. And so we want to have oversight when the employees are booking travel"
    },
    {
      "start": 118.0,
      "end": 128.5,
      "text": "and adherence to those policies so that we can stay within budget and make sure that everybody's safe."
    },
    {
      "start": 128.5,
      "end": 134.0,
      "text": "So at Deputy, we value travel so much and we want our employees to get excited about travel."
    },
    {
      "start": 134.0,
      "end": 140.0,
      "text": "The last thing that we want is for people to be bogged down by the administrative burden of travel."
    },
    {
      "start": 140.0,
      "end": 147.0,
      "text": "And Navan helps us to wipe all of that away. It just makes it easy for us and people can focus on visiting our employees, our customers, and focus on what matters."
    }
  ]
}