{
  "full_text": "Fever-Tree's headquarters are in London and we also have offices in Munich, New York and Sydney. Fever-Tree sell premium mixers. We're currently in the Fever-Tree Bar and this is what we call our brand home. It's really important for the Fever-Tree sales team to meet with our customers in a space such as this so that we can demonstrate our products in this premium environment. Fever-Tree had a travel and expense policy in place. It was a document that was circulated amongst staff and it was up to the individuals to make sure that they complied with that policy. People tended to book their own travel and claim that back through expenses. So we wanted to create a single process for people to book through the platform. And we wanted to be able to embed the travel within that expense process as well. I think some of the pain points that we experienced managing travel was just the unknown. We didn't necessarily know who was traveling when until we received an expense coming in. So it was always a case that we were quite reactive to the process rather than being proactive, knowing when people are, signing off travel ahead of time and understanding why that travel is taking place. That process now has largely gone away. People are reimbursed as the expense happens and the travel is booked and paid for through a virtual card rather than on individual's expenses. We've saved 2 days from the finance team on a monthly basis in terms of administering expenses and reimbursing people because those monthly processes were quite manual before. On the traveler's side, there's also been savings in terms of booking those flights through the platform or hotels, but also less time in then having to upload receipts for their flights, for the hotels, and for other expenses that they might be incurring. My favorite travel feature is that we can know where all our travelers are at any given time. That really helps with any kind of duty of care. Navan enables us to do carbon reporting on our travel, giving us those insights on our carbon emissions that will be really useful in terms of understanding our carbon footprint as a business and understanding how we can manage that through our sustainability team. With Navan we are able to manage our cost much more effectively because we have much better visibility over what we're spending on a real time basis. We've made 14% savings on flights and 22% savings on hotels. Most employees have access to a Navan card at Fever-Tree and that is based on whether they are spending a significant amount of time on travel. My favorite expense feature in Navan is the fact that I can do pretty much everything on my phone. I can record all of my expenses as I use my Navan card. The expense immediately pops up and I can add the receipt in real time. So it's super convenient. Realtime visibility and reporting has been one of the key selling points for us with Navan. It's enabled us to understand trips as they are happening and then the cost is immediately updated in any kind of dashboard or report. So we can immediately see how we're tracking against budget. Our employees are enjoying using Navan. We have a customer satisfaction rate of 4.9 out of 5, which is really positive. If I had to describe Navan, it would be that it's convenient, it's intuitive and it's all in one.",
  "segments": [
    {
      "start": 0.0,
      "end": 5.1,
      "text": "Fever-Tree's headquarters are in London"
    },
    {
      "start": 5.1,
      "end": 10.9,
      "text": "and we also have offices in Munich, New York and Sydney."
    },
    {
      "start": 10.9,
      "end": 13.5,
      "text": "Fever-Tree sell premium mixers."
    },
    {
      "start": 13.5,
      "end": 17.5,
      "text": "We're currently in the Fever-Tree Bar and this is what we call our brand home."
    },
    {
      "start": 17.5,
      "end": 22.1,
      "text": "It's really important for the Fever-Tree sales team to meet with our customers"
    },
    {
      "start": 22.1,
      "end": 26.0,
      "text": "in a space such as this so that we can demonstrate our products in this premium environment."
    },
    {
      "start": 26.0,
      "end": 30.2,
      "text": "Fever-Tree had a travel and expense policy in place."
    },
    {
      "start": 30.2,
      "end": 34.6,
      "text": "It was a document that was circulated amongst staff and it was up to the individuals"
    },
    {
      "start": 34.6,
      "end": 37.8,
      "text": "to make sure that they complied with that policy."
    },
    {
      "start": 37.8,
      "end": 42.0,
      "text": "People tended to book their own travel and claim that back through expenses."
    },
    {
      "start": 42.0,
      "end": 46.8,
      "text": "So we wanted to create a single process for people to book through the platform."
    },
    {
      "start": 46.8,
      "end": 51.5,
      "text": "And we wanted to be able to embed the travel within that expense process as well."
    },
    {
      "start": 51.5,
      "end": 56.4,
      "text": "I think some of the pain points that we experienced managing travel was just the unknown."
    },
    {
      "start": 56.4,
      "end": 61.2,
      "text": "We didn't necessarily know who was traveling when until we received an expense coming in."
    },
    {
      "start": 61.2,
      "end": 66.5,
      "text": "So it was always a case that we were quite reactive to the process rather than being proactive,"
    },
    {
      "start": 66.5,
      "end": 71.1,
      "text": "knowing when people are, signing off travel ahead of time"
    },
    {
      "start": 71.1,
      "end": 73.8,
      "text": "and understanding why that travel is taking place."
    },
    {
      "start": 73.8,
      "end": 76.5,
      "text": "That process now has largely gone away."
    },
    {
      "start": 76.5,
      "end": 81.3,
      "text": "People are reimbursed as the expense happens and the travel is booked and paid for through"
    },
    {
      "start": 81.3,
      "end": 84.7,
      "text": "a virtual card rather than on individual's expenses."
    },
    {
      "start": 84.7,
      "end": 87.8,
      "text": "We've saved 2 days from the finance team on a monthly basis"
    },
    {
      "start": 87.8,
      "end": 93.4,
      "text": "in terms of administering expenses and reimbursing people because those monthly processes"
    },
    {
      "start": 93.4,
      "end": 95.8,
      "text": "were quite manual before."
    },
    {
      "start": 95.8,
      "end": 99.8,
      "text": "On the traveler's side, there's also been savings in terms of booking those flights"
    },
    {
      "start": 99.8,
      "end": 105.0,
      "text": "through the platform or hotels, but also less time in then having to upload receipts"
    },
    {
      "start": 105.0,
      "end": 110.0,
      "text": "for their flights, for the hotels, and for other expenses that they might be incurring."
    },
    {
      "start": 110.0,
      "end": 115.3,
      "text": "My favorite travel feature is that we can know where all our travelers are at any given time."
    },
    {
      "start": 115.3,
      "end": 118.8,
      "text": "That really helps with any kind of duty of care."
    },
    {
      "start": 118.8,
      "end": 122.1,
      "text": "Navan enables us to do carbon reporting on our travel,"
    },
    {
      "start": 122.1,
      "end": 126.5,
      "text": "giving us those insights on our carbon emissions that will be really useful"
    },
    {
      "start": 126.5,
      "end": 132.0,
      "text": "in terms of understanding our carbon footprint as a business and understanding how we can"
    },
    {
      "start": 132.0,
      "end": 135.2,
      "text": "manage that through our sustainability team."
    },
    {
      "start": 135.2,
      "end": 139.5,
      "text": "With Navan we are able to manage our cost much more effectively"
    },
    {
      "start": 139.5,
      "end": 143.5,
      "text": "because we have much better visibility over what we're spending on a real time basis."
    },
    {
      "start": 143.5,
      "end": 148.8,
      "text": "We've made 14% savings on flights and 22% savings on hotels."
    },
    {
      "start": 148.8,
      "end": 153.1,
      "text": "Most employees have access to a Navan card at Fever-Tree"
    },
    {
      "start": 153.1,
      "end": 157.0,
      "text": "and that is based on whether they are spending a significant amount of time on travel."
    },
    {
      "start": 157.0,
      "end": 161.4,
      "text": "My favorite expense feature in Navan is the fact that I can do pretty much everything on my phone."
    },
    {
      "start": 161.4,
      "end": 166.3,
      "text": "I can record all of my expenses as I use my Navan card."
    },
    {
      "start": 166.3,
      "end": 170.8,
      "text": "The expense immediately pops up and I can add the receipt in real time."
    },
    {
      "start": 170.8,
      "end": 173.8,
      "text": "So it's super convenient."
    },
    {
      "start": 173.8,
      "end": 179.3,
      "text": "Realtime visibility and reporting has been one of the key selling points for us with Navan."
    },
    {
      "start": 179.3,
      "end": 184.8,
      "text": "It's enabled us to understand trips as they are happening"
    },
    {
      "start": 184.8,
      "end": 189.6,
      "text": "and then the cost is immediately updated in any kind of dashboard or report."
    },
    {
      "start": 189.6,
      "end": 194.2,
      "text": "So we can immediately see how we're tracking against budget."
    },
    {
      "start": 194.2,
      "end": 197.8,
      "text": "Our employees are enjoying using Navan."
    },
    {
      "start": 197.8,
      "end": 202.8,
      "text": "We have a customer satisfaction rate of 4.9 out of 5, which is really positive."
    },
    {
      "start": 202.8,
      "end": 209.1,
      "text": "If I had to describe Navan, it would be that it's convenient, it's intuitive and it's all in one."
    }
  ]
}