{
  "full_text": "Navan is the travel booking platform that all of our employees as well as our guests use to book travel while ensuring that we have the right controls in place for those travel bookings. Connection and collaboration are really important to us at Canva, it's a big part of our culture, and Navan certainly helps us to facilitate that in a way that's very easy, but also ensures that we are controlling costs. Canva is a global company that's really focused on empowering the world to design. We provide the technology that lets people build any sort of content that they want across any platform. Navan is really focused on the user experience and so for our users there's a lot of simplicity in how they engage with the travel experience. Previously before Navan, people weren't able to really self-serve their own travel needs. But we found with Navan that it's really easy to make sure that if people need to make changes or update their bookings, they're able to do that themselves and it doesn't fall on one person on our internal teams to handle. So we really love how flexible it is. Navan for me is just an absolute godsend. It's easy, I can do things even from my phone which is great as an assistant when you're always running around doing things. I just think that it's just really been a game changer in terms of being able to do everything in the one platform. Navan helps Canva save on travel through a number of different policy settings and functionality in the tool itself. So having the ability to set those dynamic benchmarks I think is one of the primary ways that we ensure people have got a very clear understanding of what's within policy and what's outside of policy. And I think the rewards also complement those settings really well, where people are incentivized to help save money on their travel bookings with Navan reward points. The most beneficial reports that I use pretty frequently within Navan is just understanding who's traveling where, when. I find that real-time insight into what's going on across the company gives us the data that we need to make sure we have the right services where people might be. Navan gives us the data to know not just where people have gone but where they're going and so we can actually make sure that we are putting in place services and partner services that will support those needs. The way I'd describe Navan to someone who hasn't used it before is that it's quite simple and intuitive for the travel booker, but quite powerful for the admins in terms of what they can customize and how they can configure it to their needs.",
  "segments": [
    {
      "start": 0.0,
      "end": 8.0,
      "text": "Navan is the travel booking platform that all of our employees as well as our guests use to book travel"
    },
    {
      "start": 8.0,
      "end": 13.0,
      "text": "while ensuring that we have the right controls in place for those travel bookings."
    },
    {
      "start": 13.0,
      "end": 20.0,
      "text": "Connection and collaboration are really important to us at Canva, it's a big part of our culture,"
    },
    {
      "start": 20.0,
      "end": 26.5,
      "text": "and Navan certainly helps us to facilitate that in a way that's very easy, but also ensures that we are controlling costs."
    },
    {
      "start": 27.0,
      "end": 32.0,
      "text": "Canva is a global company that's really focused on empowering the world to design."
    },
    {
      "start": 32.0,
      "end": 38.0,
      "text": "We provide the technology that lets people build any sort of content that they want across any platform."
    },
    {
      "start": 38.0,
      "end": 43.0,
      "text": "Navan is really focused on the user experience and so for our users"
    },
    {
      "start": 43.0,
      "end": 48.0,
      "text": "there's a lot of simplicity in how they engage with the travel experience."
    },
    {
      "start": 48.0,
      "end": 55.0,
      "text": "Previously before Navan, people weren't able to really self-serve their own travel needs."
    },
    {
      "start": 55.0,
      "end": 62.0,
      "text": "But we found with Navan that it's really easy to make sure that if people need to make changes or update their bookings,"
    },
    {
      "start": 62.0,
      "end": 69.0,
      "text": "they're able to do that themselves and it doesn't fall on one person on our internal teams to handle."
    },
    {
      "start": 69.0,
      "end": 71.0,
      "text": "So we really love how flexible it is."
    },
    {
      "start": 109.0,
      "end": 113.5,
      "text": "Navan for me is just an absolute godsend. It's easy, I can do things even from my phone"
    },
    {
      "start": 113.5,
      "end": 118.0,
      "text": "which is great as an assistant when you're always running around doing things."
    },
    {
      "start": 118.0,
      "end": 124.0,
      "text": "I just think that it's just really been a game changer in terms of being able to do everything in the one platform."
    },
    {
      "start": 124.0,
      "end": 131.0,
      "text": "Navan helps Canva save on travel through a number of different policy settings and functionality in the tool itself."
    },
    {
      "start": 131.0,
      "end": 136.0,
      "text": "So having the ability to set those dynamic benchmarks I think is one of the primary ways"
    },
    {
      "start": 136.0,
      "end": 142.0,
      "text": "that we ensure people have got a very clear understanding of what's within policy and what's outside of policy."
    },
    {
      "start": 142.0,
      "end": 148.0,
      "text": "And I think the rewards also complement those settings really well, where people are incentivized"
    },
    {
      "start": 148.0,
      "end": 152.0,
      "text": "to help save money on their travel bookings with Navan reward points."
    },
    {
      "start": 152.5,
      "end": 158.5,
      "text": "The most beneficial reports that I use pretty frequently within Navan is just understanding who's traveling where, when."
    },
    {
      "start": 158.5,
      "end": 165.0,
      "text": "I find that real-time insight into what's going on across the company gives us the data that we need"
    },
    {
      "start": 165.0,
      "end": 172.0,
      "text": "to make sure we have the right services where people might be. Navan gives us the data to know"
    },
    {
      "start": 172.0,
      "end": 179.0,
      "text": "not just where people have gone but where they're going and so we can actually make sure that we are putting in place"
    },
    {
      "start": 179.0,
      "end": 184.0,
      "text": "services and partner services that will support those needs."
    },
    {
      "start": 185.0,
      "end": 190.0,
      "text": "The way I'd describe Navan to someone who hasn't used it before is that it's quite simple and intuitive"
    },
    {
      "start": 190.0,
      "end": 197.0,
      "text": "for the travel booker, but quite powerful for the admins in terms of what they can customize and how they can configure it to their needs."
    }
  ]
}