{
  "full_text": "ThoughtSpot is a business analytics tool for the agentic AI age. So we develop tools that help businesses make decisions and act on information inside and outside of their business. We're located in Mountain View. We've been around 13 years and have over 900 employees globally. Before Navan, we really had a pretty chaotic system. As a startup company, so we pretty much had ad hoc systems. People used various Orbits or Expedia or personal travel agents to manage their travel. It was pretty chaotic. So I've been a CFO for about 15 years in Silicon Valley. I worked with many companies and for prior companies, I've not used Navan. We were using other legacy tools from large travel companies and large vendors in the travel experience marketplace. They're really bulky. They're inefficient. They actually provide more complications to create the booking. Navan is the first travel platform that's provided the user experience that you expect from our users as a consumer-friendly, forward-looking product, but also the backend controls that are user-friendly to the accounting team, to the financial team and visibility to the CFO. So that you can help manage the travel and expense spend. This last year, I think we added about $50,000 in gross savings just on the airline options. We've improved our ability to control travel that's out of policy and we've looked at ways to improve our travelers' experiences with mobile applications and better options to change their bookings en route. So Navan has a series of analytics that we've continued to go deeper on with Navan over the time. Early on, we got a first level look at what was going on with the travel spend. That was very helpful from just no information at all before we were with Navan. We've now further expanded that partnership and added a product that Navan's using as a partnership with ThoughtSpot inside the tool called Advanced Analytics. We let that tool go deeper for us. It actually includes an AI module as well that lets us go insightful and be more deep about the product spend and the travel controls we want to put in place. If we had to put the Navan relationship in three words, we'd look at seamless, collaborative, and aligned. It's a seamless experience because our employees through our back office team can see the whole portfolio of travel spend in terms of control and flexibility and getting our impact for our business. Two is collaborative because we're really partnering with the Navan team to see features and benefits. They've shown us places where we can get savings and see control, but also give us flexibility to our users to book what they want when they want to book them. And aligned because we see the opportunity for advanced analytics and things about managing the spend in a more collaborative way.",
  "segments": [
    {
      "start": 0.0,
      "end": 12.0,
      "text": "ThoughtSpot is a business analytics tool for the agentic AI age. So we develop tools that help businesses make decisions and act on information inside and outside of their business."
    },
    {
      "start": 12.0,
      "end": 19.5,
      "text": "We're located in Mountain View. We've been around 13 years and have over 900 employees globally."
    },
    {
      "start": 19.5,
      "end": 31.0,
      "text": "Before Navan, we really had a pretty chaotic system. As a startup company, so we pretty much had ad hoc systems. People used various Orbits or Expedia or personal travel agents to manage their travel."
    },
    {
      "start": 31.0,
      "end": 50.0,
      "text": "So I've been a CFO for about 15 years in Silicon Valley. For prior companies, I've not used Navan. We were using other legacy tools from large travel companies. They're really bulky. They're inefficient."
    },
    {
      "start": 50.0,
      "end": 67.0,
      "text": "Navan is the first travel platform that's provided the user experience that you expect from our users as a consumer-friendly, forward-looking product, but also the backend controls that are user-friendly to the accounting team."
    },
    {
      "start": 67.0,
      "end": 107.0,
      "text": "Visibility to the CFO so that you can help manage the travel and expense spend. This last year, I think we added about $50,000 in gross savings just on the airline options."
    },
    {
      "start": 107.0,
      "end": 123.0,
      "text": "We've improved our ability to control travel that's out of policy and we've looked at ways to improve our travelers' experiences with mobile applications."
    },
    {
      "start": 123.0,
      "end": 151.0,
      "text": "We've now further expanded that partnership and added a product that Navan's using as a partnership with ThoughtSpot inside the tool called Advanced Analytics."
    },
    {
      "start": 151.0,
      "end": 223.0,
      "text": "If we had to put the Navan relationship in three words, we'd look at seamless, collaborative, and aligned. It's a seamless experience because our employees through our back office team can see the whole portfolio of travel spend."
    }
  ]
}