{
  "full_text": "As a global head of mobility and travel, Navan gives me all the solutions I need to manage our travel programme efficiently in a way that is customer-centric and data-driven, which suits our DNA as a company. HelloFresh changes the way people eat forever. This is our mission and we are revolutionising the food supply chain with ready-to-eat meals, meal kits, pet food, and meat products. We are active in 18 markets. Our headquarters is here in Germany, in Berlin. Before onboarding Navan, we had a very manual travel booking system. We had a travel manager who was basically doing the bookings for the traveller. Before Navan, travel management was a chaotic situation. All bookings were done manually and every invoice was chased manually. It gave a very unpleasant employee and travel experience. Navan completely revolutionised travel at HelloFresh. For us as the travel department, we have to deal a lot less with operational steps such as chasing invoices and troubleshooting. Navan gives me the perfect solution for the travel department. All the insights that I need, the booking options. Navan solved my problem with travel. Having an integration between Workday and Navan for us is really one of the most important points of having Navan, because having employees added to the tool from one day to the other and directed to the right cost centre, to the right entity, to the right approver. If that had to be done manually, so many human errors could happen. Before Navan, we did not have all the data in one place. So we couldn't analyse our employees' behaviour or our travellers' behaviour in a way that helps us make meaningful learnings and reduce our travel costs or increase the experience. We did not know where the bottlenecks were. Navan's reporting allows us to know how many people are travelling, where are they travelling to, what are they spending the most money on, where do we have savings potential. So the very good reporting that we have is really one of the best things for us as a data-driven company because it really allows us to know what's going on. I can pull a report so easily and the business is so grateful when I send them a report in 10 minutes. They get so much value out of it and for me, it's so easy to do it. In my day-to-day tasks, Navan had a huge impact. I am personally grateful for Navan as a travel manager. And I got the time now to enjoy my work and to think of strategies. I can think of what the business needs and this is key for success. Navan is customer-centric, is efficient, and is absolutely transparent.",
  "segments": [
    {
      "start": 0.0,
      "end": 5.4,
      "text": "As a global head of mobility and travel, Navan gives me all the solutions I need"
    },
    {
      "start": 5.4,
      "end": 10.6,
      "text": "to manage our travel programme efficiently in a way that is customer-centric and data-driven,"
    },
    {
      "start": 10.6,
      "end": 14.1,
      "text": "which suits our DNA as a company."
    },
    {
      "start": 21.0,
      "end": 23.9,
      "text": "HelloFresh changes the way people eat forever."
    },
    {
      "start": 23.9,
      "end": 28.5,
      "text": "This is our mission and we are revolutionising the food supply chain"
    },
    {
      "start": 28.5,
      "end": 33.3,
      "text": "with ready-to-eat meals, meal kits, pet food, and meat products."
    },
    {
      "start": 33.3,
      "end": 34.8,
      "text": "We are active in 18 markets."
    },
    {
      "start": 34.8,
      "end": 38.4,
      "text": "Our headquarters is here in Germany, in Berlin."
    },
    {
      "start": 40.5,
      "end": 44.9,
      "text": "Before onboarding Navan, we had a very manual travel booking system."
    },
    {
      "start": 44.9,
      "end": 48.9,
      "text": "We had a travel manager who was basically doing the bookings for the traveller."
    },
    {
      "start": 48.9,
      "end": 52.8,
      "text": "Before Navan, travel management was a chaotic situation."
    },
    {
      "start": 52.8,
      "end": 57.8,
      "text": "All bookings were done manually and every invoice was chased manually."
    },
    {
      "start": 57.8,
      "end": 102.2,
      "text": "It gave a very unpleasant employee and travel experience."
    },
    {
      "start": 102.2,
      "end": 105.7,
      "text": "Navan completely revolutionised travel at HelloFresh."
    },
    {
      "start": 105.7,
      "end": 109.1,
      "text": "For us as the travel department, we have to"
    },
    {
      "start": 109.1,
      "end": 114.7,
      "text": "deal a lot less with operational steps such as chasing invoices and troubleshooting."
    },
    {
      "start": 114.7,
      "end": 119.2,
      "text": "Navan gives me the perfect solution for the travel department."
    },
    {
      "start": 119.2,
      "end": 122.3,
      "text": "All the insights that I need, the booking options."
    },
    {
      "start": 122.3,
      "end": 124.6,
      "text": "Navan solved my problem with travel."
    },
    {
      "start": 124.6,
      "end": 129.8,
      "text": "Having an integration between Workday and Navan for us is really one of the most important points of having Navan,"
    },
    {
      "start": 129.8,
      "end": 137.4,
      "text": "because having employees added to the tool from one day to the other and directed to the right cost centre, to the right entity, to the right approver."
    },
    {
      "start": 137.4,
      "end": 145.4,
      "text": "If that had to be done manually, so many human errors could happen."
    },
    {
      "start": 145.4,
      "end": 150.3,
      "text": "Before Navan, we did not have all the data in one place."
    },
    {
      "start": 150.3,
      "end": 155.0,
      "text": "So we couldn't analyse our employees' behaviour or our travellers' behaviour."
    },
    {
      "start": 155.0,
      "end": 160.7,
      "text": "in a way that helps us make meaningful learnings and reduce our travel costs or increase the experience."
    },
    {
      "start": 160.7,
      "end": 163.7,
      "text": "We did not know where the bottlenecks were."
    },
    {
      "start": 163.7,
      "end": 168.1,
      "text": "Navan's reporting allows us to know how many people are travelling,"
    },
    {
      "start": 168.1,
      "end": 172.6,
      "text": "where are they travelling to, what are they spending the most money on,"
    },
    {
      "start": 172.6,
      "end": 174.5,
      "text": "where do we have savings potential."
    },
    {
      "start": 174.5,
      "end": 179.7,
      "text": "So the very good reporting that we have is really one of the best things for us as a data-driven company"
    },
    {
      "start": 179.7,
      "end": 182.2,
      "text": "because it really allows us to know what's going on."
    },
    {
      "start": 182.2,
      "end": 184.8,
      "text": "I can pull a report so easily."
    },
    {
      "start": 184.8,
      "end": 189.9,
      "text": "And the business is so grateful when I send them a report in 10 minutes."
    },
    {
      "start": 189.9,
      "end": 192.5,
      "text": "They get so much value out of it."
    },
    {
      "start": 192.5,
      "end": 194.5,
      "text": "And for me, it's so easy to do it."
    },
    {
      "start": 194.5,
      "end": 198.8,
      "text": "In my day-to-day tasks, Navan had a huge impact."
    },
    {
      "start": 198.8,
      "end": 202.9,
      "text": "I am personally grateful for Navan as a travel manager."
    },
    {
      "start": 202.9,
      "end": 207.2,
      "text": "And I got the time now to enjoy my work and to think of strategies."
    },
    {
      "start": 207.2,
      "end": 213.1,
      "text": "I can think of what the business needs. And this is key for success."
    },
    {
      "start": 213.1,
      "end": 221.0,
      "text": "Navan is customer-centric, is efficient, and is absolutely transparent."
    }
  ]
}