{
  "full_text": "Welcome to Navan, the global travel and expense solution loved by CFOs and employees alike. Navan saves you time and money while giving you full visibility and control of spend. Let's see how. Booking a business trip, inviting guests to book, or booking a team offsite takes just minutes. Navan has a huge global inventory of flights, hotels, trains, and car rentals. In many cases, you'll find deals on hotels in our lodging collection. With every search, Navan calculates the optimal travel price based on the destination, travel dates, and time of booking. These dynamic policies show your employees exactly what they can and can't book. Navan also incentivizes your employees to book responsibly, earning rewards for personal travel while saving your company money. The Navan app is the perfect travel companion, providing travelers with the information they need in real time. And if help is needed, Navan's world-class travel concierges perform their magic 24/7. Your VIPs can enjoy an elevated high-touch travel service with Navan Pro. Say goodbye to manual expense reports. With the swipe of a card, transaction details are instantly captured and the expense is either approved automatically or flagged for review. With Navan Connect, link your existing corporate cards and all expenses are synced in real time. You keep the loyalty, rewards, rebates, and banking relationships that matter most to you. Expenses are auto-categorized and reconciled, eliminating the need for employees to submit expense reports while allowing finance teams to close the books at lightning speed. No corporate card? No problem. Employees can submit out-of-pocket expenses by snapping a photo of their receipt. They'll get reimbursed directly to their bank account in their local currency in days. Navan gives real-time visibility over spend with customizable dashboards and integrates with the tools you already use. All of these make Navan loved by employees and CFOs alike. Are you ready to see your company savings take off? Schedule a call or begin experiencing Navan for free today.",
  "segments": [
    {
      "start": 0.0,
      "end": 6.3,
      "text": "Welcome to Navan, the global travel and expense solution loved by CFOs and employees alike."
    },
    {
      "start": 6.3,
      "end": 11.8,
      "text": "Navan saves you time and money while giving you full visibility and control of spend."
    },
    {
      "start": 11.8,
      "end": 23.7,
      "text": "Booking a business trip, inviting guests to book, or booking a team offsite takes just minutes. Navan has a huge global inventory of flights, hotels, trains, and car rentals."
    },
    {
      "start": 23.7,
      "end": 35.1,
      "text": "In many cases, you'll find deals on hotels in our lodging collection. With every search, Navan calculates the optimal travel price based on the destination, travel dates, and time of booking."
    },
    {
      "start": 35.1,
      "end": 41.9,
      "text": "These dynamic policies show your employees exactly what they can and can't book."
    },
    {
      "start": 41.9,
      "end": 49.3,
      "text": "Navan also incentivizes your employees to book responsibly, earning rewards for personal travel while saving your company money."
    },
    {
      "start": 49.3,
      "end": 56.4,
      "text": "The Navan app is the perfect travel companion, providing travelers with the information they need in real time."
    },
    {
      "start": 56.4,
      "end": 103.1,
      "text": "And if help is needed, Navan's world-class travel concierges perform their magic 24/7. Your VIPs can enjoy an elevated high-touch travel service with Navan Pro."
    },
    {
      "start": 103.1,
      "end": 120.3,
      "text": "Say goodbye to manual expense reports. With the swipe of a card, transaction details are instantly captured and the expense is either approved automatically or flagged for review."
    },
    {
      "start": 120.3,
      "end": 130.6,
      "text": "With Navan Connect, link your existing corporate cards and all expenses are synced in real time. You keep the loyalty, rewards, rebates, and banking relationships that matter most to you."
    },
    {
      "start": 130.6,
      "end": 139.7,
      "text": "Expenses are auto-categorized and reconciled, eliminating the need for employees to submit expense reports while allowing finance teams to close the books at lightning speed."
    },
    {
      "start": 139.7,
      "end": 152.3,
      "text": "No corporate card? No problem. Employees can submit out-of-pocket expenses by snapping a photo of their receipt. They'll get reimbursed directly to their bank account in their local currency in days."
    },
    {
      "start": 152.3,
      "end": 158.4,
      "text": "Navan gives real-time visibility over spend with customizable dashboards and integrates with the tools you already use."
    },
    {
      "start": 158.4,
      "end": 204.6,
      "text": "All of these make Navan loved by employees and CFOs alike. Are you ready to see your company savings take off? Schedule a call or begin experiencing Navan for free today."
    }
  ]
}