{
  "full_text": "The Buddha said, it's the journey that matters, not the destination. But the Buddha never traveled for work. He never arrived at his hotel after midnight to find that his reservation disappeared. Or spent his weekends filing expense reports. He never had to stay a night here or get a pat down there. The Buddha never got stuck in the middle seat on a red-eye next to this guy. No wonder he was enlightened. In business, what matters most is the connection that starts the moment you arrive. It's all about showing up and being there. Being there, so you can read the room and pivot as soon as your client sneaks a look at his phone. Being there, because you know that business trips are about everything other than the meeting. They're about chemistry and eye rolls and happy hours. Humans use 18 different smiles, but only one reflects true happiness. And no matter how hard you squint, you'll never be able to see that smile through your screen. With Navan, you'll see it live and in person. We'll help you get there and we've got your back if something goes wrong. Navan is here to move people and ideas and businesses forward. To bring everyone closer together. That's the business we're in. The being there business. The handshake business. The sidebar after the dinner after the meeting business. The chat over coffee that changes everything business. So let's go take the dread out of work travel and put some humanity back in business. Let's go make travel so effortless and easy that it's no longer a pain but a perk. Let's go celebrate what happens when Yin meets Yang. When the left brains grab drinks with the right brains. Let's go get the dreamers and the doers in the same room at the same time so they can work their magic. Navan. Making travel easy for every frequent traveler.",
  "segments": [
    {
      "start": 0.0,
      "end": 7.0,
      "text": "The Buddha said, it's the journey that matters, not the destination. But the Buddha never traveled for work."
    },
    {
      "start": 7.0,
      "end": 14.0,
      "text": "He never arrived at his hotel after midnight to find that his reservation disappeared. Or spent his weekends filing expense reports."
    },
    {
      "start": 14.0,
      "end": 28.0,
      "text": "He never had to stay a night here or get a pat down there. The Buddha never got stuck in the middle seat on a red-eye next to this guy. No wonder he was enlightened."
    },
    {
      "start": 28.0,
      "end": 45.0,
      "text": "In business, what matters most is the connection that starts the moment you arrive. It's all about showing up and being there."
    },
    {
      "start": 45.0,
      "end": 60.0,
      "text": "Humans use 18 different smiles, but only one reflects true happiness. And no matter how hard you squint, you'll never be able to see that smile through your screen."
    },
    {
      "start": 60.0,
      "end": 105.0,
      "text": "With Navan, you'll see it live and in person. We'll help you get there and we've got your back if something goes wrong."
    },
    {
      "start": 105.0,
      "end": 125.0,
      "text": "Navan is here to move people and ideas and businesses forward. That's the business we're in. The chat over coffee that changes everything business."
    },
    {
      "start": 125.0,
      "end": 140.0,
      "text": "So let's go take the dread out of work travel and put some humanity back in business. Let's go make travel so effortless and easy that it's no longer a pain but a perk."
    },
    {
      "start": 140.0,
      "end": 152.0,
      "text": "Let's go get the dreamers and the doers in the same room so they can work their magic. Navan. Making travel easy for every frequent traveler."
    }
  ]
}