{
  "full_text": "SumUp's main offices are located in Berlin, in London, in Sofia, in Sao Paulo and all over the world. Today we are present now on four continents. Very often, you know, we are traveling because of many team events and off-sites, hackathons. We believe that the magic is in the team, that's why we like to meet each other. I helped the team celebrate and organize a lot of events that come with expenses and thanks to Navan, I have a partner in managing expenses and the reporting. Before Navan, SumUp handled travel and expense in a mixed way. A lot of people were expensing out-of-pocket expenses and it was a nightmare, maybe is the word that best describes this process. If I have to describe the previous solutions that we used, I would say they were time-consuming, layered and non-intuitive. We had one solution for travel, one solution for expenses. Many of them from the employees' perspective and then hard from finance perspective to control the expenses, also to get proper reporting. But with Navan, everything changed. This is the first time that we have a consolidated solution for all our needs in those areas. We were using three tools previously, we were able to aggregate them in one. Navan offers us all the travel, expense and reporting features that we had in the previous tools, but in one place. We have visibility, the dashboards are really clear. We've seen impact because now people are actually using the service. For instance, we've seen a 23% increase in the adoption rate, which means that people are actually enjoying the solution. It makes me feel very safe. It's very simple to use, it's super intuitive. It's easy to attach the receipts afterwards. It's super fast in terms of the transaction going through. I use the physical card, which is always with me, because very often we are paying some things for the office with the card, so it's very practical to have it. We feel that Navan as a solution for the European market for us was not a difficult choice to make because you, just like us, are a global business with local impact. The NPS score that we've shown is like plus 47 percentage, which is quite high achievement. SumUp clap is when we achieve something. We just celebrate with the SumUp clap. This is the SumUp clap that everybody's talking about. We celebrate Navan with the SumUp clap!",
  "segments": [
    {
      "start": 0.0,
      "end": 13.0,
      "text": "SumUp's main offices are located in Berlin, in London, in Sofia, in Sao Paulo and all over the world. Today we are present now on four continents."
    },
    {
      "start": 13.0,
      "end": 24.0,
      "text": "Very often, you know, we are traveling because of many team events and off-sites, hackathons. We believe that the magic is in the team, that's why we like to meet each other."
    },
    {
      "start": 24.0,
      "end": 37.0,
      "text": "I helped the team celebrate and organize a lot of events that come with expenses and thanks to Navan, I have a partner in managing expenses and the reporting."
    },
    {
      "start": 37.0,
      "end": 50.0,
      "text": "Before Navan, SumUp handled travel and expense in a mixed way. A lot of people were expensing out-of-pocket expenses and it was a nightmare, maybe is the word that best describes this process."
    },
    {
      "start": 50.0,
      "end": 1.02,
      "text": "If I have to describe the previous solutions that we used, I would say they were time-consuming, layered and non-intuitive. We had one solution for travel, one solution for expenses."
    },
    {
      "start": 1.02,
      "end": 1.13,
      "text": "Many of them from the employees' perspective and then hard from finance perspective to control the expenses, also to get proper reporting. But with Navan, everything changed."
    },
    {
      "start": 1.13,
      "end": 1.24,
      "text": "This is the first time that we have a consolidated solution for all our needs in those areas."
    },
    {
      "start": 1.24,
      "end": 1.33,
      "text": "We were using three tools previously, we were able to aggregate them in one. Navan offers us all the travel, expense and reporting features that we had in the previous tools, but in one place."
    },
    {
      "start": 1.33,
      "end": 1.43,
      "text": "We have visibility, the dashboards are really clear. We've seen impact because now people are actually using the service."
    },
    {
      "start": 1.43,
      "end": 1.5,
      "text": "For instance, we've seen a 23% increase in the adoption rate, which means that people are actually enjoying the solution."
    },
    {
      "start": 1.5,
      "end": 2.03,
      "text": "It makes me feel very safe. It's very simple to use, it's super intuitive. It's easy to attach the receipts afterwards. It's super fast in terms of the transaction going through."
    },
    {
      "start": 2.03,
      "end": 2.12,
      "text": "I use the physical card, which is always with me, because very often we are paying some things for the office with the card, so it's very practical to have it."
    },
    {
      "start": 2.12,
      "end": 2.25,
      "text": "We feel that Navan as a solution for the European market for us was not a difficult choice to make because you, just like us, are a global business with local impact."
    },
    {
      "start": 2.25,
      "end": 2.33,
      "text": "The NPS score that we've shown is like plus 47 percentage, which is quite high achievement."
    },
    {
      "start": 2.33,
      "end": 2.53,
      "text": "SumUp clap is when we achieve something. We just celebrate with the SumUp clap. This is the SumUp clap that everybody's talking about. We celebrate Navan with the SumUp clap!"
    }
  ]
}