{
  "full_text": "Je m'appelle Julien Lachowski, et je suis FP&A director chez PayFit. PayFit est un logiciel de paie français qui permet une automatisation des processus de paie et plus globalement des Ressources Humaines. Avant Navan, on utilisait une solution qui était peut-être un peu moins simple d'utilisation, et qui nous nécessitait beaucoup de travail en back office. Nous avons choisi Navan pour la profondeur de son catalogue à l'étranger, donc dans les différents pays dans lesquels nous avons besoin de voyager. Aussi pour l'expérience utilisateur, c'est-à-dire la simplicité de cette plateforme, c'est assez intéressant. Ce qu'on appelle l'UX, c'est ça qui nous a fait finalement choisir la solution. On a quand même les mêmes références que sur des plateformes, un peu plus utilisées à titre personnel. Quand on voyage, il ne faut pas qu'on ait de mauvaises surprises et autant au niveau des administrateurs qu'au niveau du voyageur, c'est vraiment le cas avec la plateforme Navan. La possibilité de paramétrer des politiques dynamiques sur Navan, en tant que financier, c'est hyper intéressant, pour la simple et bonne raison qu'en fonction de la période et du prix moyen des hôtels par exemple dans différentes villes, ça va nous permettre d'adapter automatiquement le prix qu'on autorise à nos collaborateurs d'utiliser pour booker leurs hôtels. Et donc, ça va représenter des opportunités d'optimisation des coûts qui sont non négligeables pour nous qui sommes financiers. L'implémentation de Navan, ça a été aussi l'occasion de revoir nos politiques de voyages en interne et nos politiques de voyages un peu \"green\". Donc typiquement, on a mis en place des règles pour favoriser l'utilisation du train Versus l'avion sur certains cas de figure, par exemple, les allers-retours entre le domicile et le lieu de travail, ou des voyages sur des courtes distances. Donc grâce aux rapports qu'on peut sortir sur la plateforme Navan qui vont pouvoir calculer nos émissions de carbone par voyage, ça va nous permettre de calculer beaucoup plus facilement notre bilan carbone en fin d'année et donc de s'apercevoir qu'on arrive grâce à la plateforme Navan à réduire notre empreinte carbone liée au déplacement chez PayFit. La ligne de crédit que nous met à disposition Navan et l'avance de frais que ça représente, ça a beaucoup simplifié les processus comptables puisque avec notre ancienne plateforme, on avait une multitude de transactions qu'on devait comptabiliser et suivre. Et aujourd'hui, on n'a plus qu'une facture en fin de mois, qu'on reçoit, qu'on arrive à importer automatiquement dans notre ERP. Il est vrai que depuis l'implémentation de Navan, on a gagné beaucoup de temps dans la gestion de tous ces frais, dans le tracking des coûts liés aux déplacements de nos collaborateurs. Et donc forcément, pour moi, ça a été du temps gagné. Donc j'ai pu me concentrer sur d'autres tâches à plus forte valeur ajoutée et ça a pu m'aider dans la réalisation de mes objectifs à moyen terme.",
  "segments": [
    {
      "start": 0.0,
      "end": 8.1,
      "text": "Intro and company overview."
    },
    {
      "start": 8.1,
      "end": 13.9,
      "text": "Je m'appelle Julien Lachowski, et je suis FP&A director chez PayFit."
    },
    {
      "start": 13.9,
      "end": 20.8,
      "text": "PayFit est un logiciel de paie français qui permet une automatisation des processus de paie et plus globalement des Ressources Humaines."
    },
    {
      "start": 20.8,
      "end": 29.1,
      "text": "Avant Navan, on utilisait une solution qui était peut-être un peu moins simple d'utilisation, et qui nous nécessitait beaucoup de travail en back office."
    },
    {
      "start": 29.1,
      "end": 37.1,
      "text": "Nous avons choisi Navan pour la profondeur de son catalogue à l'étranger, donc dans les différents pays dans lesquels nous avons besoin de voyager."
    },
    {
      "start": 37.1,
      "end": 44.4,
      "text": "Aussi pour l'expérience utilisateur, c'est-à-dire la simplicité de cette plateforme, c'est assez intéressant."
    },
    {
      "start": 44.4,
      "end": 48.9,
      "text": "Ce qu'on appelle l'UX, c'est ça qui nous a fait finalement choisir la solution."
    },
    {
      "start": 48.9,
      "end": 56.4,
      "text": "On a quand même les mêmes références que sur des plateformes, un peu plus utilisées à titre personnel."
    },
    {
      "start": 56.4,
      "end": 68.2,
      "text": "Quand on voyage, il ne faut pas qu'on ait de mauvaises surprises et autant au niveau des administrateurs qu'au niveau du voyageur, c'est vraiment le cas avec la plateforme Navan."
    },
    {
      "start": 108.9,
      "end": 113.8,
      "text": "La possibilité de paramétrer des politiques dynamiques sur Navan, en tant que financier, c'est hyper intéressant,"
    },
    {
      "start": 113.8,
      "end": 121.7,
      "text": "pour la simple et bonne raison qu'en fonction de la période et du prix moyen des hôtels par exemple dans différentes villes,"
    },
    {
      "start": 121.7,
      "end": 130.6,
      "text": "ça va nous permettre d'adapter automatiquement le prix qu'on autorise à nos collaborateurs d'utiliser pour booker leurs hôtels."
    },
    {
      "start": 130.6,
      "end": 138.4,
      "text": "Et donc, ça va représenter des opportunités d'optimisation des coûts qui sont non négligeables pour nous qui sommes financiers."
    },
    {
      "start": 138.4,
      "end": 149.8,
      "text": "L'implémentation de Navan, ça a été aussi l'occasion de revoir nos politiques de voyages en interne et nos politiques de voyages un peu \"green\"."
    },
    {
      "start": 149.8,
      "end": 161.9,
      "text": "Donc typiquement, on a mis en place des règles pour favoriser l'utilisation du train Versus l'avion sur certains cas de figure, par exemple, les allers-retours entre le domicile et le lieu de travail,"
    },
    {
      "start": 161.9,
      "end": 165.2,
      "text": "ou des voyages sur des courtes distances."
    },
    {
      "start": 165.2,
      "end": 174.4,
      "text": "Donc grâce aux rapports qu'on peut sortir sur la plateforme Navan qui vont pouvoir calculer nos émissions de carbone par voyage,"
    },
    {
      "start": 174.4,
      "end": 182.2,
      "text": "ça va nous permettre de calculer beaucoup plus facilement notre bilan carbone en fin d'année"
    },
    {
      "start": 182.2,
      "end": 192.1,
      "text": "et donc de s'apercevoir qu'on arrive grâce à la plateforme Navan à réduire notre empreinte carbone liée au déplacement chez PayFit."
    },
    {
      "start": 225.1,
      "end": 234.3,
      "text": "La ligne de crédit que nous met à disposition Navan et l'avance de frais que ça représente, ça a beaucoup simplifié les processus comptables"
    },
    {
      "start": 234.3,
      "end": 242.0,
      "text": "puisque avec notre ancienne plateforme, on avait une multitude de transactions qu'on devait comptabiliser et suivre."
    },
    {
      "start": 242.0,
      "end": 249.2,
      "text": "Et aujourd'hui, on n'a plus qu'une facture en fin de mois, qu'on reçoit, qu'on arrive à importer automatiquement dans notre ERP."
    },
    {
      "start": 249.2,
      "end": 259.9,
      "text": "Il est vrai que depuis l'implémentation de Navan, on a gagné beaucoup de temps dans la gestion de tous ces frais, dans le tracking des coûts liés aux déplacements de nos collaborateurs."
    },
    {
      "start": 259.9,
      "end": 268.3,
      "text": "Et donc forcément, pour moi, ça a été du temps gagné. Donc j'ai pu me concentrer sur d'autres tâches à plus forte valeur ajoutée"
    },
    {
      "start": 268.3,
      "end": 277.0,
      "text": "et ça a pu m'aider dans la réalisation de mes objectifs à moyen terme."
    }
  ]
}