{
  "full_text": "Je m'appelle Julien Lachowski et je suis FP&A Director chez Payfit. Alors avant Navan on utilisait une solution qui était peut-être un petit peu moins simple d'utilisation et qui nous nécessitait beaucoup de travail en back office. Nous avons choisi Navan pour la profondeur de son catalogue à l'étranger, donc dans les différents pays dans lesquels nous avons besoin de voyager. Aussi pour l'expérience utilisateur, donc c'est à dire la simplicité de cette plateforme. C'est assez, c'est assez intéressant, c'est ce qui nous a ce qu'on appelle l'UX, c'est ce qui nous a finalement fait choisir la solution. On a quand même les mêmes références que sur des des plateformes, on va dire un peu plus utilisées à titre personnel. Quand on voyage, il faut qu'on ait pas de mauvaise surprise et autant au niveau des administrateurs qu'au niveau du voyageur, et bien c'est vraiment le cas avec la plateforme Navan. La possibilité de paramétrer des politiques dynamiques sur Navan, en tant que financier c'est hyper intéressant. Pour la simple et bonne raison qu'en fonction de la période et du prix moyen des hôtels par exemple dans différentes villes, ça va nous permettre d'adapter automatiquement le prix qu'on autorise à nos collaborateurs d'utiliser pour booker leurs hôtels. Et donc du coup ça va représenter des des opportunités d'optimisation des coûts qui est non négligeable pour nous qui sommes finance. L'implémentation de Navan ça a été aussi l'occasion de revoir nos politiques de voyage en interne et nos politiques de voyage un peu green. Donc typiquement, on a mis en place des règles pour favoriser l'utilisation du train versus l'avion sur certains cas de figure, par exemple les allers-retours entre le domicile et le lieu de travail ou des voyages sur des courtes distances. Donc grâce aux rapports qu'on peut sortir sur la plateforme Navan qui vont pouvoir calculer nos émissions carbone par voyage, et bien ça va nous permettre de calculer beaucoup plus facilement notre bilan carbone en fin d'année et donc du coup de s'apercevoir qu'on arrive grâce à la plateforme Navan à réduire notre empreinte carbone liée aux déplacements chez Payfit. La ligne de crédit que nous met à disposition Navan et l'avance de frais du coup que ça représente, du coup ça a beaucoup simplifié les processus comptables puisqu'en fait avec notre ancienne plateforme, on avait une multitude de transactions qu'on devait comptabiliser et suivre. Et aujourd'hui en fait on n'a plus qu'une facture en fin de mois qu'on reçoit, qu'on arrive à importer automatiquement dans notre ERP. Il est vrai que depuis l'implémentation de Navan, on a gagné beaucoup de temps dans la gestion de tous ces frais, dans le dans le tracking des coûts liés aux déplacements de nos collaborateurs. Et donc du coup forcément pour moi ça a été du temps gagné donc j'ai pu me concentrer sur d'autres tâches à plus forte valeur ajoutée et donc du coup ça a pu m'aider dans la réalisation de mes objectifs à moyen terme.",
  "segments": [
    {
      "start": 0.0,
      "end": 8.1,
      "text": "(Intro Music and branding)"
    },
    {
      "start": 8.2,
      "end": 13.5,
      "text": "Je m'appelle Julien Lachowski et je suis FP&A Director chez Payfit."
    },
    {
      "start": 13.6,
      "end": 20.9,
      "text": "(Text explaining PayFit's business)"
    },
    {
      "start": 21.0,
      "end": 29.5,
      "text": "Alors avant Navan on utilisait une solution qui était peut-être un petit peu moins simple d'utilisation et qui nous nécessitait beaucoup de travail en back office."
    },
    {
      "start": 29.6,
      "end": 49.5,
      "text": "Nous avons choisi Navan pour la profondeur de son catalogue à l'étranger, aussi pour l'expérience utilisateur, c'est ce qu'on appelle l'UX."
    },
    {
      "start": 49.6,
      "end": 1.07,
      "text": "Quand on voyage, il faut qu'on ait pas de mauvaise surprise et autant au niveau des administrateurs qu'au niveau du voyageur, et bien c'est vraiment le cas avec la plateforme Navan."
    },
    {
      "start": 108.0,
      "end": 138.5,
      "text": "La possibilité de paramétrer des politiques dynamiques sur Navan, en tant que financier c'est hyper intéressant... ça nous permet d'adapter automatiquement le prix maximal."
    },
    {
      "start": 139.0,
      "end": 200.5,
      "text": "L'implémentation de Navan ça a été aussi l'occasion de revoir nos politiques de voyage en interne et nos politiques de voyage un peu green."
    },
    {
      "start": 201.0,
      "end": 224.5,
      "text": "Grâce aux rapports... qui vont pouvoir calculer nos émissions carbone par voyage, ça va nous permettre de calculer beaucoup plus facilement notre bilan carbone."
    },
    {
      "start": 225.0,
      "end": 248.5,
      "text": "La ligne de crédit que nous met à disposition Navan... ça a beaucoup simplifié les processus comptables... on n'a plus qu'une facture en fin de mois."
    },
    {
      "start": 249.0,
      "end": 313.0,
      "text": "Depuis l'implémentation de Navan, on a gagné beaucoup de temps dans la gestion de tous ces frais... j'ai pu me concentrer sur d'autres tâches à plus forte valeur ajoutée."
    }
  ]
}