{
  "full_text": "I worked in the airline industry before this for about 10 years and I have a passion for travel. And when the opportunity arose for me to come to Navan to work in corporate travel, I just I had to take it. The most rewarding part of my job is being able to see the final solution and work on a resolution and communicating with the customer and the client everything that I'm doing so they know that they're in good hands. So my onboarding, it was pretty extensive, but they prepared me for what I need to do next steps. Gave me the tools I needed. Made sure that we were actually trained in multiple platforms because here we do use more than just one traditional platform. So that has all contributed to my success so far. My motto is that there's not always one way to do something and that there are different avenues that we can take in order to find a resolution. And a lot of times people just think it's point A to point B and that there's not a point A, B, C, D to get you to where you need to go to finalize. So being able to use my quirkiness to put a puzzle together in order to help them during high times, intense situations, important business meetings, conferences, events or things like that. That's what my expertise brings to the table is because I have a vast knowledge of being able to problem solve and find a resolution whether it's for personal or for business. Complex travel issues are every day. Mainly because we service worldwide. And weather can happen anywhere at any time with or without notice. The job is intense and it's not intense hard, it's intense really understanding what to do and how to do it so that you won't make mistakes. Because there's so many different things across the board, you have to know each field. The value that I add in that I'm giving them a personality, somebody that I'm goofy regardless if I'm talking to you. I'm always asking you how you're doing, how's your day, how's your experience, are you okay? They like that. Regardless of the app, they don't have that type of satisfaction, but when they speak to me they know that, you know, I'm here to provide to them a good customer service. Yeah, I can bring value to what customer already has researched, they have done their homework, but at the same time we as an experienced travel agents and we know our job so we can easily communicate with customers and of course we can understand what they're talking about and what they want and we are there to service what their needs are. And that's our job to stay calm, focused and bring instant resolution.",
  "segments": [
    {
      "start": 0.0,
      "end": 4.1,
      "text": "I worked in the airline industry before this for about 10 years"
    },
    {
      "start": 4.1,
      "end": 6.8,
      "text": "and I have a passion for travel."
    },
    {
      "start": 6.8,
      "end": 11.5,
      "text": "And when the opportunity arose for me to come to Navan to work in corporate travel,"
    },
    {
      "start": 11.5,
      "end": 19.3,
      "text": "I just I had to take it. The most rewarding part of my job is being able to see the final solution"
    },
    {
      "start": 19.3,
      "end": 26.5,
      "text": "and work on a resolution and communicating with the customer and the client everything that I'm doing so they know that they're in good hands."
    },
    {
      "start": 26.5,
      "end": 35.6,
      "text": "So my onboarding, it was pretty extensive, but they prepared me for what I need to do next steps."
    },
    {
      "start": 35.6,
      "end": 43.5,
      "text": "Gave me the tools I needed. Made sure that we were actually trained in multiple platforms because here we do use more than just one traditional platform."
    },
    {
      "start": 43.5,
      "end": 51.7,
      "text": "So that has all contributed to my success so far. My motto is that there's not always one way to do something"
    },
    {
      "start": 51.7,
      "end": 59.9,
      "text": "and that there are different avenues that we can take in order to find a resolution."
    },
    {
      "start": 59.9,
      "end": 68.3,
      "text": "And a lot of times people just think it's point A to point B and that there's not a point A, B, C, D to get you to where you need to go to finalize."
    },
    {
      "start": 68.3,
      "end": 76.5,
      "text": "So being able to use my quirkiness to put a puzzle together in order to help them during high times,"
    },
    {
      "start": 76.5,
      "end": 84.7,
      "text": "intense situations, important business meetings, conferences, events or things like that."
    },
    {
      "start": 84.7,
      "end": 93.3,
      "text": "That's what my expertise brings to the table is because I have a vast knowledge of being able to problem solve and find a resolution whether it's for personal or for business."
    },
    {
      "start": 93.3,
      "end": 100.8,
      "text": "Complex travel issues are every day. Mainly because we service worldwide."
    },
    {
      "start": 100.8,
      "end": 107.5,
      "text": "And weather can happen anywhere at any time with or without notice."
    },
    {
      "start": 107.5,
      "end": 113.8,
      "text": "The job is intense and it's not intense hard, it's intense really understanding what to do"
    },
    {
      "start": 113.8,
      "end": 121.2,
      "text": "and how to do it so that you won't make mistakes. Because there's so many different things across the board, you have to know each field."
    },
    {
      "start": 121.2,
      "end": 128.5,
      "text": "The value that I add in that I'm giving them a personality, somebody that I'm goofy regardless if I'm talking to you."
    },
    {
      "start": 128.5,
      "end": 136.2,
      "text": "I'm always asking you how you're doing, how's your day, how's your experience, are you okay?"
    },
    {
      "start": 136.2,
      "end": 142.3,
      "text": "They like that. Regardless of the app, they don't have that type of satisfaction,"
    },
    {
      "start": 142.3,
      "end": 147.2,
      "text": "but when they speak to me they know that, you know, I'm here to provide to them a good customer service."
    },
    {
      "start": 147.2,
      "end": 154.5,
      "text": "Yeah, I can bring value to what customer already has researched, they have done their homework,"
    },
    {
      "start": 154.5,
      "end": 162.1,
      "text": "but at the same time we as an experienced travel agents and we know our job so we can easily communicate with customers"
    },
    {
      "start": 162.1,
      "end": 167.5,
      "text": "and of course we can understand what they're talking about and what they want and we are there to service what their needs are."
    },
    {
      "start": 167.5,
      "end": 172.5,
      "text": "And that's our job to stay calm, focused and bring instant resolution."
    }
  ]
}