{
  "full_text": "Let's get started. So welcome everybody to our webinar today discussing savings from managed high-adoption travel programs. Today we're going to discuss research conducted by Euromonitor in our partnership with Navan that did a deep dive into the global business travel sector. This is going to include an estimation of the total addressable market for global business travel, B2B survey results on businesses travel outlooks for the next five years, and a comparison between the profiles of managed versus unmanaged companies. Following a recap of the research, we'll be having a discussion around the implications of the research in managed high-adoption travel programs for businesses. From the Euromonitor team, we have Christopher Quintos and myself, Sarah Sanders. Chris is a senior consulting manager on Euromonitor's North America consulting team. For this research specifically, Chris helped lead the estimations for the total addressable market for the global business travel market. And I'm a senior consultant on Euromonitor's North America consulting team. I specialize in consumer insights and I specifically worked on the B2B survey piece of this research partnership that we'll go into depth and cover shortly. Finally, from the Navan team, we have Amy Butte. Amy is CFO of business travel and expense management firm Navan, an experienced finance leader. Amy is an advisor to high-growth companies and corporates and previously was CFO at New York Stock Exchange. Looking forward to speaking with you, Amy, about what these research findings mean for businesses. I love some good data, Sarah, so thank you. Looking forward to it. Okay, so without further ado, we'll jump into the research. Euromonitor's research partnership with Navan included sizing the addressable market, forecasting growth, and understanding those key drivers of market development. The methodology combined with a top-down and bottom-up approach that leverages sources including Euromonitor's own proprietary Passport database, secondary sources, and a custom B2B survey that I mentioned conducted across nine markets, and finally interviews with 11 industry experts from across the world. Our goal with this approach was to arrive at a holistic view of the global market, taking key regional factors into account before arriving at one total global view. Today we'll talk about the outcomes of the study, including the total addressable market or TAM that was estimated for global business travel as well as the insights from the B2B survey on annual number of business trips, average spend per trip, anticipated changes in cost to businesses, and how those can differ across segments such as managed, so those who use a travel management system, and unmanaged, those who do not. The survey that I mentioned was a B2B survey that reached a total sample of 756 respondents across nine markets. This was fielded from March to April of this year and the countries in the survey were determined by selecting the largest geographic markets for business travel. For example, according to our research, we know that North America accounts for around 25% of the global total addressable market for business travel in 2024. So the US and Canada were important markets for us to target in our survey. So this is just an overview of that sample. So diving into our key takeaways from the research, we'll start with our global business travel spend estimates. Euromonitor estimates that in 2024, the global business travel spend is $2.1 trillion and that will increase by $800 billion to $2.9 trillion in 2029. We know that the global business travel market reached its peak in 2019 before the COVID-19 pandemic, which we know caused a global slowdown in business travel. However, a really key piece of our research indicated that global business travel is actually expected to surpass pre-pandemic spending levels this year. And when we begin to look at what is driving that total addressable market, from the surveyed businesses, 85% of them actually anticipate their business travel expenditure to increase over the next five years. That is 85% from our global survey, meaning that globally the vast majority of businesses are actually anticipating a spending increase over the next five years. And there are multiple drivers of this anticipated expenditure increase. The primary drivers are an anticipated increase in travel fare costs, such as plane and rail tickets, with 63% of respondents citing that as a driver for anticipated cost increases, as well as increase in accommodation costs. Then general business growth and company expansion. Nearly half of respondents anticipated an increase in travel frequency. This shows us that companies are anticipating spending more on travel over the next five years from both price increases from airlines and hotels, while also anticipating positive business growth that will be increasing headcount, numbers of trips, numbers of clients, and the number of employees traveling and also their travel frequency. So although travel is becoming more expensive, businesses are not actually anticipating that to translate into an overall reduction in travel. I'll pass it over to Chris to dive more into our data. Thank you, Sarah. Yeah, so part of our approach in forecasting the total addressable market for global business travel was estimating the current and forecast average business trip costs, both at a market level and as a global average. Our research confirmed our survey respondents' expectation that average business trip costs are likely to rise over the next few years, driven both by growth in prices as well as longer trips and farther destinations. For example, Canada had the highest average trip cost in 2024 based on our research, which was estimated at about $2,400 per trip. However, trip costs for Canadian businesses are forecast to increase slowly at about 0.8% per year to about $2,500 US dollars by 2029. Comparatively, trip costs for US businesses are expected to grow by about 1.2% per year to over $1,800 US dollars per trip by 2029. Trip costs are expected to grow the most for companies that have a higher share of international trips, such as those based in Europe or countries like Singapore. As we can see from this chart, the average trip cost in Singapore is expected to grow from around $1,400 per trip in 2024 to nearly $1,800 per trip in 2029, averaging out to an annual growth rate of about 4.8% per year. While the rising cost per trip is a major driver of global business travel spend, it's the expected growth in the number of business trips that is contributing most to the 2029 forecast total addressable market for business travel. When looking at the number of round-trip business trips globally, according to Euromonitor's Passport database, we anticipate that the total number of business trips to increase from 3.7 billion in 2024 to 5.6 billion in 2029. That's a growth rate of about 8.8% per year. Just a quick note, the historical estimate for business trips from Euromonitor's Passport database is primarily sourced from the UN World Tourism Organization and forecasts are modeled by Euromonitor's data engineering and travel research teams. So looking at the composition of domestic versus international trips, we estimate that domestic trips will drive growth and account for nearly 90% of all business trips by 2029. Finally, while trips that include air travel are expected to account for less than 15% of total business trips by 2029, the growth in the number of flights is still expected to outpace the anticipated rise in costs of airfare over that time period. All this of course is assuming a baseline scenario of normality over the next four to five years. Those that doubt growth in business travel will point to the pandemic and resulting remote or hybrid work, or to current geopolitical factors like trade barriers or regional conflicts as reasons why business travel should actually or likely fall. Yet, as the chart on the right shows, survey respondents from our research indicated that client visits and travel to other offices are the top reasons for business travel, reinforcing how face time with both customers and other employees remain essential for business growth and operational effectiveness. So now we turn to the differences in business travel between companies with a travel management system, which we refer to as managed, and those without, which we refer to as unmanaged. When we refer to companies as unmanaged, it doesn't mean that these companies aren't traveling. Rather, it means that they are not currently using a travel management system. Therefore, their travel is unmanaged as opposed to a company who uses a travel management system, like Navan or other systems, to manage their travel. Our research estimates that in 2024, about 65% of total global business travel spend was made by unmanaged companies. That share is expected to grow slightly to about 67% of global business travel spend by 2029. Even among managed companies, leakage, or business travel booked outside of their travel management systems, is estimated to account for about 10% of total global business travel spend. Or put another way, about 30% of managed companies' business travel that should be booked through their travel management system are instead purchased outside of it, often by employees who later submit for reimbursement. Adoption accounts for the remainder of that managed business travel spend and it's defined as travel properly booked through a company's travel management system. So diving deeper into leakage, which is travel booked outside of the travel management system, we estimate that the global travel spend attributed to leakage in 2024 was about $112 billion US dollars. If the share of managed travel that is booked outside of travel management systems remains the same as in 2024, then leakage is anticipated to grow over the next five years to about $147 billion dollars. That's estimated at about an annual growth rate of about 5.6%. So if unmanaged companies account for such a high share of global business travel spend, the logical next question is who are they? Based on our B2B survey, over half of unmanaged companies have 200 employees or fewer, compared to managed companies which predictably are overrepresented by larger companies. Similarly, a smaller share of business trips booked by unmanaged companies are international trips compared to those by managed companies: 26% for unmanaged, 33% for managed. This is also intuitive given that most multinational companies have already adopted a travel management system. However, the percentage share of employees who travel for business at unmanaged companies is not significantly lower than that of managed companies, estimated at 43% versus 51% based on the survey. Why is this statistic important? Yes, there are typically fewer employees at an average unmanaged company, but it is not a select few at these companies who are traveling. So at these unmanaged companies, somebody is likely responsible for managing expense reporting and reimbursements across multiple employees, as well as enforcing travel policies in order to keep costs low. Finally, client visits or trade shows overindex for unmanaged companies as reasons for business travel, highlighting the in-person emphasis on meeting customers and or generating leads or suppliers for these unmanaged companies. Comparatively, reasons for business trips are a lot more diverse for managed companies and include visits to other offices, sales or marketing events, and training and development. Finally, when taking a look at business travel costs of managed versus unmanaged companies, our research found that on average, lodging accounts for 11 percentage points more of an unmanaged business's travel expenditure compared to managed companies' annual spend on lodging. And airfare accounted for four percentage points more for unmanaged companies versus managed companies. These data points highlight how much more exposed unmanaged companies' business travel budgets are to lodging and airfare prices compared to those of managed companies. This also relates to leakage, given that 10% of global business travel spend in 2024 was booked outside of a travel management system. That leakage spend would also be exposed to the higher prices seen by unmanaged companies, even though these companies experiencing leakage are already working with a travel management system. And now I'll turn it over to Sarah and Amy for some questions. Thanks, Chris. So what do these findings mean for businesses? So now I'd like to welcome Amy Butte, Navan CFO. Welcome, Amy. Thank you, Sarah. It was so great to work with you and Chris and the Euromonitor team. And you know this data—you know I love data—but there were some really surprising results. And it was great to see, if you will, things we thought we were seeing in the business prove true through the data that you were able to uncover through your research. Definitely. And thinking back on working on this research, one of the most surprising findings for me was that despite the rise of remote and hybrid working and even with these higher travel costs, companies are actually forecasted to travel more in the future. Why do you think that is? Well, on a personal level, we just came back from an executive team offsite and I can say that we were able to get so much done. We're a global company, to be able to connect with my colleagues and have so many conversations in a short period of time in a personal way that you can see that smile, that laugh, that frown, whatever it might be, it really made a difference. I also know as a board member of companies that are partially virtual how important it is for them as well to bring people together in pods. So on a personal level I see it. From a business standpoint for Navan relative to our customers, you know the Euromonitor forecast really validates that travel is a powerful catalyst for growth for businesses on a global basis. You know in an increasingly digital world, the value of in-person connections has actually gone up and we see that in the data. Meetings build that trust with a client or a colleague and allow teams to solve complex problems. You know, and what's really fascinating is we also launched our Navan's business travel index recently which showed that business trip bookings, air and lodging, increased 15% year over year. Another signal that companies are choosing to deploy resources for these in-person connections. You know, I would say it's interesting the Euromonitor data almost called the news ahead of time. We're now seeing airlines talking about how they are raising prices. But even though we're seeing that play out in the news like you anticipated we would, we're also seeing that validation that—and I see it as a CFO—business travel isn't just an expense, it's really an investment and it's an important part of the overall budget. Definitely. And as we're seeing costs increase for travel, another surprising stat for us was that how such a large share, nearly two-thirds of business travel, remains unmanaged. So that's a significant proportion of the global spending, especially when our research is showing clear savings for managed companies and clear differences in cost structure between those that are using a travel management company and those that are not. So what do you think is behind so few businesses working with a travel management company for corporate travel? Okay, but by the way, that data is crazy, right? The data is saying that companies that choose not to work with a provider pay 11% more in lodging and 4% more in air. And so the question is are they choosing not to do that or do they feel like a managed platform is not accessible to them? And I think that's really the difference between what I would call traditional travel versus modern travel. Right. Traditional travel management companies are clearly failing a large percentage of our economy. Those businesses that are traditionally smaller, but even businesses that don't think it's accessible because of the cost or the perception or it's not good to use because employees don't like it. I was actually in a meeting yesterday with a group of people and the person across from me even admitted, like, I never book using my company's system, I always do it on... Leakage. Right, right. Massive, massive leakage. So the question is why do we think we can do it or why do we think there's a better way? You know, at Navan, making travel easier for every frequent traveler is our mission. We don't differentiate whether you come from a company that's managed or unmanaged, we differentiate on the fact that you travel for business. And that's an important thing to do. It's important to our economy, it's important to your business, and it's important to your customers and it's important to your employees and your colleagues. And that's important. So why can we do it differently? It's really a function of technology. Right. We are able to leverage basically APIs for content, AI and machine learning to make sure that people can see that content in a way that your favorite airline, your favorite hotel, your favorite time of flight, all pops up. And then we can also do it in a consumer-grade interface. And so those combinations in a way that's economically efficient for us and also economically efficient for the user or the customer means it's really a win-win-win. And I just don't think traditional players who are still using the phone or just using email are really serving the frequent traveler. And we're seeing that in your data. It's a large percentage. Yeah, absolutely. And we see that in our data that, as you mentioned, the shocking stats of 11% more on lodging, 4% more on flights, that they're spending more unmanaged companies are than managed. So why do you think those that are not using are spending more? Like what are the driving factors behind those? Because assuming maybe an employee goes off their platform to book and they think that maybe there'll be more options, so those that are not using, why are they still spending more in the end? Well, you know the old adage, if you can't measure it, you can't manage it. And I think a lot of unmanaged companies have no mechanism to enforce policy or optimize spending. Right? They can only see an out-of-policy expense after the fact when it's too late. Where a managed platform, particularly one that's real-time like Navan, can prevent that overspending from ever happening. You literally get a pop-up that says this is out of policy if you try to do it on our platform. And our dynamic policy feature also allows for automated and flexible travel rules. Like for example, have you ever tried to get a hotel room in San Francisco during Dreamforce? It's impossible, right? So you need a dynamic policy that works with how people travel. We also think that deep supplier relationships allow modern TMCs to offer optimal and dynamic prices across a wide content base. Many companies, even in a managed world, really only get one choice, whether it's for that hotel or a certain number. You know, at Navan, we're really invested in a multi-source strategy, which gives us access to critical channels to source the fares at highly competitive prices for customers. So for example, when you try to book a hotel room, we can give you three choices. And depending on whether you want it to be refundable, whether you want your points or you don't want your points, whether you want some of our travel rewards that we offer, you can—we can let the user make that decision while still benefiting the customer to save money. Now let's also not forget, which wasn't in the data, how much time most employees have to spend or EAs have to spend to book a trip. I think there's some general data out there that says an average time to book a trip is about 45 minutes. You know, we can do it in about 7 to 8 minutes on average. And so we're constantly able to save customers money in their travel budget, and we're also able to save users time, which in many ways is the equivalent of money, especially if you're in a sales function. Absolutely. And when we did conduct our research, in order to be comprehensive, we looked at companies of varying sizes, so from small and medium companies all the way to large multinationals. And then apart from size, we looked at companies across all these industries. And so we know that there are varying levels of travel, whether it's only domestic, international, client visits, off-sites like you mentioned, conferences, trainings, and more. So with this level of varying needs, like how can all companies benefit from the addition of a TMC? Right, like the worst thing that you can do as a CFO or a finance professional is one, see data too late to act on, right? And unmanaged when it's on paper or if it's coming from multiple systems, you can't see it that day or that week or that month, and so it makes it really hard to act on. You know, two, it's really important—most people don't know this, I didn't know this until I came from Navan—there's actually a duty of care that companies have when their companies travel, when their employees travel. Companies are supposed to know where they are at all times, so if a plane goes down, you know about it. And how do you do that if somebody has leaked and booked their own travel and you don't know? And third, you know, this is my finance hat, you need to audit this, right? And so that reconciliation is really important. And do you want your team spending hours at the end of the month doing manual reconciliation or can you automate that? You know, we live in a very competitive world, and so I think anything a finance leader can do to bring in modern technology to automate, increase efficiency, as well as just make sure you do a better job for your employees and you leverage the company to a higher return on investment, those are all really important things. Absolutely. Appreciated it, Amy, and appreciate everyone for coming. And if you've sent questions through related to the research, the data, our discussion, we'll take a look at them and get back to you after the webinar. But appreciate everyone's time and the discussion, Amy. Thank you. No, thanks, and thanks to the Euromonitor team. What a great partnership.",
  "segments": [
    {
      "start": 0.0,
      "end": 1.45,
      "text": "Let's get started. So welcome everybody to our webinar today discussing savings from managed high-adoption travel programs."
    },
    {
      "start": 1.45,
      "end": 2.58,
      "text": "Today we're going to discuss research conducted by Euromonitor in our partnership with Navan that did a deep dive into the global business travel sector."
    },
    {
      "start": 2.58,
      "end": 3.35,
      "text": "This is going to include an estimation of the total addressable market for global business travel, B2B survey results on businesses travel outlooks for the next five years, and a comparison between the profiles of managed versus unmanaged companies."
    },
    {
      "start": 3.35,
      "end": 4.19,
      "text": "Following a recap of the research, we'll be having a discussion around the implications of the research in managed high-adoption travel programs for businesses."
    },
    {
      "start": 4.19,
      "end": 4.46,
      "text": "From the Euromonitor team, we have Christopher Quintos and myself, Sarah Sanders."
    },
    {
      "start": 4.46,
      "end": 5.44,
      "text": "Chris is a senior consulting manager on Euromonitor's North America consulting team. For this research specifically, Chris helped lead the estimations for the total addressable market for the global business travel market."
    },
    {
      "start": 5.44,
      "end": 7.15,
      "text": "And I'm a senior consultant on Euromonitor's North America consulting team. I specialize in consumer insights and I specifically worked on the B2B survey piece of this research partnership that we'll go into depth and cover shortly."
    },
    {
      "start": 7.15,
      "end": 9.1,
      "text": "Finally, from the Navan team, we have Amy Butte. Amy is CFO of business travel and expense management firm Navan, an experienced finance leader."
    },
    {
      "start": 9.1,
      "end": 11.2,
      "text": "Amy is an advisor to high-growth companies and corporates and previously was CFO at New York Stock Exchange. Looking forward to speaking with you, Amy, about what these research findings mean for businesses."
    },
    {
      "start": 11.2,
      "end": 12.42,
      "text": "I love some good data, Sarah, so thank you. Looking forward to it."
    },
    {
      "start": 12.42,
      "end": 13.45,
      "text": "Okay, so without further ado, we'll jump into the research."
    },
    {
      "start": 13.45,
      "end": 14.47,
      "text": "Euromonitor's research partnership with Navan included sizing the addressable market, forecasting growth, and understanding those key drivers of market development."
    },
    {
      "start": 14.47,
      "end": 17.19,
      "text": "The methodology combined with a top-down and bottom-up approach that leverages sources including Euromonitor's own proprietary Passport database, secondary sources, and a custom B2B survey that I mentioned conducted across nine markets, and finally interviews with 11 industry experts from across the world."
    },
    {
      "start": 17.19,
      "end": 19.5,
      "text": "Our goal with this approach was to arrive at a holistic view of the global market, taking key regional factors into account before arriving at one total global view."
    },
    {
      "start": 19.5,
      "end": 21.11,
      "text": "Today we'll talk about the outcomes of the study, including the total addressable market or TAM that was estimated for global business travel as well as the insights from the B2B survey on annual number of business trips, average spend per trip, anticipated changes in cost to businesses, and how those can differ across segments such as managed, so those who use a travel management system, and unmanaged, those who do not."
    },
    {
      "start": 21.11,
      "end": 22.58,
      "text": "The survey that I mentioned was a B2B survey that reached a total sample of 756 respondents across nine markets."
    },
    {
      "start": 22.58,
      "end": 25.13,
      "text": "This was fielded from March to April of this year and the countries in the survey were determined by selecting the largest geographic markets for business travel."
    },
    {
      "start": 25.13,
      "end": 27.58,
      "text": "For example, according to our research, we know that North America accounts for around 25% of the global total addressable market for business travel in 2024. So the US and Canada were important markets for us to target in our survey."
    },
    {
      "start": 27.58,
      "end": 29.58,
      "text": "So this is just an overview of that sample."
    },
    {
      "start": 29.58,
      "end": 31.42,
      "text": "So diving into our key takeaways from the research, we'll start with our global business travel spend estimates."
    },
    {
      "start": 31.42,
      "end": 33.36,
      "text": "Euromonitor estimates that in 2024, the global business travel spend is $2.1 trillion and that will increase by $800 billion to $2.9 trillion in 2029."
    },
    {
      "start": 33.36,
      "end": 35.37,
      "text": "We know that the global business travel market reached its peak in 2019 before the COVID-19 pandemic, which we know caused a global slowdown in business travel."
    },
    {
      "start": 35.37,
      "end": 37.19,
      "text": "However, a really key piece of our research indicated that global business travel is actually expected to surpass pre-pandemic spending levels this year."
    },
    {
      "start": 37.19,
      "end": 38.35,
      "text": "And when we begin to look at what is driving that total addressable market, from the surveyed businesses, 85% of them actually anticipate their business travel expenditure to increase over the next five years."
    },
    {
      "start": 38.35,
      "end": 41.13,
      "text": "That is 85% from our global survey, meaning that globally the vast majority of businesses are actually anticipating a spending increase over the next five years."
    },
    {
      "start": 41.13,
      "end": 43.14,
      "text": "And there are multiple drivers of this anticipated expenditure increase."
    },
    {
      "start": 43.14,
      "end": 44.47,
      "text": "The primary drivers are an anticipated increase in travel fare costs, such as plane and rail tickets, with 63% of respondents citing that as a driver for anticipated cost increases, as well as increase in accommodation costs."
    },
    {
      "start": 44.47,
      "end": 47.15,
      "text": "Then general business growth and company expansion. Nearly half of respondents anticipated an increase in travel frequency."
    },
    {
      "start": 47.15,
      "end": 49.33,
      "text": "This shows us that companies are anticipating spending more on travel over the next five years from both price increases from airlines and hotels, while also anticipating positive business growth that will be increasing headcount, numbers of trips, numbers of clients, and the number of employees traveling and also their travel frequency."
    },
    {
      "start": 49.33,
      "end": 51.15,
      "text": "So although travel is becoming more expensive, businesses are not actually anticipating that to translate into an overall reduction in travel."
    },
    {
      "start": 51.15,
      "end": 52.44,
      "text": "I'll pass it over to Chris to dive more into our data. Thank you, Sarah."
    },
    {
      "start": 52.44,
      "end": 55.44,
      "text": "Yeah, so part of our approach in forecasting the total addressable market for global business travel was estimating the current and forecast average business trip costs, both at a market level and as a global average."
    },
    {
      "start": 55.44,
      "end": 57.19,
      "text": "Our research confirmed our survey respondents' expectation that average business trip costs are likely to rise over the next few years, driven both by growth in prices as well as longer trips and farther destinations."
    },
    {
      "start": 57.19,
      "end": 60.1,
      "text": "For example, Canada had the highest average trip cost in 2024 based on our research, which was estimated at about $2,400 per trip."
    },
    {
      "start": 60.1,
      "end": 62.42,
      "text": "However, trip costs for Canadian businesses are forecast to increase slowly at about 0.8% per year to about $2,500 US dollars by 2029."
    },
    {
      "start": 62.42,
      "end": 64.38,
      "text": "Comparatively, trip costs for US businesses are expected to grow by about 1.2% per year to over $1,800 US dollars per trip by 2029."
    },
    {
      "start": 64.38,
      "end": 67.15,
      "text": "Trip costs are expected to grow the most for companies that have a higher share of international trips, such as those based in Europe or countries like Singapore."
    },
    {
      "start": 67.15,
      "end": 69.11,
      "text": "As we can see from this chart, the average trip cost in Singapore is expected to grow from around $1,400 per trip in 2024 to nearly $1,800 per trip in 2029, averaging out to an annual growth rate of about 4.8% per year."
    },
    {
      "start": 69.11,
      "end": 71.13,
      "text": "While the rising cost per trip is a major driver of global business travel spend, it's the expected growth in the number of business trips that is contributing most to the 2029 forecast total addressable market for business travel."
    },
    {
      "start": 71.13,
      "end": 73.3,
      "text": "When looking at the number of round-trip business trips globally, according to Euromonitor's Passport database, we anticipate that the total number of business trips to increase from 3.7 billion in 2024 to 5.6 billion in 2029. That's a growth rate of about 8.8% per year."
    },
    {
      "start": 73.3,
      "end": 75.33,
      "text": "Just a quick note, the historical estimate for business trips from Euromonitor's Passport database is primarily sourced from the UN World Tourism Organization and forecasts are modeled by Euromonitor's data engineering and travel research teams."
    },
    {
      "start": 75.33,
      "end": 77.15,
      "text": "So looking at the composition of domestic versus international trips, we estimate that domestic trips will drive growth and account for nearly 90% of all business trips by 2029."
    },
    {
      "start": 77.15,
      "end": 79.1,
      "text": "Finally, while trips that include air travel are expected to account for less than 15% of total business trips by 2029, the growth in the number of flights is still expected to outpace the anticipated rise in costs of airfare over that time period."
    },
    {
      "start": 79.1,
      "end": 81.1,
      "text": "All this of course is assuming a baseline scenario of normality over the next four to five years."
    },
    {
      "start": 81.1,
      "end": 83.15,
      "text": "Those that doubt growth in business travel will point to the pandemic and resulting remote or hybrid work, or to current geopolitical factors like trade barriers or regional conflicts as reasons why business travel should actually or likely fall."
    },
    {
      "start": 83.15,
      "end": 85.33,
      "text": "Yet, as the chart on the right shows, survey respondents from our research indicated that client visits and travel to other offices are the top reasons for business travel, reinforcing how face time with both customers and other employees remain essential for business growth and operational effectiveness."
    },
    {
      "start": 85.33,
      "end": 87.1,
      "text": "So now we turn to the differences in business travel between companies with a travel management system, which we refer to as managed, and those without, which we refer to as unmanaged."
    },
    {
      "start": 87.1,
      "end": 89.1,
      "text": "When we refer to companies as unmanaged, it doesn't mean that these companies aren't traveling. Rather, it means that they are not currently using a travel management system."
    },
    {
      "start": 89.1,
      "end": 91.1,
      "text": "Therefore, their travel is unmanaged as opposed to a company who uses a travel management system, like Navan or other systems, to manage their travel."
    },
    {
      "start": 91.1,
      "end": 93.1,
      "text": "Our research estimates that in 2024, about 65% of total global business travel spend was made by unmanaged companies."
    },
    {
      "start": 93.1,
      "end": 95.1,
      "text": "That share is expected to grow slightly to about 67% of global business travel spend by 2029."
    },
    {
      "start": 95.1,
      "end": 97.1,
      "text": "Even among managed companies, leakage, or business travel booked outside of their travel management systems, is estimated to account for about 10% of total global business travel spend."
    },
    {
      "start": 97.1,
      "end": 99.1,
      "text": "Or put another way, about 30% of managed companies' business travel that should be booked through their travel management system are instead purchased outside of it, often by employees who later submit for reimbursement."
    },
    {
      "start": 99.1,
      "end": 101.1,
      "text": "Adoption accounts for the remainder of that managed business travel spend and it's defined as travel properly booked through a company's travel management system."
    },
    {
      "start": 101.1,
      "end": 103.1,
      "text": "So diving deeper into leakage, which is travel booked outside of the travel management system, we estimate that the global travel spend attributed to leakage in 2024 was about $112 billion US dollars."
    },
    {
      "start": 103.1,
      "end": 105.1,
      "text": "If the share of managed travel that is booked outside of travel management systems remains the same as in 2024, then leakage is anticipated to grow over the next five years to about $147 billion dollars. That's estimated at about an annual growth rate of about 5.6%."
    },
    {
      "start": 105.1,
      "end": 107.1,
      "text": "So if unmanaged companies account for such a high share of global business travel spend, the logical next question is who are they?"
    },
    {
      "start": 107.1,
      "end": 109.1,
      "text": "Based on our B2B survey, over half of unmanaged companies have 200 employees or fewer, compared to managed companies which predictably are overrepresented by larger companies."
    },
    {
      "start": 109.1,
      "end": 111.1,
      "text": "Similarly, a smaller share of business trips booked by unmanaged companies are international trips compared to those by managed companies: 26% for unmanaged, 33% for managed."
    },
    {
      "start": 111.1,
      "end": 113.1,
      "text": "This is also intuitive given that most multinational companies have already adopted a travel management system."
    },
    {
      "start": 113.1,
      "end": 115.1,
      "text": "However, the percentage share of employees who travel for business at unmanaged companies is not significantly lower than that of managed companies, estimated at 43% versus 51% based on the survey."
    },
    {
      "start": 115.1,
      "end": 117.1,
      "text": "Why is this statistic important? Yes, there are typically fewer employees at an average unmanaged company, but it is not a select few at these companies who are traveling."
    },
    {
      "start": 117.1,
      "end": 119.1,
      "text": "So at these unmanaged companies, somebody is likely responsible for managing expense reporting and reimbursements across multiple employees, as well as enforcing travel policies in order to keep costs low."
    },
    {
      "start": 119.1,
      "end": 121.1,
      "text": "Finally, client visits or trade shows overindex for unmanaged companies as reasons for business travel, highlighting the in-person emphasis on meeting customers and or generating leads or suppliers for these unmanaged companies."
    },
    {
      "start": 121.1,
      "end": 123.1,
      "text": "Comparatively, reasons for business trips are a lot more diverse for managed companies and include visits to other offices, sales or marketing events, and training and development."
    },
    {
      "start": 123.1,
      "end": 125.1,
      "text": "Finally, when taking a look at business travel costs of managed versus unmanaged companies, our research found that on average, lodging accounts for 11 percentage points more of an unmanaged business's travel expenditure compared to managed companies' annual spend on lodging."
    },
    {
      "start": 125.1,
      "end": 127.1,
      "text": "And airfare accounted for four percentage points more for unmanaged companies versus managed companies."
    },
    {
      "start": 127.1,
      "end": 129.1,
      "text": "These data points highlight how much more exposed unmanaged companies' business travel budgets are to lodging and airfare prices compared to those of managed companies."
    },
    {
      "start": 129.1,
      "end": 131.1,
      "text": "This also relates to leakage, given that 10% of global business travel spend in 2024 was booked outside of a travel management system."
    },
    {
      "start": 131.1,
      "end": 133.1,
      "text": "That leakage spend would also be exposed to the higher prices seen by unmanaged companies, even though these companies experiencing leakage are already working with a travel management system."
    },
    {
      "start": 133.1,
      "end": 134.45,
      "text": "And now I'll turn it over to Sarah and Amy for some questions."
    },
    {
      "start": 134.45,
      "end": 135.52,
      "text": "Thanks, Chris. So what do these findings mean for businesses? So now I'd like to welcome Amy Butte, Navan CFO. Welcome, Amy."
    },
    {
      "start": 135.52,
      "end": 137.19,
      "text": "Thank you, Sarah. It was so great to work with you and Chris and the Euromonitor team."
    },
    {
      "start": 137.19,
      "end": 138.54,
      "text": "And you know this data—you know I love data—but there were some really surprising results."
    },
    {
      "start": 138.54,
      "end": 140.42,
      "text": "And it was great to see, if you will, things we thought we were seeing in the business prove true through the data that you were able to uncover through your research."
    },
    {
      "start": 140.42,
      "end": 142.22,
      "text": "Definitely. And thinking back on working on this research, one of the most surprising findings for me was that despite the rise of remote and hybrid working and even with these higher travel costs, companies are actually forecasted to travel more in the future. Why do you think that is?"
    },
    {
      "start": 142.22,
      "end": 144.13,
      "text": "Well, on a personal level, we just came back from an executive team offsite and I can say that we were able to get so much done."
    },
    {
      "start": 144.13,
      "end": 145.43,
      "text": "We're a global company, to be able to connect with my colleagues and have so many conversations in a short period of time in a personal way that you can see that smile, that laugh, that frown, whatever it might be, it really made a difference."
    },
    {
      "start": 145.43,
      "end": 147.11,
      "text": "I also know as a board member of companies that are partially virtual how important it is for them as well to bring people together in pods. So on a personal level I see it."
    },
    {
      "start": 147.11,
      "end": 148.51,
      "text": "From a business standpoint for Navan relative to our customers, you know the Euromonitor forecast really validates that travel is a powerful catalyst for growth for businesses on a global basis."
    },
    {
      "start": 148.51,
      "end": 150.15,
      "text": "You know in an increasingly digital world, the value of in-person connections has actually gone up and we see that in the data."
    },
    {
      "start": 150.15,
      "end": 151.52,
      "text": "Meetings build that trust with a client or a colleague and allow teams to solve complex problems."
    },
    {
      "start": 151.52,
      "end": 153.22,
      "text": "You know, and what's really fascinating is we also launched our Navan's business travel index recently which showed that business trip bookings, air and lodging, increased 15% year over year."
    },
    {
      "start": 153.22,
      "end": 154.51,
      "text": "Another signal that companies are choosing to deploy resources for these in-person connections."
    },
    {
      "start": 154.51,
      "end": 156.12,
      "text": "You know, I would say it's interesting the Euromonitor data almost called the news ahead of time. We're now seeing airlines talking about how they are raising prices."
    },
    {
      "start": 156.12,
      "end": 157.19,
      "text": "But even though we're seeing that play out in the news like you anticipated we would, we're also seeing that validation that—and I see it as a CFO—business travel isn't just an expense, it's really an investment and it's an important part of the overall budget."
    },
    {
      "start": 157.19,
      "end": 158.55,
      "text": "Definitely. And as we're seeing costs increase for travel, another surprising stat for us was that how such a large share, nearly two-thirds of business travel, remains unmanaged."
    },
    {
      "start": 158.55,
      "end": 160.19,
      "text": "So that's a significant proportion of the global spending, especially when our research is showing clear savings for managed companies and clear differences in cost structure between those that are using a travel management company and those that are not."
    },
    {
      "start": 160.19,
      "end": 161.42,
      "text": "So what do you think is behind so few businesses working with a travel management company for corporate travel?"
    },
    {
      "start": 161.42,
      "end": 162.33,
      "text": "Okay, but by the way, that data is crazy, right? The data is saying that companies that choose not to work with a provider pay 11% more in lodging and 4% more in air."
    },
    {
      "start": 162.33,
      "end": 164.21,
      "text": "And so the question is are they choosing not to do that or do they feel like a managed platform is not accessible to them?"
    },
    {
      "start": 164.21,
      "end": 165.34,
      "text": "And I think that's really the difference between what I would call traditional travel versus modern travel."
    },
    {
      "start": 165.34,
      "end": 167.11,
      "text": "Right. Traditional travel management companies are clearly failing a large percentage of our economy."
    },
    {
      "start": 167.11,
      "end": 168.19,
      "text": "Those businesses that are traditionally smaller, but even businesses that don't think it's accessible because of the cost or the perception or it's not good to use because employees don't like it."
    },
    {
      "start": 168.19,
      "end": 169.51,
      "text": "I was actually in a meeting yesterday with a group of people and the person across from me even admitted, like, I never book using my company's system, I always do it on... Leakage. Right, right. Massive, massive leakage."
    },
    {
      "start": 169.51,
      "end": 171.12,
      "text": "So the question is why do we think we can do it or why do we think there's a better way?"
    },
    {
      "start": 171.12,
      "end": 172.19,
      "text": "You know, at Navan, making travel easier for every frequent traveler is our mission."
    },
    {
      "start": 172.19,
      "end": 173.34,
      "text": "We don't differentiate whether you come from a company that's managed or unmanaged, we differentiate on the fact that you travel for business."
    },
    {
      "start": 173.34,
      "end": 174.45,
      "text": "And that's an important thing to do. It's important to our economy, it's important to your business, and it's important to your customers and it's important to your employees and your colleagues. And that's important."
    },
    {
      "start": 174.45,
      "end": 175.48,
      "text": "So why can we do it differently? It's really a function of technology."
    },
    {
      "start": 175.48,
      "end": 177.11,
      "text": "Right. We are able to leverage basically APIs for content, AI and machine learning to make sure that people can see that content in a way that your favorite airline, your favorite hotel, your favorite time of flight, all pops up."
    },
    {
      "start": 177.11,
      "end": 178.43,
      "text": "And then we can also do it in a consumer-grade interface."
    },
    {
      "start": 178.43,
      "end": 180.1,
      "text": "And so those combinations in a way that's economically efficient for us and also economically efficient for the user or the customer means it's really a win-win-win."
    },
    {
      "start": 180.1,
      "end": 181.42,
      "text": "And I just don't think traditional players who are still using the phone or just using email are really serving the frequent traveler. And we're seeing that in your data. It's a large percentage."
    },
    {
      "start": 181.42,
      "end": 183.1,
      "text": "Yeah, absolutely. And we see that in our data that, as you mentioned, the shocking stats of 11% more on lodging, 4% more on flights, that they're spending more unmanaged companies are than managed."
    },
    {
      "start": 183.1,
      "end": 184.21,
      "text": "So why do you think those that are not using are spending more? Like what are the driving factors behind those? Because assuming maybe an employee goes off their platform to book and they think that maybe there'll be more options, so those that are not using, why are they still spending more in the end?"
    },
    {
      "start": 184.21,
      "end": 185.34,
      "text": "Well, you know the old adage, if you can't measure it, you can't manage it. And I think a lot of unmanaged companies have no mechanism to enforce policy or optimize spending. Right?"
    },
    {
      "start": 185.34,
      "end": 187.11,
      "text": "They can only see an out-of-policy expense after the fact when it's too late. Where a managed platform, particularly one that's real-time like Navan, can prevent that overspending from ever happening."
    },
    {
      "start": 187.11,
      "end": 188.1,
      "text": "You literally get a pop-up that says this is out of policy if you try to do it on our platform."
    },
    {
      "start": 188.1,
      "end": 189.51,
      "text": "And our dynamic policy feature also allows for automated and flexible travel rules."
    },
    {
      "start": 189.51,
      "end": 191.12,
      "text": "Like for example, have you ever tried to get a hotel room in San Francisco during Dreamforce? It's impossible, right? So you need a dynamic policy that works with how people travel."
    },
    {
      "start": 191.12,
      "end": 192.42,
      "text": "We also think that deep supplier relationships allow modern TMCs to offer optimal and dynamic prices across a wide content base. Many companies, even in a managed world, really only get one choice, whether it's for that hotel or a certain number."
    },
    {
      "start": 192.42,
      "end": 194.1,
      "text": "You know, at Navan, we're really invested in a multi-source strategy, which gives us access to critical channels to source the fares at highly competitive prices for customers."
    },
    {
      "start": 194.1,
      "end": 195.34,
      "text": "So for example, when you try to book a hotel room, we can give you three choices. And depending on whether you want it to be refundable, whether you want your points or you don't want your points, whether you want some of our travel rewards that we offer, you can—we can let the user make that decision while still benefiting the customer to save money."
    },
    {
      "start": 195.34,
      "end": 197.11,
      "text": "Now let's also not forget, which wasn't in the data, how much time most employees have to spend or EAs have to spend to book a trip."
    },
    {
      "start": 197.11,
      "end": 198.1,
      "text": "I think there's some general data out there that says an average time to book a trip is about 45 minutes."
    },
    {
      "start": 198.1,
      "end": 199.1,
      "text": "You know, we can do it in about 7 to 8 minutes on average. And so we're constantly able to save customers money in their travel budget, and we're also able to save users time, which in many ways is the equivalent of money, especially if you're in a sales function."
    },
    {
      "start": 199.1,
      "end": 200.31,
      "text": "Absolutely. And when we did conduct our research, in order to be comprehensive, we looked at companies of varying sizes, so from small and medium companies all the way to large multinationals."
    },
    {
      "start": 200.31,
      "end": 201.42,
      "text": "And then apart from size, we looked at companies across all these industries."
    },
    {
      "start": 201.42,
      "end": 202.43,
      "text": "And so we know that there are varying levels of travel, whether it's only domestic, international, client visits, off-sites like you mentioned, conferences, trainings, and more. So with this level of varying needs, like how can all companies benefit from the addition of a TMC?"
    },
    {
      "start": 202.43,
      "end": 204.13,
      "text": "Right, like the worst thing that you can do as a CFO or a finance professional is one, see data too late to act on, right?"
    },
    {
      "start": 204.13,
      "end": 205.15,
      "text": "And unmanaged when it's on paper or if it's coming from multiple systems, you can't see it that day or that week or that month, and so it makes it really hard to act on."
    },
    {
      "start": 205.15,
      "end": 207.11,
      "text": "You know, two, it's really important—most people don't know this, I didn't know this until I came from Navan—there's actually a duty of care that companies have when their companies travel, when their employees travel."
    },
    {
      "start": 207.11,
      "end": 208.21,
      "text": "Companies are supposed to know where they are at all times, so if a plane goes down, you know about it. And how do you do that if somebody has leaked and booked their own travel and you don't know?"
    },
    {
      "start": 208.21,
      "end": 209.51,
      "text": "And third, you know, this is my finance hat, you need to audit this, right? And so that reconciliation is really important. And do you want your team spending hours at the end of the month doing manual reconciliation or can you automate that?"
    },
    {
      "start": 209.51,
      "end": 211.1,
      "text": "You know, we live in a very competitive world, and so I think anything a finance leader can do to bring in modern technology to automate, increase efficiency, as well as just make sure you do a better job for your employees and you leverage the company to a higher return on investment, those are all really important things."
    },
    {
      "start": 211.1,
      "end": 212.1,
      "text": "Absolutely. Appreciated it, Amy, and appreciate everyone for coming. And if you've sent questions through related to the research, the data, our discussion, we'll take a look at them and get back to you after the webinar. But appreciate everyone's time and the discussion, Amy. Thank you. No, thanks, and thanks to the Euromonitor team. What a great partnership."
    }
  ]
}