{
  "full_text": "I'm Meg Morrill and I basically just help with all things travel and expense. Pluralsight is headquartered in beautiful Draper, Utah. It is a tech workforce development company. Part of what we were looking for is to kind of consolidate, have a one-stop-shop solution that was available for everybody. We wanted all of our team members to have equal access. Having that disjointed solution and workarounds... it was very much a lot of workarounds. Especially around reporting, it was very difficult to get the data from the different sources to patch it together somehow and to present it in a way that made sense. Because our team members and our travelers are our number one priority, we were looking for a tool that also felt the same way. And it was clear that with Navan, that was the case. Like, the tool was built around the user; it wasn't about the tool itself. It felt like with Navan you were already putting the traveler first, and it was only going to get better and bigger as we went along.",
  "segments": [
    {
      "start": 0.0,
      "end": 3.0,
      "text": "Navan. What our customers are saying."
    },
    {
      "start": 3.0,
      "end": 7.0,
      "text": "I'm Meg Morrill and I basically just help with all things travel and expense."
    },
    {
      "start": 7.0,
      "end": 13.0,
      "text": "Pluralsight is headquartered in beautiful Draper, Utah. It is a tech workforce development company."
    },
    {
      "start": 13.0,
      "end": 20.0,
      "text": "Part of what we were looking for is to kind of consolidate, have a one-stop-shop solution that was available for everybody."
    },
    {
      "start": 20.0,
      "end": 23.0,
      "text": "We wanted all of our team members to have equal access."
    },
    {
      "start": 23.0,
      "end": 29.0,
      "text": "Having that disjointed solution and like workarounds, it was very much a lot of workarounds."
    },
    {
      "start": 29.0,
      "end": 40.0,
      "text": "Especially around reporting, it was very difficult to get the data from the different sources to patch it together somehow and to present it in a way that made sense."
    },
    {
      "start": 40.0,
      "end": 47.0,
      "text": "Because our team members and our travelers are our number one priority, we were looking for a tool that also felt the same way."
    },
    {
      "start": 47.0,
      "end": 54.0,
      "text": "And it was clear that with Navan, that was the case. Like, the tool was built around the user; it wasn't about the tool itself."
    },
    {
      "start": 54.0,
      "end": 102.0,
      "text": "It felt like with Navan you were already putting the traveler first, and it was only going to get better and bigger as we went along."
    },
    {
      "start": 102.0,
      "end": 108.0,
      "text": "Learn more at: www.navan.com"
    }
  ]
}