{
  "full_text": "Je m'appelle Katja Vauken. Je travaille en tant qu'assistante de direction pour le CEO du groupe Solina et je travaille aussi pour l'équipe exec, et je suis responsable du projet travel, donc l'implémentation de Navan. Mon nom est Eric. Je suis DRH du groupe Solina, aujourd'hui présent dans plus de 20 pays, 50 sites de production, une trentaine de sites de recherche et développement. Nous produisons des solutions et des produits culinaires à destination de l'agroalimentaire. Chez Solina, l'organisation de voyages d'affaires était très, très fragmentée, voire non-existante. Et c'était vraiment la user experience qui était vraiment très mauvaise. Ce qui a permis à Navan de se démarquer, c'est d'être très innovateur, de proposer des applications qui tiennent la route, un service client qui est disponible et à l'écoute, une équipe qui nous a accompagnés lors de la mise en place. L'économie de temps, c'est flagrant. On avait par exemple quelques personnes qui étaient dédiées à réserver les voyages pour les autres. Dans un de nos sites en France, on peut le chiffrer. Il y a vraiment un gain de 50 % pour une réceptionniste qui maintenant peut se consacrer à d'autres tâches. Et les gens sont du coup autonomes. Les feedbacks qu'on a eu de voyageurs, c'était effectivement la capacité de Navan à être en ligne avec nos voyageurs quand il y avait des difficultés pour les aider. Pour négocier les tarifs avec les différents partenaires, avant, on ne savait pas combien de nuitées on avait dans telle et telle ville ou combien de vols pour négocier avec Air France, Lufthansa ou tous les partenaires. Aujourd'hui, je suis déjà beaucoup plus crédible parce qu'on arrive avec des statistiques claires, une vision très claire et on peut dire bah voilà, j'ai tant de nuits, qu'est-ce que vous pouvez me faire comme tarif ? Et en plus, l'avantage avec Navan, c'est après, je peux même intégrer ces tarifs négociés dans Navan. Ils sont visibles avec Solina Negotiated Rate. Cette vision globale elle est parfaite en fait. Pour parler de la partie paiement, Navan Card Expense, on n'a plus besoin de faire l'avance de frais pour les voitures, pour les hôtels, pour les vols et pour les trains. Aujourd'hui, il n'y a plus à faire ce travail de vérification des notes de frais. Concernant les avantages pour les utilisateurs, le système de rewards, c'est-à-dire il y a un incentive, on peut gagner des points qu'on peut utiliser après à titre perso. C'est une situation vraiment 'win-win', c'est-à-dire ça incite les collaborateurs à respecter la politique de voyage tout en bénéficiant eux-mêmes après de points pour utiliser Navan. Trois mots pour décrire Navan : innovation, l'écoute des clients, service client, l'investissement, le développement à l'international, et user friendly.",
  "segments": [
    {
      "start": 0.0,
      "end": 6.5,
      "text": "Intro sequence with Navan and Solina logos."
    },
    {
      "start": 6.5,
      "end": 18.0,
      "text": "Katja Vauken introduces herself as Executive Assistant & Group Event Manager for Solina Group, leading the Navan implementation."
    },
    {
      "start": 18.0,
      "end": 41.0,
      "text": "Eric Filliat, HR Director, describes Solina as a global culinary solution provider with 50 sites across 20+ countries."
    },
    {
      "start": 41.0,
      "end": 51.0,
      "text": "Katja describes the previous state: travel was fragmented or non-existent with poor user experience."
    },
    {
      "start": 51.0,
      "end": 1.08,
      "text": "She explains Navan's strengths: innovation, robust apps, available customer service, and strong implementation support."
    },
    {
      "start": 1.08,
      "end": 1.28,
      "text": "The impact on productivity is highlighted, noting a 50% time gain for staff previously dedicated to booking for others."
    },
    {
      "start": 1.28,
      "end": 1.4,
      "text": "Eric mentions traveler feedback regarding Navan's support during travel difficulties."
    },
    {
      "start": 1.4,
      "end": 2.17,
      "text": "Katja discusses data-driven negotiations: having clear stats on nights and flights allows for better deals and integrated negotiated rates."
    },
    {
      "start": 2.17,
      "end": 2.31,
      "text": "The transition to Navan Card & Expense is mentioned, eliminating cash advances and manual expense verification."
    },
    {
      "start": 2.31,
      "end": 2.55,
      "text": "Navan Rewards are highlighted as a 'win-win' for policy compliance and personal benefits for employees."
    },
    {
      "start": 2.55,
      "end": 3.11,
      "text": "Final thoughts and descriptive words for Navan from both speakers."
    }
  ]
}