{
  "full_text": "Straumann makes dental implants, also dental implant technology, design work, and also works with digital side of the implantology. And we're headquartered in Andover, Massachusetts for North America operations. So our team supports procurement from operational perspective on the travel side by really just working hand-in-hand with Navan to review our policies, ensure compliance to those policies, making sure that all of our travel is to industry standards, and really having some of the dynamic tools within Navan truly helps us make sure that we hit our budgets. So our previous TMC, we didn't have any access to any reporting. We had access to none of the data. We had to always put in a request for that. With Navan, we have all that data at our fingertips. It's very seamless and user-friendly. We can do all the analytics that we need within seconds. One of the best benefits of Navan is the mobile app. The app is very easy to use, very user-friendly. It's really tech-forward and it's actually been able to allow us to have 84% adoption rate with all of our travelers utilizing this app. Having the Navan platform at our fingertips has allowed, on the procurement side, finance side, really every entity in Navan who utilize it, time. It gives us time back. It gives us visibility into where people are, what they're spending, where they're going. It gives us a lot of metrics for internal reporting that we wouldn't have had otherwise. Duty of care is very important to us, and knowing where our people are in the field at all times. We have dozens of people every day on the road travel, knowing where they're going, making sure they're safe. My favorite function within the Navan platform as a procurement expert is really being able to see market trends in real-time. We're able to see exactly within any given market, you know, what a going rate is for a hotel, for a car, for a room, and we're able to really use that to drive more informed purchasing decisions. Navan's customer support has been excellent. We currently have a 94% customer satisfaction rate, which really speaks to the professionalism, the dedication, and the follow-through on the Navan team to all of the Straumann needs. And to shed light on the scale of the travel support that Navan has provided to Straumann since adoption, we've traveled over 13,000 trips and 21,000 bookings. Our future goals for our travel program is to just continue to partner with Navan as much as we can. It's been a great partnership in the fact that sharing market information, learning about the travel industry, Navan has been great at sharing with us a lot of data we wouldn't have had, which has really driven us to be able to make better decisions within the company.",
  "segments": [
    {
      "start": 0.0,
      "end": 11.5,
      "text": "Straumann makes dental implants, also dental implant technology, design work, and also works with digital side of the implantology."
    },
    {
      "start": 11.5,
      "end": 19.3,
      "text": "And we're headquartered in Andover, Massachusetts for North America operations."
    },
    {
      "start": 19.3,
      "end": 30.7,
      "text": "So our team supports procurement from operational perspective on the travel side by really just working hand-in-hand with Navan to review our policies,"
    },
    {
      "start": 30.7,
      "end": 40.5,
      "text": "ensure compliance to those policies, making sure that all of our travel is to industry standards, and really having some of the dynamic tools within Navan truly helps us make sure that we hit our budgets."
    },
    {
      "start": 40.5,
      "end": 50.0,
      "text": "So our previous TMC, we didn't have any access to any reporting. We had access to none of the data. We had to always put in a request for that."
    },
    {
      "start": 50.0,
      "end": 55.4,
      "text": "With Navan, we have all that data at our fingertips. It's very seamless and user-friendly. We can do all the analytics that we need within seconds."
    },
    {
      "start": 55.4,
      "end": 64.1,
      "text": "One of the best benefits of Navan is the mobile app. The app is very easy to use, very user-friendly."
    },
    {
      "start": 64.1,
      "end": 74.3,
      "text": "It's really tech-forward and it's actually been able to allow us to have 84% adoption rate with all of our travelers utilizing this app."
    },
    {
      "start": 74.3,
      "end": 88.6,
      "text": "Having the Navan platform at our fingertips has allowed, on the procurement side, finance side, really every entity in Navan who utilize it, time. It gives us time back."
    },
    {
      "start": 88.6,
      "end": 96.5,
      "text": "It gives us visibility into where people are, what they're spending, where they're going. It gives us a lot of metrics for internal reporting that we wouldn't have had otherwise."
    },
    {
      "start": 96.5,
      "end": 105.7,
      "text": "Duty of care is very important to us, and knowing where our people are in the field at all times. We have dozens of people every day on the road travel, knowing where they're going, making sure they're safe."
    },
    {
      "start": 105.7,
      "end": 113.6,
      "text": "My favorite function within the Navan platform as a procurement expert is really being able to see market trends in real-time."
    },
    {
      "start": 113.6,
      "end": 125.8,
      "text": "We're able to see exactly within any given market, you know, what a going rate is for a hotel, for a car, for a room, and we're able to really use that to drive more informed purchasing decisions."
    },
    {
      "start": 125.8,
      "end": 133.7,
      "text": "Navan's customer support has been excellent. We currently have a 94% customer satisfaction rate,"
    },
    {
      "start": 133.7,
      "end": 142.1,
      "text": "which really speaks to the professionalism, the dedication, and the follow-through on the Navan team to all of the Straumann needs."
    },
    {
      "start": 142.1,
      "end": 152.0,
      "text": "And to shed light on the scale of the travel support that Navan has provided to Straumann since adoption, we've traveled over 13,000 trips and 21,000 bookings."
    },
    {
      "start": 152.0,
      "end": 160.8,
      "text": "Our future goals for our travel program is to just continue to partner with Navan as much as we can."
    },
    {
      "start": 160.8,
      "end": 174.0,
      "text": "It's been a great partnership in the fact that sharing market information, learning about the travel industry, Navan has been great at sharing with us a lot of data we wouldn't have had, which has really driven us to be able to make better decisions within the company."
    }
  ]
}