{
  "full_text": "Business travel is a lot. Endless searches, confusing policies, being trapped on hold. Fees, receipts, expense reports. Travel shouldn't be a liability, it should be an opportunity. Enter Navan, the industry's best travel and expense solution. Navan has a singular mission: make travel easy for every frequent traveler. The magic begins with booking. Across flights, hotels, trains, and rental cars, Navan's custom-built platform curates an unparalleled global travel inventory. Then, proprietary AI, backed by a decade of data and fine-tuning, serves up personalized results based on preferences, prior trips, loyalty programs, and more. With company policies built in, so businesses can save money, track spend, and support their teams. Navan also rewards smart spending. When travelers choose lower cost hotels, their company gets the savings, and they get credits to use towards a dream vacation, or to extend a business trip with just a click. Making changes? No problem. Add luggage, swap seats, or cancel. In the office or on the move. Need help? Whether you call our world-class agents or chat with our multilingual AI assistant, Navan is there for you 24/7. Travelers can track their spend against company policies in real time and kick time-consuming expense reports to the curb. Navan automatically captures and categorizes transactions right away. Tap, spend, done. Finance and accounting teams can proactively manage spend and leverage actionable insights for smarter budgeting, saving time and money. When Navan is in your reach, the whole world is within your grasp. Navan: Making travel easy for every frequent traveler.",
  "segments": [
    {
      "start": 0.0,
      "end": 6.0,
      "text": "Business travel is a lot. Endless searches, confusing policies, being trapped on hold."
    },
    {
      "start": 6.0,
      "end": 11.5,
      "text": "Fees, receipts, expense reports. Travel shouldn't be a liability, it should be an opportunity."
    },
    {
      "start": 11.5,
      "end": 20.0,
      "text": "Enter Navan, the industry's best travel and expense solution. Navan has a singular mission:"
    },
    {
      "start": 20.0,
      "end": 24.5,
      "text": "make travel easy for every frequent traveler. The magic begins with booking."
    },
    {
      "start": 24.5,
      "end": 33.5,
      "text": "Across flights, hotels, trains, and rental cars, Navan's custom-built platform curates an unparalleled global travel inventory."
    },
    {
      "start": 33.5,
      "end": 43.5,
      "text": "Then, proprietary AI, backed by a decade of data and fine-tuning, serves up personalized results based on preferences, prior trips, loyalty programs, and more."
    },
    {
      "start": 43.5,
      "end": 50.5,
      "text": "With company policies built in, so businesses can save money, track spend, and support their teams."
    },
    {
      "start": 50.5,
      "end": 59.0,
      "text": "Navan also rewards smart spending. When travelers choose lower cost hotels, their company gets the savings, and they get credits to use towards a dream vacation,"
    },
    {
      "start": 59.0,
      "end": 63.0,
      "text": "or to extend a business trip with just a click. Making changes? No problem."
    },
    {
      "start": 63.0,
      "end": 70.0,
      "text": "Add luggage, swap seats, or cancel. In the office or on the move."
    },
    {
      "start": 70.0,
      "end": 78.5,
      "text": "Need help? Whether you call our world-class agents or chat with our multilingual AI assistant, Navan is there for you 24/7."
    },
    {
      "start": 78.5,
      "end": 85.5,
      "text": "Travelers can track their spend against company policies in real time and kick time-consuming expense reports to the curb."
    },
    {
      "start": 85.5,
      "end": 92.5,
      "text": "Navan automatically captures and categorizes transactions right away. Tap, spend, done."
    },
    {
      "start": 92.5,
      "end": 102.5,
      "text": "Finance and accounting teams can proactively manage spend and leverage actionable insights for smarter budgeting, saving time and money."
    },
    {
      "start": 102.5,
      "end": 113.0,
      "text": "When Navan is in your reach, the whole world is within your grasp. Navan: Making travel easy for every frequent traveler."
    }
  ]
}