{
  "full_text": "Why do I use Navan? No one asked you! It makes managing business travel spend so freaking easy. With Navan, employees book in-policy flights, hotels, cars, and more while I stay in control of our budget. Ooh la la. Do you mind? Sorry. I set my company's travel policy once, and now every employee sees what they can and can't book. I see in real time what everyone's booking. Creepy. And save time by automating approval flows and closing the books faster. When my employees book below policy, they earn rewards for their vacations. What does that even mean? I'm glad you asked. Navan rewards employees towards their personal trips if they book hotels below policy. It's all funded by Navan. Ergo, we improve our bottom line and our employees are happy. It's nice not being the bad guy every now and then. Also, did I mention that it's free to get started on Navan? I guess I just did. Start managing business travel with ease. Sign up on Navan.com.",
  "segments": [
    {
      "start": 0.0,
      "end": 3.5,
      "text": "Why do I use Navan? No one asked you!"
    },
    {
      "start": 3.5,
      "end": 8.5,
      "text": "It makes managing business travel spend so freaking easy."
    },
    {
      "start": 8.5,
      "end": 14.0,
      "text": "With Navan, employees book in-policy flights, hotels, cars, and more while I stay in control of our budget."
    },
    {
      "start": 14.0,
      "end": 17.0,
      "text": "Ooh la la. Do you mind? Sorry."
    },
    {
      "start": 17.0,
      "end": 22.0,
      "text": "I set my company's travel policy once, and now every employee sees what they can and can't book."
    },
    {
      "start": 22.0,
      "end": 26.5,
      "text": "I see in real time what everyone's booking. Creepy."
    },
    {
      "start": 26.5,
      "end": 31.0,
      "text": "And save time by automating approval flows and closing the books faster."
    },
    {
      "start": 31.0,
      "end": 34.5,
      "text": "When my employees book below policy, they earn rewards for their vacations."
    },
    {
      "start": 34.5,
      "end": 37.5,
      "text": "What does that even mean? I'm glad you asked."
    },
    {
      "start": 37.5,
      "end": 44.5,
      "text": "Navan rewards employees towards their personal trips if they book hotels below policy. It's all funded by Navan."
    },
    {
      "start": 44.5,
      "end": 49.0,
      "text": "Ergo, we improve our bottom line and our employees are happy."
    },
    {
      "start": 49.0,
      "end": 52.5,
      "text": "It's nice not being the bad guy every now and then."
    },
    {
      "start": 52.5,
      "end": 57.5,
      "text": "Also, did I mention that it's free to get started on Navan? I guess I just did."
    },
    {
      "start": 57.5,
      "end": 63.5,
      "text": "Start managing business travel with ease. Sign up on Navan.com."
    }
  ]
}