{
  "full_text": "Ziff Davis is a media company. We own many, many brands all over the spectrum within health, wellness, tech, shopping, and in the video gaming industry as well. Our corporate headquarters are here in New York City. However, we have employees all over the world. Navan allows us to have all of these employees book travel to wherever they need to visit all over the world seamlessly, and for us to have the visibility to see where they are and that they're safe and can get the assistance that they need anytime. Prior to Navan, we did not have any sort of centralized booking or applications for the employees to use. But the rest of the company was booking on their own and then submitting for reimbursement. Well, booking outside on their own, there was no visibility where employees were and when they were going places. One of our divisions was using a booking tool, but it was a very small part of the company that was doing it, and we wanted the entire company to use one uniform solution. We also wanted to find a way to centralize all of the costs and have reporting and visibility. When we were comparing the different options that were on the market, we found that Navan seemed to have more options that could be well-utilized at our company. Once we committed to Navan, our implementation went very smooth. It was probably about a two-week process. We had great working sessions with our account manager, Aryan, who was committed to us the whole journey and still has been ever since we went live. We have definitely saved in our travel spend. We have been able to budget better with our group travel. We've been able to invite guests and reduce reimbursement to outsiders from the company. We have also been able to track and reconcile our credit card spend on travel much easier, and we've reduced the amount of work on our accounts payable team by not having all of these expenses be reimbursed and be centralized in one place, especially on a single card. Since implementing Navan, we've saved 21% in travel spend, and we attribute this to the controls we've built in to keep employees aligned in our policy. Navan is always reimagining their solution, so we're excited to see where their new developments are going to take us with them. If a company wants to control travel spend, they need to control the spend at the time of a booking, not after when it's being reimbursed. And that's what we get from Navan.",
  "segments": [
    {
      "start": 0.0,
      "end": 8.5,
      "text": "Ziff Davis is a media company. We own many, many brands all over the spectrum within health, wellness, tech, shopping, and in the video gaming industry as well."
    },
    {
      "start": 8.5,
      "end": 14.5,
      "text": "Our corporate headquarters are here in New York City. However, we have employees all over the world."
    },
    {
      "start": 14.5,
      "end": 22.0,
      "text": "Navan allows us to have all of these employees book travel to wherever they need to visit all over the world seamlessly,"
    },
    {
      "start": 22.0,
      "end": 30.0,
      "text": "and for us to have the visibility to see where they are and that they're safe and can get the assistance that they need anytime."
    },
    {
      "start": 30.0,
      "end": 38.0,
      "text": "Prior to Navan, we did not have any sort of centralized booking or applications for the employees to use."
    },
    {
      "start": 38.0,
      "end": 42.0,
      "text": "But the rest of the company was booking on their own and then submitting for reimbursement."
    },
    {
      "start": 42.0,
      "end": 48.0,
      "text": "Well, booking outside on their own, there was no visibility where employees were and when they were going places."
    },
    {
      "start": 48.0,
      "end": 56.0,
      "text": "One of our divisions was using a booking tool, but it was a very small part of the company that was doing it,"
    },
    {
      "start": 56.0,
      "end": 100.0,
      "text": "and we wanted the entire company to use one uniform solution."
    },
    {
      "start": 100.0,
      "end": 107.0,
      "text": "We also wanted to find a way to centralize all of the costs and have reporting and visibility."
    },
    {
      "start": 107.0,
      "end": 119.0,
      "text": "When we were comparing the different options that were on the market, we found that Navan seemed to have more options that could be well-utilized at our company."
    },
    {
      "start": 119.0,
      "end": 132.0,
      "text": "Once we committed to Navan, our implementation went very smooth. It was probably about a two-week process. We had great working sessions with our account manager, Aryan."
    },
    {
      "start": 132.0,
      "end": 146.0,
      "text": "We have definitely saved in our travel spend. We have been able to budget better with our group travel. We've been able to invite guests and reduce reimbursement to outsiders."
    },
    {
      "start": 146.0,
      "end": 162.0,
      "text": "We have also been able to track and reconcile our credit card spend on travel much easier, and we've reduced the amount of work on our accounts payable team."
    },
    {
      "start": 162.0,
      "end": 202.0,
      "text": "by not having all of these expenses be reimbursed and be centralized in one place, especially on a single card."
    },
    {
      "start": 202.0,
      "end": 211.0,
      "text": "Since implementing Navan, we've saved 21% in travel spend, and we attribute this to the controls we've built in to keep employees aligned in our policy."
    },
    {
      "start": 211.0,
      "end": 221.0,
      "text": "Navan is always reimagining their solution, so we're excited to see where their new developments are going to take us with them."
    },
    {
      "start": 221.0,
      "end": 233.0,
      "text": "If a company wants to control travel spend, they need to control the spend at the time of a booking, not after when it's being reimbursed. And that's what we get from Navan."
    }
  ]
}