{
  "last_indexed": "2026-01-31T23:40:16.189045",
  "videos": {
    "7628fec5974a": {
      "id": "7628fec5974a",
      "path": "assets/normalized_videos/Business_travel_costs_breaking_the_bank_Try_Navan.mp4",
      "filename": "Business_travel_costs_breaking_the_bank_Try_Navan.mp4",
      "duration": 50.108662,
      "resolution": [
        1920,
        1080
      ],
      "fps": 29.97002997002997,
      "file_size": 28022887,
      "transcript_segments": [
        {
          "text": "Is your company's travel spend giving you a permanent headache?",
          "start_time": 0.0,
          "end_time": 3.9
        },
        {
          "text": "Try Navan, the travel and expense platform that saves companies cash.",
          "start_time": 3.9,
          "end_time": 7.8
        },
        {
          "text": "It all starts with preventing out-of-policy spend at the source.",
          "start_time": 7.8,
          "end_time": 12.3
        },
        {
          "text": "Travel policies show employees exactly what they can and can't book.",
          "start_time": 12.3,
          "end_time": 17.5
        },
        {
          "text": "Since Navan has a huge inventory, we show you all the best options and deals from every travel provider.",
          "start_time": 17.5,
          "end_time": 24.0
        },
        {
          "text": "With Navan, employees are motivated to save even more.",
          "start_time": 24.0,
          "end_time": 27.2
        },
        {
          "text": "When booking travel below policy, employees earn Navan rewards toward their next vacation.",
          "start_time": 27.2,
          "end_time": 34.6
        },
        {
          "text": "It's fully funded by us, so your company keeps all those juicy savings.",
          "start_time": 34.6,
          "end_time": 38.8
        },
        {
          "text": "Using Navan is a no-brainer. It's free to get started.",
          "start_time": 38.8,
          "end_time": 42.4
        },
        {
          "text": "So, what's the wait? Start saving today.",
          "start_time": 42.4,
          "end_time": 50.0
        }
      ]
    },
    "1352f62272de": {
      "id": "1352f62272de",
      "path": "assets/normalized_videos/Now_Arriving_BrexPay_for_Navan.mp4",
      "filename": "Now_Arriving_BrexPay_for_Navan.mp4",
      "duration": 15.046531,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 2380551,
      "transcript_segments": [
        {
          "text": "The world's smartest corporate card",
          "start_time": 0.0,
          "end_time": 2.1
        },
        {
          "text": "just teamed up with",
          "start_time": 2.1,
          "end_time": 3.4
        },
        {
          "text": "the world's best enterprise travel",
          "start_time": 3.4,
          "end_time": 6.1
        },
        {
          "text": "to deliver BrexPay for Navan.",
          "start_time": 6.1,
          "end_time": 9.4
        },
        {
          "text": "The new gold standard in enterprise travel.",
          "start_time": 9.4,
          "end_time": 14.4
        }
      ]
    },
    "a88935e936fc": {
      "id": "a88935e936fc",
      "path": "assets/normalized_videos/the Industry's Best Travel and Expense Solution.mp4",
      "filename": "the Industry's Best Travel and Expense Solution.mp4",
      "duration": 112.70966,
      "resolution": [
        640,
        360
      ],
      "fps": 23.976023976023978,
      "file_size": 5716158,
      "transcript_segments": [
        {
          "text": "Business travel is a lot. Endless searches, confusing policies, being trapped on hold.",
          "start_time": 0.0,
          "end_time": 6.0
        },
        {
          "text": "Fees, receipts, expense reports. Travel shouldn't be a liability, it should be an opportunity.",
          "start_time": 6.0,
          "end_time": 11.5
        },
        {
          "text": "Enter Navan, the industry's best travel and expense solution. Navan has a singular mission:",
          "start_time": 11.5,
          "end_time": 20.0
        },
        {
          "text": "make travel easy for every frequent traveler. The magic begins with booking.",
          "start_time": 20.0,
          "end_time": 24.5
        },
        {
          "text": "Across flights, hotels, trains, and rental cars, Navan's custom-built platform curates an unparalleled global travel inventory.",
          "start_time": 24.5,
          "end_time": 33.5
        },
        {
          "text": "Then, proprietary AI, backed by a decade of data and fine-tuning, serves up personalized results based on preferences, prior trips, loyalty programs, and more.",
          "start_time": 33.5,
          "end_time": 43.5
        },
        {
          "text": "With company policies built in, so businesses can save money, track spend, and support their teams.",
          "start_time": 43.5,
          "end_time": 50.5
        },
        {
          "text": "Navan also rewards smart spending. When travelers choose lower cost hotels, their company gets the savings, and they get credits to use towards a dream vacation,",
          "start_time": 50.5,
          "end_time": 59.0
        },
        {
          "text": "or to extend a business trip with just a click. Making changes? No problem.",
          "start_time": 59.0,
          "end_time": 63.0
        },
        {
          "text": "Add luggage, swap seats, or cancel. In the office or on the move.",
          "start_time": 63.0,
          "end_time": 70.0
        },
        {
          "text": "Need help? Whether you call our world-class agents or chat with our multilingual AI assistant, Navan is there for you 24/7.",
          "start_time": 70.0,
          "end_time": 78.5
        },
        {
          "text": "Travelers can track their spend against company policies in real time and kick time-consuming expense reports to the curb.",
          "start_time": 78.5,
          "end_time": 85.5
        },
        {
          "text": "Navan automatically captures and categorizes transactions right away. Tap, spend, done.",
          "start_time": 85.5,
          "end_time": 92.5
        },
        {
          "text": "Finance and accounting teams can proactively manage spend and leverage actionable insights for smarter budgeting, saving time and money.",
          "start_time": 92.5,
          "end_time": 102.5
        },
        {
          "text": "When Navan is in your reach, the whole world is within your grasp. Navan: Making travel easy for every frequent traveler.",
          "start_time": 102.5,
          "end_time": 113.0
        }
      ]
    },
    "504bce1c6038": {
      "id": "504bce1c6038",
      "path": "assets/normalized_videos/Navan_2025_Summer_Product_Release.mp4",
      "filename": "Navan_2025_Summer_Product_Release.mp4",
      "duration": 144.265578,
      "resolution": [
        1920,
        1080
      ],
      "fps": 29.97002997002997,
      "file_size": 15914410,
      "transcript_segments": [
        {
          "text": "Our philosophy at Navan is simple: deliver smarter travel and expense management for your business and an experience travelers love.",
          "start_time": 0.0,
          "end_time": 9.5
        },
        {
          "text": "Today, we're here to show you how our latest release delivers on that promise. This is the Navan Summer 2025 release.",
          "start_time": 9.5,
          "end_time": 16.5
        },
        {
          "text": "When a business trip ends, the work is often just beginning for finance and accounting teams. Moving data between your T&E platform and accounting system is often a bottleneck that requires manual exports, uploads, and reconciliation.",
          "start_time": 16.5,
          "end_time": 28.5
        },
        {
          "text": "That's why we've added Sage Intacct to our suite of direct integrations. Now, all transactions flow directly to your ledger, instantly and accurately, ensuring cleaner books and quicker month-end close.",
          "start_time": 28.5,
          "end_time": 40.0
        },
        {
          "text": "But that's only one part of the equation. The other is ensuring you get the most value from your spend in the first place, and that starts with smarter booking. Our new split ticketing feature for UK rail does exactly that.",
          "start_time": 40.0,
          "end_time": 50.0
        },
        {
          "text": "It automatically splits a single journey into multiple cheaper tickets. Your traveler's journey is exactly the same, the savings are simply built-in.",
          "start_time": 50.0,
          "end_time": 58.0
        },
        {
          "text": "Now, smarter booking also means giving travelers more confidence when planning their next trip.",
          "start_time": 58.0,
          "end_time": 63.0
        },
        {
          "text": "We put on-time performance data front and center in our shopping flow to help you avoid those notoriously late flights and choose a more reliable option.",
          "start_time": 63.0,
          "end_time": 71.0
        },
        {
          "text": "When booking trains, we've expanded seat selection across more carriers, letting you lock in the right seat for yourself or for your entire team right from Navan.",
          "start_time": 71.0,
          "end_time": 80.0
        },
        {
          "text": "And finally, rebooking a hotel you love is now even easier. We show your full stay history for any property so you can find that favorite and book it again in seconds.",
          "start_time": 80.0,
          "end_time": 89.0
        },
        {
          "text": "Let's talk about one of the biggest headaches for finance teams: recovering funds for out-of-policy or personal spend on corporate cards. It's a manual process of chasing employees and running messy payroll deductions.",
          "start_time": 89.0,
          "end_time": 102.0
        },
        {
          "text": "We've solved this problem for Navan cards, but the challenge remained for other linked corporate cards, until now. Navan Connect, which lets you extend the benefits of our expense solution to the cards of your choice, now supports repayments.",
          "start_time": 102.0,
          "end_time": 115.0
        },
        {
          "text": "This means employees can repay personal spend on any connected cards right from Navan.",
          "start_time": 115.0,
          "end_time": 122.0
        },
        {
          "text": "For finance teams, this means the funds are recovered and reconciled in one clean step.",
          "start_time": 122.0,
          "end_time": 128.0
        },
        {
          "text": "Everything you saw today is another step forward in our core mission: making travel easy for every frequent traveler. This is what drives us, and we're just getting started. See you next time.",
          "start_time": 128.0,
          "end_time": 144.0
        }
      ]
    },
    "ab2738c405c5": {
      "id": "ab2738c405c5",
      "path": "assets/normalized_videos/Why_He_Manages_Business_Travel_with_Navan.mp4",
      "filename": "Why_He_Manages_Business_Travel_with_Navan.mp4",
      "duration": 62.252698,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 16246222,
      "transcript_segments": [
        {
          "text": "Why do I use Navan? No one asked you!",
          "start_time": 0.0,
          "end_time": 3.5
        },
        {
          "text": "It makes managing business travel spend so freaking easy.",
          "start_time": 3.5,
          "end_time": 8.5
        },
        {
          "text": "With Navan, employees book in-policy flights, hotels, cars, and more while I stay in control of our budget.",
          "start_time": 8.5,
          "end_time": 14.0
        },
        {
          "text": "Ooh la la. Do you mind? Sorry.",
          "start_time": 14.0,
          "end_time": 17.0
        },
        {
          "text": "I set my company's travel policy once, and now every employee sees what they can and can't book.",
          "start_time": 17.0,
          "end_time": 22.0
        },
        {
          "text": "I see in real time what everyone's booking. Creepy.",
          "start_time": 22.0,
          "end_time": 26.5
        },
        {
          "text": "And save time by automating approval flows and closing the books faster.",
          "start_time": 26.5,
          "end_time": 31.0
        },
        {
          "text": "When my employees book below policy, they earn rewards for their vacations.",
          "start_time": 31.0,
          "end_time": 34.5
        },
        {
          "text": "What does that even mean? I'm glad you asked.",
          "start_time": 34.5,
          "end_time": 37.5
        },
        {
          "text": "Navan rewards employees towards their personal trips if they book hotels below policy. It's all funded by Navan.",
          "start_time": 37.5,
          "end_time": 44.5
        },
        {
          "text": "Ergo, we improve our bottom line and our employees are happy.",
          "start_time": 44.5,
          "end_time": 49.0
        },
        {
          "text": "It's nice not being the bad guy every now and then.",
          "start_time": 49.0,
          "end_time": 52.5
        },
        {
          "text": "Also, did I mention that it's free to get started on Navan? I guess I just did.",
          "start_time": 52.5,
          "end_time": 57.5
        },
        {
          "text": "Start managing business travel with ease. Sign up on Navan.com.",
          "start_time": 57.5,
          "end_time": 63.5
        }
      ]
    },
    "021933eafd71": {
      "id": "021933eafd71",
      "path": "assets/normalized_videos/Navan_Making_travel_easy_for_every_frequent_traveler.mp4",
      "filename": "Navan_Making_travel_easy_for_every_frequent_traveler.mp4",
      "duration": 112.7561,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 48265247,
      "transcript_segments": [
        {
          "text": "The Buddha said, it's the journey that matters, not the destination. But the Buddha never traveled for work.",
          "start_time": 0.0,
          "end_time": 7.0
        },
        {
          "text": "He never arrived at his hotel after midnight to find that his reservation disappeared. Or spent his weekends filing expense reports.",
          "start_time": 7.0,
          "end_time": 14.0
        },
        {
          "text": "He never had to stay a night here or get a pat down there. The Buddha never got stuck in the middle seat on a red-eye next to this guy. No wonder he was enlightened.",
          "start_time": 14.0,
          "end_time": 28.0
        },
        {
          "text": "In business, what matters most is the connection that starts the moment you arrive. It's all about showing up and being there.",
          "start_time": 28.0,
          "end_time": 45.0
        },
        {
          "text": "Humans use 18 different smiles, but only one reflects true happiness. And no matter how hard you squint, you'll never be able to see that smile through your screen.",
          "start_time": 45.0,
          "end_time": 60.0
        },
        {
          "text": "With Navan, you'll see it live and in person. We'll help you get there and we've got your back if something goes wrong.",
          "start_time": 60.0,
          "end_time": 105.0
        },
        {
          "text": "Navan is here to move people and ideas and businesses forward. That's the business we're in. The chat over coffee that changes everything business.",
          "start_time": 105.0,
          "end_time": 125.0
        },
        {
          "text": "So let's go take the dread out of work travel and put some humanity back in business. Let's go make travel so effortless and easy that it's no longer a pain but a perk.",
          "start_time": 125.0,
          "end_time": 140.0
        },
        {
          "text": "Let's go get the dreamers and the doers in the same room so they can work their magic. Navan. Making travel easy for every frequent traveler.",
          "start_time": 140.0,
          "end_time": 152.0
        }
      ]
    },
    "5e60c82940ae": {
      "id": "5e60c82940ae",
      "path": "assets/normalized_videos/Pay back employees - Categorise.webm",
      "filename": "Pay back employees - Categorise.webm",
      "duration": 6.988,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 311886,
      "transcript_segments": []
    },
    "ea7df078dfee": {
      "id": "ea7df078dfee",
      "path": "assets/normalized_videos/Navan_2025_Spring_Product_Release.mp4",
      "filename": "Navan_2025_Spring_Product_Release.mp4",
      "duration": 183.182222,
      "resolution": [
        1920,
        1080
      ],
      "fps": 24.0,
      "file_size": 18213588,
      "transcript_segments": [
        {
          "text": "Welcome to Navan's Spring 2025 release.",
          "start_time": 0.0,
          "end_time": 4.5
        },
        {
          "text": "I'm Rich Liu, CEO of Travel at Navan and I'm thrilled to share some of our most exciting new features.",
          "start_time": 4.5,
          "end_time": 11.0
        },
        {
          "text": "We've made functionality more functional and personalization more personal.",
          "start_time": 11.0,
          "end_time": 15.5
        },
        {
          "text": "For you, that means more control over travel and expense management and a stronger T&E program.",
          "start_time": 15.5,
          "end_time": 21.0
        },
        {
          "text": "Ready? Let's go.",
          "start_time": 21.0,
          "end_time": 23.5
        },
        {
          "text": "First up, flight bookings.",
          "start_time": 23.5,
          "end_time": 26.0
        },
        {
          "text": "Our teams have been heads down responding to all the complex behind the scenes changes happening with content distribution.",
          "start_time": 26.0,
          "end_time": 32.5
        },
        {
          "text": "We're optimizing our flight storefront so that when your travelers shop for flights, they can quickly scan the details and make faster decisions.",
          "start_time": 32.5,
          "end_time": 40.5
        },
        {
          "text": "And NDC, we've become the industry leader because we've seen the savings and efficiencies it offers.",
          "start_time": 40.5,
          "end_time": 47.5
        },
        {
          "text": "So we continue to go big on NDC with 18 live connections, now including Iberia, Breeze, and Aegean Airlines coming soon.",
          "start_time": 47.5,
          "end_time": 57.0
        },
        {
          "text": "Next up, let's talk data.",
          "start_time": 57.0,
          "end_time": 59.5
        },
        {
          "text": "Travel data can be unhelpful without a clear way of understanding the story it's telling.",
          "start_time": 59.5,
          "end_time": 65.0
        },
        {
          "text": "That's why very soon we're expanding our analytics capabilities to offer clearer, more actionable insights.",
          "start_time": 65.0,
          "end_time": 72.5
        },
        {
          "text": "Interactive dashboards and widgets will surface trends, identify savings opportunities, examine traveler behavior, and let you set real-time alerts.",
          "start_time": 72.5,
          "end_time": 81.5
        },
        {
          "text": "No data science degree required.",
          "start_time": 81.5,
          "end_time": 83.5
        },
        {
          "text": "Next up, mobile bookings, which were completely redesigned for flights and hotels on iOS.",
          "start_time": 83.5,
          "end_time": 90.5
        },
        {
          "text": "This intuitive new interface guides travelers seamlessly from search to checkout with easier comparisons along the way.",
          "start_time": 90.5,
          "end_time": 98.0
        },
        {
          "text": "And because it's just as important to manage expenses on the go, we've redesigned our iOS and Android expense experience for easier navigation.",
          "start_time": 98.0,
          "end_time": 105.0
        },
        {
          "text": "At Navan, we've always been innovative and now we're officially integrated with Uber for Business.",
          "start_time": 105.0,
          "end_time": 113.0
        },
        {
          "text": "All that receipt searching and submitting after an Uber ride? Gone.",
          "start_time": 113.0,
          "end_time": 118.5
        },
        {
          "text": "Now Navan automatically matches Uber receipts to transactions and uploads them right after you ride.",
          "start_time": 118.5,
          "end_time": 125.5
        },
        {
          "text": "It's another example of how we're driving the conversation.",
          "start_time": 125.5,
          "end_time": 128.5
        },
        {
          "text": "And speaking of driving, we've improved our mileage tracker with more precise distance calculations and rates more closely aligned with regional regulations.",
          "start_time": 128.5,
          "end_time": 133.5
        },
        {
          "text": "Logging distances is a breeze and Navan's automatic reclaim calculations mean employees can get reimbursed faster than ever.",
          "start_time": 133.5,
          "end_time": 141.5
        },
        {
          "text": "We're also helping accountants increase their efficiency and the accuracy of the data they need.",
          "start_time": 141.5,
          "end_time": 148.5
        },
        {
          "text": "Our updated accounting review page better supports accrual-based accounting by syncing reimbursements into your ERP based on the transaction date.",
          "start_time": 148.5,
          "end_time": 158.0
        },
        {
          "text": "We've also added new filters and direct ERP syncing for more customized control and better cash flow visibility.",
          "start_time": 158.0,
          "end_time": 166.5
        },
        {
          "text": "Plus, we've made month-end close speedier with bulk actions.",
          "start_time": 166.5,
          "end_time": 172.0
        },
        {
          "text": "Now you can edit and apply up to 50 changes at once.",
          "start_time": 172.0,
          "end_time": 177.0
        },
        {
          "text": "What's next for Navan? Follow us on LinkedIn and check us out at navan.com to learn more.",
          "start_time": 177.0,
          "end_time": 184.0
        }
      ]
    },
    "07d24a1a6d10": {
      "id": "07d24a1a6d10",
      "path": "assets/normalized_videos/Solina_une_gestion_harmonieuse_des_voyages_à_linternational_avec_Navan.mp4",
      "filename": "Solina_une_gestion_harmonieuse_des_voyages_à_linternational_avec_Navan.mp4",
      "duration": 190.333968,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 51888800,
      "transcript_segments": [
        {
          "text": "Intro sequence with Navan and Solina logos.",
          "start_time": 0.0,
          "end_time": 6.5
        },
        {
          "text": "Katja Vauken introduces herself as Executive Assistant & Group Event Manager for Solina Group, leading the Navan implementation.",
          "start_time": 6.5,
          "end_time": 18.0
        },
        {
          "text": "Eric Filliat, HR Director, describes Solina as a global culinary solution provider with 50 sites across 20+ countries.",
          "start_time": 18.0,
          "end_time": 41.0
        },
        {
          "text": "Katja describes the previous state: travel was fragmented or non-existent with poor user experience.",
          "start_time": 41.0,
          "end_time": 51.0
        },
        {
          "text": "She explains Navan's strengths: innovation, robust apps, available customer service, and strong implementation support.",
          "start_time": 51.0,
          "end_time": 1.08
        },
        {
          "text": "The impact on productivity is highlighted, noting a 50% time gain for staff previously dedicated to booking for others.",
          "start_time": 1.08,
          "end_time": 1.28
        },
        {
          "text": "Eric mentions traveler feedback regarding Navan's support during travel difficulties.",
          "start_time": 1.28,
          "end_time": 1.4
        },
        {
          "text": "Katja discusses data-driven negotiations: having clear stats on nights and flights allows for better deals and integrated negotiated rates.",
          "start_time": 1.4,
          "end_time": 2.17
        },
        {
          "text": "The transition to Navan Card & Expense is mentioned, eliminating cash advances and manual expense verification.",
          "start_time": 2.17,
          "end_time": 2.31
        },
        {
          "text": "Navan Rewards are highlighted as a 'win-win' for policy compliance and personal benefits for employees.",
          "start_time": 2.31,
          "end_time": 2.55
        },
        {
          "text": "Final thoughts and descriptive words for Navan from both speakers.",
          "start_time": 2.55,
          "end_time": 3.11
        }
      ]
    },
    "d2f60c0fbbad": {
      "id": "d2f60c0fbbad",
      "path": "assets/normalized_videos/Navan_transforme_le_quotidien_de_léquipe_Finance_de_PayFit.mp4",
      "filename": "Navan_transforme_le_quotidien_de_léquipe_Finance_de_PayFit.mp4",
      "duration": 196.580136,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 56743954,
      "transcript_segments": [
        {
          "text": "Intro and company overview.",
          "start_time": 0.0,
          "end_time": 8.1
        },
        {
          "text": "Je m'appelle Julien Lachowski, et je suis FP&A director chez PayFit.",
          "start_time": 8.1,
          "end_time": 13.9
        },
        {
          "text": "PayFit est un logiciel de paie français qui permet une automatisation des processus de paie et plus globalement des Ressources Humaines.",
          "start_time": 13.9,
          "end_time": 20.8
        },
        {
          "text": "Avant Navan, on utilisait une solution qui était peut-être un peu moins simple d'utilisation, et qui nous nécessitait beaucoup de travail en back office.",
          "start_time": 20.8,
          "end_time": 29.1
        },
        {
          "text": "Nous avons choisi Navan pour la profondeur de son catalogue à l'étranger, donc dans les différents pays dans lesquels nous avons besoin de voyager.",
          "start_time": 29.1,
          "end_time": 37.1
        },
        {
          "text": "Aussi pour l'expérience utilisateur, c'est-à-dire la simplicité de cette plateforme, c'est assez intéressant.",
          "start_time": 37.1,
          "end_time": 44.4
        },
        {
          "text": "Ce qu'on appelle l'UX, c'est ça qui nous a fait finalement choisir la solution.",
          "start_time": 44.4,
          "end_time": 48.9
        },
        {
          "text": "On a quand même les mêmes références que sur des plateformes, un peu plus utilisées à titre personnel.",
          "start_time": 48.9,
          "end_time": 56.4
        },
        {
          "text": "Quand on voyage, il ne faut pas qu'on ait de mauvaises surprises et autant au niveau des administrateurs qu'au niveau du voyageur, c'est vraiment le cas avec la plateforme Navan.",
          "start_time": 56.4,
          "end_time": 68.2
        },
        {
          "text": "La possibilité de paramétrer des politiques dynamiques sur Navan, en tant que financier, c'est hyper intéressant,",
          "start_time": 108.9,
          "end_time": 113.8
        },
        {
          "text": "pour la simple et bonne raison qu'en fonction de la période et du prix moyen des hôtels par exemple dans différentes villes,",
          "start_time": 113.8,
          "end_time": 121.7
        },
        {
          "text": "ça va nous permettre d'adapter automatiquement le prix qu'on autorise à nos collaborateurs d'utiliser pour booker leurs hôtels.",
          "start_time": 121.7,
          "end_time": 130.6
        },
        {
          "text": "Et donc, ça va représenter des opportunités d'optimisation des coûts qui sont non négligeables pour nous qui sommes financiers.",
          "start_time": 130.6,
          "end_time": 138.4
        },
        {
          "text": "L'implémentation de Navan, ça a été aussi l'occasion de revoir nos politiques de voyages en interne et nos politiques de voyages un peu \"green\".",
          "start_time": 138.4,
          "end_time": 149.8
        },
        {
          "text": "Donc typiquement, on a mis en place des règles pour favoriser l'utilisation du train Versus l'avion sur certains cas de figure, par exemple, les allers-retours entre le domicile et le lieu de travail,",
          "start_time": 149.8,
          "end_time": 161.9
        },
        {
          "text": "ou des voyages sur des courtes distances.",
          "start_time": 161.9,
          "end_time": 165.2
        },
        {
          "text": "Donc grâce aux rapports qu'on peut sortir sur la plateforme Navan qui vont pouvoir calculer nos émissions de carbone par voyage,",
          "start_time": 165.2,
          "end_time": 174.4
        },
        {
          "text": "ça va nous permettre de calculer beaucoup plus facilement notre bilan carbone en fin d'année",
          "start_time": 174.4,
          "end_time": 182.2
        },
        {
          "text": "et donc de s'apercevoir qu'on arrive grâce à la plateforme Navan à réduire notre empreinte carbone liée au déplacement chez PayFit.",
          "start_time": 182.2,
          "end_time": 192.1
        },
        {
          "text": "La ligne de crédit que nous met à disposition Navan et l'avance de frais que ça représente, ça a beaucoup simplifié les processus comptables",
          "start_time": 225.1,
          "end_time": 234.3
        },
        {
          "text": "puisque avec notre ancienne plateforme, on avait une multitude de transactions qu'on devait comptabiliser et suivre.",
          "start_time": 234.3,
          "end_time": 242.0
        },
        {
          "text": "Et aujourd'hui, on n'a plus qu'une facture en fin de mois, qu'on reçoit, qu'on arrive à importer automatiquement dans notre ERP.",
          "start_time": 242.0,
          "end_time": 249.2
        },
        {
          "text": "Il est vrai que depuis l'implémentation de Navan, on a gagné beaucoup de temps dans la gestion de tous ces frais, dans le tracking des coûts liés aux déplacements de nos collaborateurs.",
          "start_time": 249.2,
          "end_time": 259.9
        },
        {
          "text": "Et donc forcément, pour moi, ça a été du temps gagné. Donc j'ai pu me concentrer sur d'autres tâches à plus forte valeur ajoutée",
          "start_time": 259.9,
          "end_time": 268.3
        },
        {
          "text": "et ça a pu m'aider dans la réalisation de mes objectifs à moyen terme.",
          "start_time": 268.3,
          "end_time": 277.0
        }
      ]
    },
    "858f04f2bceb": {
      "id": "858f04f2bceb",
      "path": "assets/normalized_videos/Booking-step1-Search.webm",
      "filename": "Booking-step1-Search.webm",
      "duration": 6.498,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 132795,
      "transcript_segments": [
        {
          "text": "Where to?",
          "start_time": 0.0,
          "end_time": 2.0
        },
        {
          "text": "London, UK",
          "start_time": 2.0,
          "end_time": 4.0
        },
        {
          "text": "Flight options for Delta, American Airlines, and British Airways.",
          "start_time": 4.0,
          "end_time": 7.0
        }
      ]
    },
    "1660649671ab": {
      "id": "1660649671ab",
      "path": "assets/normalized_videos/1E_saves_160_hours_a_month_on_expense_management_with_Navans_all-in-one_solution.mp4",
      "filename": "1E_saves_160_hours_a_month_on_expense_management_with_Navans_all-in-one_solution.mp4",
      "duration": 195.395918,
      "resolution": [
        1920,
        1080
      ],
      "fps": 29.97002997002997,
      "file_size": 34759704,
      "transcript_segments": [
        {
          "text": "1E's main offices are in the US, in India, and in the UK. We've also got offices in Ireland, but we've got people situated in Canada, South Africa, and Europe as well.",
          "start_time": 0.0,
          "end_time": 14.7
        },
        {
          "text": "The employees at 1E travel across the world to collaborate together. They also go out to meet customers.",
          "start_time": 14.7,
          "end_time": 20.9
        },
        {
          "text": "130 of our employees are using the travel solution.",
          "start_time": 20.9,
          "end_time": 24.5
        },
        {
          "text": "The reason we chose Navan was because it was a platform that catered for three solutions in one. So one was booking of travel, one was the expense side, and the third was the credit card piece. So we had everything in one platform.",
          "start_time": 24.5,
          "end_time": 39.4
        },
        {
          "text": "It was just a lot easier to use and it gave that ownership to individuals within the company, whilst we still maintain that control centrally.",
          "start_time": 39.4,
          "end_time": 50.3
        },
        {
          "text": "1E were booking their travel with Egencia prior to me joining.",
          "start_time": 50.3,
          "end_time": 57.1
        },
        {
          "text": "The Egencia contract came to an end because we weren't getting the inventory that we wanted on the system.",
          "start_time": 57.1,
          "end_time": 63.9
        },
        {
          "text": "The employees at 1E have really enjoyed the Navan solutions.",
          "start_time": 63.9,
          "end_time": 71.0
        },
        {
          "text": "And that showed through the customer satisfaction rate of 82% and a net promoter score of +70.",
          "start_time": 71.0,
          "end_time": 80.0
        },
        {
          "text": "As the person managing global travel previously, I found the old travel process quite clunky. It had to go through quite a few approval chains and often there was a lot of discrepancies with the platform that didn't sync up with the real time.",
          "start_time": 80.0,
          "end_time": 96.0
        },
        {
          "text": "The previous travel process was inaccurate and often unreliable.",
          "start_time": 96.0,
          "end_time": 100.8
        },
        {
          "text": "1E used the Silicon Valley platform for both expenses and credit cards.",
          "start_time": 100.8,
          "end_time": 105.5
        },
        {
          "text": "Unfortunately, it wasn't the best system. The data for the SVB credit cards wasn't real-time, so people couldn't add their receipts straight away. People would forget to do it because it was on a delay.",
          "start_time": 105.5,
          "end_time": 118.0
        },
        {
          "text": "It was one person that was managing it, he would often have to chase and chase and chase for receipts.",
          "start_time": 118.0,
          "end_time": 125.1
        },
        {
          "text": "Now with Navan, the receipt issue has dropped, so there's minimum chasing of receipts because it's just a click of a button and it's uploaded.",
          "start_time": 125.1,
          "end_time": 134.4
        },
        {
          "text": "So the three words to describe Navan would be simple, user-friendly, and time-saving.",
          "start_time": 134.4,
          "end_time": 142.1
        },
        {
          "text": "The implementation of Navan was very simple and easy, and the implementation was probably an hour, two hours' work at the most.",
          "start_time": 142.1,
          "end_time": 154.5
        },
        {
          "text": "With the expense side, my favorite... well, I've got lots of favorite features because I've got a lot more control now over the expenses.",
          "start_time": 154.5,
          "end_time": 165.0
        },
        {
          "text": "You know, I've got reporting visibility, which is amazing. We can control that.",
          "start_time": 165.0,
          "end_time": 169.5
        },
        {
          "text": "Navan has helped 1E make lots of savings in the travel bookings.",
          "start_time": 169.5,
          "end_time": 177.5
        },
        {
          "text": "So far to date, we've saved 18% in air travel and 14% in hotels.",
          "start_time": 177.5,
          "end_time": 184.8
        },
        {
          "text": "Before we had Navan, we had a whole person dedicated to expenses.",
          "start_time": 184.8,
          "end_time": 192.5
        },
        {
          "text": "Since we've introduced Navan, that individual has been repurposed to do another role in finance. So we've actually saved on a whole head by installing Navan.",
          "start_time": 192.5,
          "end_time": 204.0
        },
        {
          "text": "Having Navan in place has allowed the finance team to get away from their day-to-day checking of individual expenses and it's freed up time to focus on more strategic initiatives that we've got in place.",
          "start_time": 204.0,
          "end_time": 218.0
        },
        {
          "text": "If I could describe Navan in one word, it would be effortless.",
          "start_time": 218.0,
          "end_time": 227.0
        }
      ]
    },
    "1920b3d93145": {
      "id": "1920b3d93145",
      "path": "assets/normalized_videos/Fever-Tree_adopts_Navan_for_control_and_proactive_travel_and_expense_management.mp4",
      "filename": "Fever-Tree_adopts_Navan_for_control_and_proactive_travel_and_expense_management.mp4",
      "duration": 197.973333,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 71100636,
      "transcript_segments": [
        {
          "text": "Fever-Tree's headquarters are in London",
          "start_time": 0.0,
          "end_time": 5.1
        },
        {
          "text": "and we also have offices in Munich, New York and Sydney.",
          "start_time": 5.1,
          "end_time": 10.9
        },
        {
          "text": "Fever-Tree sell premium mixers.",
          "start_time": 10.9,
          "end_time": 13.5
        },
        {
          "text": "We're currently in the Fever-Tree Bar and this is what we call our brand home.",
          "start_time": 13.5,
          "end_time": 17.5
        },
        {
          "text": "It's really important for the Fever-Tree sales team to meet with our customers",
          "start_time": 17.5,
          "end_time": 22.1
        },
        {
          "text": "in a space such as this so that we can demonstrate our products in this premium environment.",
          "start_time": 22.1,
          "end_time": 26.0
        },
        {
          "text": "Fever-Tree had a travel and expense policy in place.",
          "start_time": 26.0,
          "end_time": 30.2
        },
        {
          "text": "It was a document that was circulated amongst staff and it was up to the individuals",
          "start_time": 30.2,
          "end_time": 34.6
        },
        {
          "text": "to make sure that they complied with that policy.",
          "start_time": 34.6,
          "end_time": 37.8
        },
        {
          "text": "People tended to book their own travel and claim that back through expenses.",
          "start_time": 37.8,
          "end_time": 42.0
        },
        {
          "text": "So we wanted to create a single process for people to book through the platform.",
          "start_time": 42.0,
          "end_time": 46.8
        },
        {
          "text": "And we wanted to be able to embed the travel within that expense process as well.",
          "start_time": 46.8,
          "end_time": 51.5
        },
        {
          "text": "I think some of the pain points that we experienced managing travel was just the unknown.",
          "start_time": 51.5,
          "end_time": 56.4
        },
        {
          "text": "We didn't necessarily know who was traveling when until we received an expense coming in.",
          "start_time": 56.4,
          "end_time": 61.2
        },
        {
          "text": "So it was always a case that we were quite reactive to the process rather than being proactive,",
          "start_time": 61.2,
          "end_time": 66.5
        },
        {
          "text": "knowing when people are, signing off travel ahead of time",
          "start_time": 66.5,
          "end_time": 71.1
        },
        {
          "text": "and understanding why that travel is taking place.",
          "start_time": 71.1,
          "end_time": 73.8
        },
        {
          "text": "That process now has largely gone away.",
          "start_time": 73.8,
          "end_time": 76.5
        },
        {
          "text": "People are reimbursed as the expense happens and the travel is booked and paid for through",
          "start_time": 76.5,
          "end_time": 81.3
        },
        {
          "text": "a virtual card rather than on individual's expenses.",
          "start_time": 81.3,
          "end_time": 84.7
        },
        {
          "text": "We've saved 2 days from the finance team on a monthly basis",
          "start_time": 84.7,
          "end_time": 87.8
        },
        {
          "text": "in terms of administering expenses and reimbursing people because those monthly processes",
          "start_time": 87.8,
          "end_time": 93.4
        },
        {
          "text": "were quite manual before.",
          "start_time": 93.4,
          "end_time": 95.8
        },
        {
          "text": "On the traveler's side, there's also been savings in terms of booking those flights",
          "start_time": 95.8,
          "end_time": 99.8
        },
        {
          "text": "through the platform or hotels, but also less time in then having to upload receipts",
          "start_time": 99.8,
          "end_time": 105.0
        },
        {
          "text": "for their flights, for the hotels, and for other expenses that they might be incurring.",
          "start_time": 105.0,
          "end_time": 110.0
        },
        {
          "text": "My favorite travel feature is that we can know where all our travelers are at any given time.",
          "start_time": 110.0,
          "end_time": 115.3
        },
        {
          "text": "That really helps with any kind of duty of care.",
          "start_time": 115.3,
          "end_time": 118.8
        },
        {
          "text": "Navan enables us to do carbon reporting on our travel,",
          "start_time": 118.8,
          "end_time": 122.1
        },
        {
          "text": "giving us those insights on our carbon emissions that will be really useful",
          "start_time": 122.1,
          "end_time": 126.5
        },
        {
          "text": "in terms of understanding our carbon footprint as a business and understanding how we can",
          "start_time": 126.5,
          "end_time": 132.0
        },
        {
          "text": "manage that through our sustainability team.",
          "start_time": 132.0,
          "end_time": 135.2
        },
        {
          "text": "With Navan we are able to manage our cost much more effectively",
          "start_time": 135.2,
          "end_time": 139.5
        },
        {
          "text": "because we have much better visibility over what we're spending on a real time basis.",
          "start_time": 139.5,
          "end_time": 143.5
        },
        {
          "text": "We've made 14% savings on flights and 22% savings on hotels.",
          "start_time": 143.5,
          "end_time": 148.8
        },
        {
          "text": "Most employees have access to a Navan card at Fever-Tree",
          "start_time": 148.8,
          "end_time": 153.1
        },
        {
          "text": "and that is based on whether they are spending a significant amount of time on travel.",
          "start_time": 153.1,
          "end_time": 157.0
        },
        {
          "text": "My favorite expense feature in Navan is the fact that I can do pretty much everything on my phone.",
          "start_time": 157.0,
          "end_time": 161.4
        },
        {
          "text": "I can record all of my expenses as I use my Navan card.",
          "start_time": 161.4,
          "end_time": 166.3
        },
        {
          "text": "The expense immediately pops up and I can add the receipt in real time.",
          "start_time": 166.3,
          "end_time": 170.8
        },
        {
          "text": "So it's super convenient.",
          "start_time": 170.8,
          "end_time": 173.8
        },
        {
          "text": "Realtime visibility and reporting has been one of the key selling points for us with Navan.",
          "start_time": 173.8,
          "end_time": 179.3
        },
        {
          "text": "It's enabled us to understand trips as they are happening",
          "start_time": 179.3,
          "end_time": 184.8
        },
        {
          "text": "and then the cost is immediately updated in any kind of dashboard or report.",
          "start_time": 184.8,
          "end_time": 189.6
        },
        {
          "text": "So we can immediately see how we're tracking against budget.",
          "start_time": 189.6,
          "end_time": 194.2
        },
        {
          "text": "Our employees are enjoying using Navan.",
          "start_time": 194.2,
          "end_time": 197.8
        },
        {
          "text": "We have a customer satisfaction rate of 4.9 out of 5, which is really positive.",
          "start_time": 197.8,
          "end_time": 202.8
        },
        {
          "text": "If I had to describe Navan, it would be that it's convenient, it's intuitive and it's all in one.",
          "start_time": 202.8,
          "end_time": 209.1
        }
      ]
    },
    "cb65c20f2033": {
      "id": "cb65c20f2033",
      "path": "assets/normalized_videos/Introducing_the_New_Navan_Admin_Dashboard_Navigation.mp4",
      "filename": "Introducing_the_New_Navan_Admin_Dashboard_Navigation.mp4",
      "duration": 69.497324,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 2300658,
      "transcript_segments": [
        {
          "text": "Intro title: REDESIGNED NAVIGATION Admin dashboard",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Hey everyone, thanks for joining. I'm excited to walk you through the redesigned Navan admin dashboard navigation for both travel and expense admins.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "So, the biggest change obviously as you can see is we've moved from a top navigation to a left-hand side navigation.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "This makes it much faster and easier to get to where you need to go.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "So now your travel, expense, and configuration admin apps are grouped neatly on the left and everything stays right at your fingertips without page reloads.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Next, you'll notice that the sections are expandable and collapsible as you see fit.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "So related pages are grouped together so you can stay organized and jump to exactly where you want to go without digging through all sorts of hidden menus.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "It's cleaner, it's simpler, and it's designed to help you stay focused on the task at hand.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "So yeah, we can't wait for you to experience the new navigation. It's built to definitely to simplify and speed up your workflow so you can manage travel and expense more efficiently.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Thanks for taking a couple minutes to explore it and yeah we're excited for you all to dive in.",
          "start_time": 0.0,
          "end_time": 0.0
        }
      ]
    },
    "21a1efcd3178": {
      "id": "21a1efcd3178",
      "path": "assets/normalized_videos/How_to_do_a_multi_city_booking.mp4",
      "filename": "How_to_do_a_multi_city_booking.mp4",
      "duration": 98.499048,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 5974344,
      "transcript_segments": [
        {
          "text": "Hi, my name is Doug, I'm an account manager here at Navan. And today we're going to run through making a multi-city flight booking using the Navan web app.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "To begin with, we're going to start at the homepage as we usually would and search flights in the same way as we usually would.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "However, the only difference is we're going to change the toggle from round-trip to multi-city and we have the option here to add multiple legs when we're traveling.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "In this example, we're going to be going from London to Madrid to Barcelona and back to London again.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "You'll see as we build up this itinerary, we're choosing our departure dates, the arrival and departure airports, and then we're able to add more flights if needs be.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "When we search for these flights, the dynamic policy works in the same way how it usually would when selecting a one-way or a round-trip flight.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "And you'll see when the options come through, they'll be either bundled or be able to be booked as one leg at a time.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "If you do have any bookings where there's more than two or three different cities you're traveling to, our suggestion is to always go through our travel support team where you can.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "As mentioned, when the prices have come through, you'll see we have the bundled options and the custom flights options.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "When we click into the custom flights, we select each leg at a time as if it was a one-way trip.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "From here, if you select the bundle, you can go through to check out and you're ready to fly.",
          "start_time": 0.0,
          "end_time": 0.0
        }
      ]
    },
    "b0f89275df9a": {
      "id": "b0f89275df9a",
      "path": "assets/normalized_videos/Spend Control - Track.webm",
      "filename": "Spend Control - Track.webm",
      "duration": 6.092,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 138889,
      "transcript_segments": []
    },
    "454ba675c324": {
      "id": "454ba675c324",
      "path": "assets/normalized_videos/zoom_loop_desktop.webm",
      "filename": "zoom_loop_desktop.webm",
      "duration": 12.042,
      "resolution": [
        630,
        690
      ],
      "fps": 24.0,
      "file_size": 245276,
      "transcript_segments": []
    },
    "cd10b5b9d9c1": {
      "id": "cd10b5b9d9c1",
      "path": "assets/normalized_videos/Navan Travel Support.webm",
      "filename": "Navan Travel Support.webm",
      "duration": 177.035,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 11677956,
      "transcript_segments": [
        {
          "text": "I worked in the airline industry before this for about 10 years",
          "start_time": 0.0,
          "end_time": 4.1
        },
        {
          "text": "and I have a passion for travel.",
          "start_time": 4.1,
          "end_time": 6.8
        },
        {
          "text": "And when the opportunity arose for me to come to Navan to work in corporate travel,",
          "start_time": 6.8,
          "end_time": 11.5
        },
        {
          "text": "I just I had to take it. The most rewarding part of my job is being able to see the final solution",
          "start_time": 11.5,
          "end_time": 19.3
        },
        {
          "text": "and work on a resolution and communicating with the customer and the client everything that I'm doing so they know that they're in good hands.",
          "start_time": 19.3,
          "end_time": 26.5
        },
        {
          "text": "So my onboarding, it was pretty extensive, but they prepared me for what I need to do next steps.",
          "start_time": 26.5,
          "end_time": 35.6
        },
        {
          "text": "Gave me the tools I needed. Made sure that we were actually trained in multiple platforms because here we do use more than just one traditional platform.",
          "start_time": 35.6,
          "end_time": 43.5
        },
        {
          "text": "So that has all contributed to my success so far. My motto is that there's not always one way to do something",
          "start_time": 43.5,
          "end_time": 51.7
        },
        {
          "text": "and that there are different avenues that we can take in order to find a resolution.",
          "start_time": 51.7,
          "end_time": 59.9
        },
        {
          "text": "And a lot of times people just think it's point A to point B and that there's not a point A, B, C, D to get you to where you need to go to finalize.",
          "start_time": 59.9,
          "end_time": 68.3
        },
        {
          "text": "So being able to use my quirkiness to put a puzzle together in order to help them during high times,",
          "start_time": 68.3,
          "end_time": 76.5
        },
        {
          "text": "intense situations, important business meetings, conferences, events or things like that.",
          "start_time": 76.5,
          "end_time": 84.7
        },
        {
          "text": "That's what my expertise brings to the table is because I have a vast knowledge of being able to problem solve and find a resolution whether it's for personal or for business.",
          "start_time": 84.7,
          "end_time": 93.3
        },
        {
          "text": "Complex travel issues are every day. Mainly because we service worldwide.",
          "start_time": 93.3,
          "end_time": 100.8
        },
        {
          "text": "And weather can happen anywhere at any time with or without notice.",
          "start_time": 100.8,
          "end_time": 107.5
        },
        {
          "text": "The job is intense and it's not intense hard, it's intense really understanding what to do",
          "start_time": 107.5,
          "end_time": 113.8
        },
        {
          "text": "and how to do it so that you won't make mistakes. Because there's so many different things across the board, you have to know each field.",
          "start_time": 113.8,
          "end_time": 121.2
        },
        {
          "text": "The value that I add in that I'm giving them a personality, somebody that I'm goofy regardless if I'm talking to you.",
          "start_time": 121.2,
          "end_time": 128.5
        },
        {
          "text": "I'm always asking you how you're doing, how's your day, how's your experience, are you okay?",
          "start_time": 128.5,
          "end_time": 136.2
        },
        {
          "text": "They like that. Regardless of the app, they don't have that type of satisfaction,",
          "start_time": 136.2,
          "end_time": 142.3
        },
        {
          "text": "but when they speak to me they know that, you know, I'm here to provide to them a good customer service.",
          "start_time": 142.3,
          "end_time": 147.2
        },
        {
          "text": "Yeah, I can bring value to what customer already has researched, they have done their homework,",
          "start_time": 147.2,
          "end_time": 154.5
        },
        {
          "text": "but at the same time we as an experienced travel agents and we know our job so we can easily communicate with customers",
          "start_time": 154.5,
          "end_time": 162.1
        },
        {
          "text": "and of course we can understand what they're talking about and what they want and we are there to service what their needs are.",
          "start_time": 162.1,
          "end_time": 167.5
        },
        {
          "text": "And that's our job to stay calm, focused and bring instant resolution.",
          "start_time": 167.5,
          "end_time": 172.5
        }
      ]
    },
    "b83cb94e3314": {
      "id": "b83cb94e3314",
      "path": "assets/normalized_videos/Pluralsight_Navan_Customer_Success_Story.mp4",
      "filename": "Pluralsight_Navan_Customer_Success_Story.mp4",
      "duration": 68.220227,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 9873834,
      "transcript_segments": [
        {
          "text": "Navan. What our customers are saying.",
          "start_time": 0.0,
          "end_time": 3.0
        },
        {
          "text": "I'm Meg Morrill and I basically just help with all things travel and expense.",
          "start_time": 3.0,
          "end_time": 7.0
        },
        {
          "text": "Pluralsight is headquartered in beautiful Draper, Utah. It is a tech workforce development company.",
          "start_time": 7.0,
          "end_time": 13.0
        },
        {
          "text": "Part of what we were looking for is to kind of consolidate, have a one-stop-shop solution that was available for everybody.",
          "start_time": 13.0,
          "end_time": 20.0
        },
        {
          "text": "We wanted all of our team members to have equal access.",
          "start_time": 20.0,
          "end_time": 23.0
        },
        {
          "text": "Having that disjointed solution and like workarounds, it was very much a lot of workarounds.",
          "start_time": 23.0,
          "end_time": 29.0
        },
        {
          "text": "Especially around reporting, it was very difficult to get the data from the different sources to patch it together somehow and to present it in a way that made sense.",
          "start_time": 29.0,
          "end_time": 40.0
        },
        {
          "text": "Because our team members and our travelers are our number one priority, we were looking for a tool that also felt the same way.",
          "start_time": 40.0,
          "end_time": 47.0
        },
        {
          "text": "And it was clear that with Navan, that was the case. Like, the tool was built around the user; it wasn't about the tool itself.",
          "start_time": 47.0,
          "end_time": 54.0
        },
        {
          "text": "It felt like with Navan you were already putting the traveler first, and it was only going to get better and bigger as we went along.",
          "start_time": 54.0,
          "end_time": 102.0
        },
        {
          "text": "Learn more at: www.navan.com",
          "start_time": 102.0,
          "end_time": 108.0
        }
      ]
    },
    "cf532f91757f": {
      "id": "cf532f91757f",
      "path": "assets/normalized_videos/Spend Control - Reconcile.webm",
      "filename": "Spend Control - Reconcile.webm",
      "duration": 7.778,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 155162,
      "transcript_segments": []
    },
    "08d243e2f1ad": {
      "id": "08d243e2f1ad",
      "path": "assets/normalized_videos/How_to_order_your_Navan_corporate_card.mp4",
      "filename": "How_to_order_your_Navan_corporate_card.mp4",
      "duration": 54.775873,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 3541122,
      "transcript_segments": [
        {
          "text": "Hi, my name's Doug. I'm an account manager here at Navan and today we're going to run through ordering your physical Navan card through the platform.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "If you're eligible for a card, when you log in, you'll see the ability to order Navan card through the portal and you'll just need to input some basic information about yourself to ensure we know where to send the card and we have all your details correct.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Make sure you're matching your date of birth to what's in your government ID or your passport as well as your contact information such as your mobile phone.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "In terms of addresses, you can either ship to a custom address which could be your home or actually one that's linked to a company office address as well.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Once you've done this, you just simply click Order card and then when it arrives, you click the button to activate your card and you're good to go and start spending.",
          "start_time": 0.0,
          "end_time": 0.0
        }
      ]
    },
    "eed41d33d6c6": {
      "id": "eed41d33d6c6",
      "path": "assets/normalized_videos/Centralized Spend.webm",
      "filename": "Centralized Spend.webm",
      "duration": 14.0,
      "resolution": [
        1466,
        1158
      ],
      "fps": 25.0,
      "file_size": 107854,
      "transcript_segments": []
    },
    "8a810d63ec56": {
      "id": "8a810d63ec56",
      "path": "assets/normalized_videos/Uber_For_Business_Integration_with_Navan_Expense.mp4",
      "filename": "Uber_For_Business_Integration_with_Navan_Expense.mp4",
      "duration": 33.274195,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 3591970,
      "transcript_segments": [
        {
          "text": "Expensing Uber rides and meals just got easier.",
          "start_time": 0.0,
          "end_time": 4.5
        },
        {
          "text": "Connect your Uber for Business account to Navan.",
          "start_time": 4.5,
          "end_time": 10.0
        },
        {
          "text": "Uber receipts are automatically attached to each expense.",
          "start_time": 16.0,
          "end_time": 20.0
        },
        {
          "text": "No missing receipts. No manual uploads.",
          "start_time": 20.0,
          "end_time": 23.0
        },
        {
          "text": "Now with Navan and Uber for Business, expense reports drive themselves.",
          "start_time": 23.0,
          "end_time": 26.0
        },
        {
          "text": "Transform the way you travel.",
          "start_time": 26.0,
          "end_time": 33.0
        }
      ]
    },
    "8836740633e1": {
      "id": "8836740633e1",
      "path": "assets/normalized_videos/Booking-step2-Book.webm",
      "filename": "Booking-step2-Book.webm",
      "duration": 11.297,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 252907,
      "transcript_segments": []
    },
    "b56fa82d023d": {
      "id": "b56fa82d023d",
      "path": "assets/normalized_videos/How_Canva_Manages_Global_Travel_and_Spend_with_Navan.mp4",
      "filename": "How_Canva_Manages_Global_Travel_and_Spend_with_Navan.mp4",
      "duration": 163.68,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 43536290,
      "transcript_segments": [
        {
          "text": "Navan is the travel booking platform that all of our employees as well as our guests use to book travel",
          "start_time": 0.0,
          "end_time": 8.0
        },
        {
          "text": "while ensuring that we have the right controls in place for those travel bookings.",
          "start_time": 8.0,
          "end_time": 13.0
        },
        {
          "text": "Connection and collaboration are really important to us at Canva, it's a big part of our culture,",
          "start_time": 13.0,
          "end_time": 20.0
        },
        {
          "text": "and Navan certainly helps us to facilitate that in a way that's very easy, but also ensures that we are controlling costs.",
          "start_time": 20.0,
          "end_time": 26.5
        },
        {
          "text": "Canva is a global company that's really focused on empowering the world to design.",
          "start_time": 27.0,
          "end_time": 32.0
        },
        {
          "text": "We provide the technology that lets people build any sort of content that they want across any platform.",
          "start_time": 32.0,
          "end_time": 38.0
        },
        {
          "text": "Navan is really focused on the user experience and so for our users",
          "start_time": 38.0,
          "end_time": 43.0
        },
        {
          "text": "there's a lot of simplicity in how they engage with the travel experience.",
          "start_time": 43.0,
          "end_time": 48.0
        },
        {
          "text": "Previously before Navan, people weren't able to really self-serve their own travel needs.",
          "start_time": 48.0,
          "end_time": 55.0
        },
        {
          "text": "But we found with Navan that it's really easy to make sure that if people need to make changes or update their bookings,",
          "start_time": 55.0,
          "end_time": 62.0
        },
        {
          "text": "they're able to do that themselves and it doesn't fall on one person on our internal teams to handle.",
          "start_time": 62.0,
          "end_time": 69.0
        },
        {
          "text": "So we really love how flexible it is.",
          "start_time": 69.0,
          "end_time": 71.0
        },
        {
          "text": "Navan for me is just an absolute godsend. It's easy, I can do things even from my phone",
          "start_time": 109.0,
          "end_time": 113.5
        },
        {
          "text": "which is great as an assistant when you're always running around doing things.",
          "start_time": 113.5,
          "end_time": 118.0
        },
        {
          "text": "I just think that it's just really been a game changer in terms of being able to do everything in the one platform.",
          "start_time": 118.0,
          "end_time": 124.0
        },
        {
          "text": "Navan helps Canva save on travel through a number of different policy settings and functionality in the tool itself.",
          "start_time": 124.0,
          "end_time": 131.0
        },
        {
          "text": "So having the ability to set those dynamic benchmarks I think is one of the primary ways",
          "start_time": 131.0,
          "end_time": 136.0
        },
        {
          "text": "that we ensure people have got a very clear understanding of what's within policy and what's outside of policy.",
          "start_time": 136.0,
          "end_time": 142.0
        },
        {
          "text": "And I think the rewards also complement those settings really well, where people are incentivized",
          "start_time": 142.0,
          "end_time": 148.0
        },
        {
          "text": "to help save money on their travel bookings with Navan reward points.",
          "start_time": 148.0,
          "end_time": 152.0
        },
        {
          "text": "The most beneficial reports that I use pretty frequently within Navan is just understanding who's traveling where, when.",
          "start_time": 152.5,
          "end_time": 158.5
        },
        {
          "text": "I find that real-time insight into what's going on across the company gives us the data that we need",
          "start_time": 158.5,
          "end_time": 165.0
        },
        {
          "text": "to make sure we have the right services where people might be. Navan gives us the data to know",
          "start_time": 165.0,
          "end_time": 172.0
        },
        {
          "text": "not just where people have gone but where they're going and so we can actually make sure that we are putting in place",
          "start_time": 172.0,
          "end_time": 179.0
        },
        {
          "text": "services and partner services that will support those needs.",
          "start_time": 179.0,
          "end_time": 184.0
        },
        {
          "text": "The way I'd describe Navan to someone who hasn't used it before is that it's quite simple and intuitive",
          "start_time": 185.0,
          "end_time": 190.0
        },
        {
          "text": "for the travel booker, but quite powerful for the admins in terms of what they can customize and how they can configure it to their needs.",
          "start_time": 190.0,
          "end_time": 197.0
        }
      ]
    },
    "4b604f7ea529": {
      "id": "4b604f7ea529",
      "path": "assets/normalized_videos/Advanced Analytics.webm",
      "filename": "Advanced Analytics.webm",
      "duration": 23.667,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 1348221,
      "transcript_segments": [
        {
          "text": "Advanced Analytics.",
          "start_time": 0.0,
          "end_time": 1.0
        },
        {
          "text": "Travel intelligence... that's actually intelligent.",
          "start_time": 1.0,
          "end_time": 3.0
        },
        {
          "text": "Track spend.",
          "start_time": 3.0,
          "end_time": 5.0
        },
        {
          "text": "Spot trends.",
          "start_time": 5.0,
          "end_time": 7.0
        },
        {
          "text": "Uncover more.",
          "start_time": 7.0,
          "end_time": 9.0
        },
        {
          "text": "Stay one step ahead. Out of policy spend has hit your threshold.",
          "start_time": 9.0,
          "end_time": 12.0
        },
        {
          "text": "Your data — brought to life.",
          "start_time": 12.0,
          "end_time": 17.0
        },
        {
          "text": "Turn travel data into your success story. Navan.",
          "start_time": 17.0,
          "end_time": 23.0
        }
      ]
    },
    "e09d885656ec": {
      "id": "e09d885656ec",
      "path": "assets/normalized_videos/How_Navan_revolutionised_business_travel_at_HelloFresh.mp4",
      "filename": "How_Navan_revolutionised_business_travel_at_HelloFresh.mp4",
      "duration": 191.703946,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 79236101,
      "transcript_segments": [
        {
          "text": "As a global head of mobility and travel, Navan gives me all the solutions I need",
          "start_time": 0.0,
          "end_time": 5.4
        },
        {
          "text": "to manage our travel programme efficiently in a way that is customer-centric and data-driven,",
          "start_time": 5.4,
          "end_time": 10.6
        },
        {
          "text": "which suits our DNA as a company.",
          "start_time": 10.6,
          "end_time": 14.1
        },
        {
          "text": "HelloFresh changes the way people eat forever.",
          "start_time": 21.0,
          "end_time": 23.9
        },
        {
          "text": "This is our mission and we are revolutionising the food supply chain",
          "start_time": 23.9,
          "end_time": 28.5
        },
        {
          "text": "with ready-to-eat meals, meal kits, pet food, and meat products.",
          "start_time": 28.5,
          "end_time": 33.3
        },
        {
          "text": "We are active in 18 markets.",
          "start_time": 33.3,
          "end_time": 34.8
        },
        {
          "text": "Our headquarters is here in Germany, in Berlin.",
          "start_time": 34.8,
          "end_time": 38.4
        },
        {
          "text": "Before onboarding Navan, we had a very manual travel booking system.",
          "start_time": 40.5,
          "end_time": 44.9
        },
        {
          "text": "We had a travel manager who was basically doing the bookings for the traveller.",
          "start_time": 44.9,
          "end_time": 48.9
        },
        {
          "text": "Before Navan, travel management was a chaotic situation.",
          "start_time": 48.9,
          "end_time": 52.8
        },
        {
          "text": "All bookings were done manually and every invoice was chased manually.",
          "start_time": 52.8,
          "end_time": 57.8
        },
        {
          "text": "It gave a very unpleasant employee and travel experience.",
          "start_time": 57.8,
          "end_time": 102.2
        },
        {
          "text": "Navan completely revolutionised travel at HelloFresh.",
          "start_time": 102.2,
          "end_time": 105.7
        },
        {
          "text": "For us as the travel department, we have to",
          "start_time": 105.7,
          "end_time": 109.1
        },
        {
          "text": "deal a lot less with operational steps such as chasing invoices and troubleshooting.",
          "start_time": 109.1,
          "end_time": 114.7
        },
        {
          "text": "Navan gives me the perfect solution for the travel department.",
          "start_time": 114.7,
          "end_time": 119.2
        },
        {
          "text": "All the insights that I need, the booking options.",
          "start_time": 119.2,
          "end_time": 122.3
        },
        {
          "text": "Navan solved my problem with travel.",
          "start_time": 122.3,
          "end_time": 124.6
        },
        {
          "text": "Having an integration between Workday and Navan for us is really one of the most important points of having Navan,",
          "start_time": 124.6,
          "end_time": 129.8
        },
        {
          "text": "because having employees added to the tool from one day to the other and directed to the right cost centre, to the right entity, to the right approver.",
          "start_time": 129.8,
          "end_time": 137.4
        },
        {
          "text": "If that had to be done manually, so many human errors could happen.",
          "start_time": 137.4,
          "end_time": 145.4
        },
        {
          "text": "Before Navan, we did not have all the data in one place.",
          "start_time": 145.4,
          "end_time": 150.3
        },
        {
          "text": "So we couldn't analyse our employees' behaviour or our travellers' behaviour.",
          "start_time": 150.3,
          "end_time": 155.0
        },
        {
          "text": "in a way that helps us make meaningful learnings and reduce our travel costs or increase the experience.",
          "start_time": 155.0,
          "end_time": 160.7
        },
        {
          "text": "We did not know where the bottlenecks were.",
          "start_time": 160.7,
          "end_time": 163.7
        },
        {
          "text": "Navan's reporting allows us to know how many people are travelling,",
          "start_time": 163.7,
          "end_time": 168.1
        },
        {
          "text": "where are they travelling to, what are they spending the most money on,",
          "start_time": 168.1,
          "end_time": 172.6
        },
        {
          "text": "where do we have savings potential.",
          "start_time": 172.6,
          "end_time": 174.5
        },
        {
          "text": "So the very good reporting that we have is really one of the best things for us as a data-driven company",
          "start_time": 174.5,
          "end_time": 179.7
        },
        {
          "text": "because it really allows us to know what's going on.",
          "start_time": 179.7,
          "end_time": 182.2
        },
        {
          "text": "I can pull a report so easily.",
          "start_time": 182.2,
          "end_time": 184.8
        },
        {
          "text": "And the business is so grateful when I send them a report in 10 minutes.",
          "start_time": 184.8,
          "end_time": 189.9
        },
        {
          "text": "They get so much value out of it.",
          "start_time": 189.9,
          "end_time": 192.5
        },
        {
          "text": "And for me, it's so easy to do it.",
          "start_time": 192.5,
          "end_time": 194.5
        },
        {
          "text": "In my day-to-day tasks, Navan had a huge impact.",
          "start_time": 194.5,
          "end_time": 198.8
        },
        {
          "text": "I am personally grateful for Navan as a travel manager.",
          "start_time": 198.8,
          "end_time": 202.9
        },
        {
          "text": "And I got the time now to enjoy my work and to think of strategies.",
          "start_time": 202.9,
          "end_time": 207.2
        },
        {
          "text": "I can think of what the business needs. And this is key for success.",
          "start_time": 207.2,
          "end_time": 213.1
        },
        {
          "text": "Navan is customer-centric, is efficient, and is absolutely transparent.",
          "start_time": 213.1,
          "end_time": 221.0
        }
      ]
    },
    "2b159a6238e1": {
      "id": "2b159a6238e1",
      "path": "assets/normalized_videos/Introducing_Navans_Advanced_Analytics.mp4",
      "filename": "Introducing_Navans_Advanced_Analytics.mp4",
      "duration": 23.684354,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 2880248,
      "transcript_segments": [
        {
          "text": "Advanced Analytics. Travel intelligence... that's actually intelligent.",
          "start_time": 0.0,
          "end_time": 3.0
        },
        {
          "text": "Track spend.",
          "start_time": 3.0,
          "end_time": 5.0
        },
        {
          "text": "Spot trends.",
          "start_time": 5.0,
          "end_time": 7.0
        },
        {
          "text": "Uncover more.",
          "start_time": 7.0,
          "end_time": 10.0
        },
        {
          "text": "Stay one step ahead.",
          "start_time": 10.0,
          "end_time": 12.0
        },
        {
          "text": "Your data — brought to life.",
          "start_time": 12.0,
          "end_time": 17.0
        },
        {
          "text": "Turn travel data into your success story. Navan.",
          "start_time": 17.0,
          "end_time": 23.0
        }
      ]
    },
    "ba61062423e1": {
      "id": "ba61062423e1",
      "path": "assets/normalized_videos/Introducing_Navan_Cognition_our_new_production-grade_agentic_AI_platform.mp4",
      "filename": "Introducing_Navan_Cognition_our_new_production-grade_agentic_AI_platform.mp4",
      "duration": 46.09161,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 5005351,
      "transcript_segments": [
        {
          "text": "I'm Ilan, CTO and co-founder of Navan.",
          "start_time": 0.0,
          "end_time": 3.0
        },
        {
          "text": "Navan Cognition is an AI platform for building intelligent, reliable and trustworthy AI agent teams.",
          "start_time": 3.0,
          "end_time": 8.0
        },
        {
          "text": "Already at Navan, we've put Navan Cognition to use by building our virtual travel agent, Ava,",
          "start_time": 8.0,
          "end_time": 14.0
        },
        {
          "text": "who handles thousands of daily interactions with customers,",
          "start_time": 14.0,
          "end_time": 20.0
        },
        {
          "text": "prioritizing zero critical errors with unmatched customer satisfaction.",
          "start_time": 20.0,
          "end_time": 25.0
        },
        {
          "text": "Now it's your turn.",
          "start_time": 25.0,
          "end_time": 28.0
        },
        {
          "text": "The future isn't just smarter AI tools, it's intelligent, reliable AI teams.",
          "start_time": 28.0,
          "end_time": 33.0
        },
        {
          "text": "Ready to build?",
          "start_time": 33.0,
          "end_time": 36.0
        },
        {
          "text": "Sign up for early access at navancognition.ai.",
          "start_time": 36.0,
          "end_time": 46.0
        }
      ]
    },
    "5d1baf3a0093": {
      "id": "5d1baf3a0093",
      "path": "assets/normalized_videos/PayFit_makes_13_savings_on_hotel_and_flight_spend_with_Navan.mp4",
      "filename": "PayFit_makes_13_savings_on_hotel_and_flight_spend_with_Navan.mp4",
      "duration": 196.580136,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 55781466,
      "transcript_segments": [
        {
          "text": "My name is Julien Lachowski and I'm FP&A Director at PayFit.",
          "start_time": 8.0,
          "end_time": 13.0
        },
        {
          "text": "Before Navan, we used a solution which wasn't user-friendly and required a lot of back-office work.",
          "start_time": 21.0,
          "end_time": 29.0
        },
        {
          "text": "We chose Navan for its broad global inventory, particularly in the different countries we travel to, and also for the user experience.",
          "start_time": 29.0,
          "end_time": 37.0
        },
        {
          "text": "The ease of using the platform is great for us. The so-called 'UX' is what made us choose Navan's solution in the end.",
          "start_time": 38.0,
          "end_time": 49.0
        },
        {
          "text": "We can access the same travel inventory as on consumer travel platforms.",
          "start_time": 50.0,
          "end_time": 56.0
        },
        {
          "text": "When traveling, we want to avoid unpleasant surprises for admins as well as for travelers, and the Navan platform helps us achieve this.",
          "start_time": 56.0,
          "end_time": 64.0
        },
        {
          "text": "Being able to set up dynamic policies on Navan, as a finance manager, is great.",
          "start_time": 108.0,
          "end_time": 114.0
        },
        {
          "text": "The dynamic policy feature considers the date and median price of hotels in different cities and uses this information to automatically adjust the price at which our employees can book their hotel rooms.",
          "start_time": 114.0,
          "end_time": 130.0
        },
        {
          "text": "This creates opportunities in terms of cost optimization that are game-changing for us in the finance team.",
          "start_time": 130.0,
          "end_time": 138.0
        },
        {
          "text": "Navan's implementation has also been an opportunity for us to review our internal travel policies and our 'green' travel policies.",
          "start_time": 138.0,
          "end_time": 146.0
        },
        {
          "text": "Typically, we set up rules to encourage the use of trains instead of planes for certain types of trips, for example between an employee's home and the office location, or short trips.",
          "start_time": 147.0,
          "end_time": 161.0
        },
        {
          "text": "Thanks to the reporting available on the Navan platform, which allows us to calculate each trip's carbon emissions, we can accurately measure our carbon emissions...",
          "start_time": 202.0,
          "end_time": 213.0
        },
        {
          "text": "and we know, thanks to the Navan platform, how we can reduce the carbon footprint of business travel at PayFit.",
          "start_time": 214.0,
          "end_time": 224.0
        },
        {
          "text": "The credit line provided by Navan, and the cash advance that goes with it, have really simplified our accounting processes.",
          "start_time": 225.0,
          "end_time": 234.0
        },
        {
          "text": "With our previous platform, we had to process and track countless transactions.",
          "start_time": 234.0,
          "end_time": 241.0
        },
        {
          "text": "Today, we receive one bill at the end of the month and we import it automatically into our ERP.",
          "start_time": 242.0,
          "end_time": 249.0
        },
        {
          "text": "It's true that since implementing Navan, we've saved a lot of time managing expenses and tracking the costs related to our employees' business trips.",
          "start_time": 249.0,
          "end_time": 259.0
        },
        {
          "text": "It helps me save a lot of time, and I'm now able to focus on other tasks with more added value in order to meet my objectives.",
          "start_time": 260.0,
          "end_time": 310.0
        }
      ]
    },
    "4915a487ce4b": {
      "id": "4915a487ce4b",
      "path": "assets/normalized_videos/How_to_Monetize_Gen_AI_at_Scale_Ilan_Twig_davos.mp4",
      "filename": "How_to_Monetize_Gen_AI_at_Scale_Ilan_Twig_davos.mp4",
      "duration": 123.855238,
      "resolution": [
        480,
        854
      ],
      "fps": 23.976023976023978,
      "file_size": 13088038,
      "transcript_segments": [
        {
          "text": "I'd like to invite on stage Mr. Ilan Twig, who is the CTO and co-founder of Navan.",
          "start_time": 14.5,
          "end_time": 19.5
        },
        {
          "text": "And certainly we at Reuters love to use Navan. So thank you for joining us.",
          "start_time": 19.5,
          "end_time": 24.0
        },
        {
          "text": "Navan has built a cognitive system where the LLMs supervise each other in a way that allows kind of the repeatability of actual credible responses.",
          "start_time": 24.1,
          "end_time": 30.5
        },
        {
          "text": "That are not intended to frustrate. Yes. Because the only way for me to trust an employee or to trust a bot is to know that it's always going to perform.",
          "start_time": 30.6,
          "end_time": 40.0
        },
        {
          "text": "That I can trust it all the time. No one would ever hire an employee that says 'I lied.' That's LLMs!",
          "start_time": 40.1,
          "end_time": 50.0
        },
        {
          "text": "The LLMs lie, and that's why you do not see them replacing humans yet.",
          "start_time": 50.1,
          "end_time": 58.0
        },
        {
          "text": "So how do we get from, then, that which obviously isn't usable for the purpose of a travel agent or otherwise, to something that is?",
          "start_time": 58.1,
          "end_time": 107.0
        },
        {
          "text": "I'm getting a call from one of our customer success managers, and I asked her, explain to me what was it that you miss so much in this bot?",
          "start_time": 107.1,
          "end_time": 115.0
        },
        {
          "text": "She said, your bot is never wrong, and when it doesn't know, it takes me to an agent.",
          "start_time": 115.1,
          "end_time": 127.0
        },
        {
          "text": "In a way, what we ended up building is something that is, I call it Navan cognition. It's a highly functioning cognitive system.",
          "start_time": 127.1,
          "end_time": 136.0
        },
        {
          "text": "LLMs are not. It's a framework that ensures that these things can think and mimic the human behavior.",
          "start_time": 136.1,
          "end_time": 143.0
        },
        {
          "text": "Today it carries... we crossed the 7,000 checks per day for the first time.",
          "start_time": 143.1,
          "end_time": 152.0
        },
        {
          "text": "Less than 40% of them get to the live agent, so it actually solves close to 60%.",
          "start_time": 152.1,
          "end_time": 160.0
        }
      ]
    },
    "5ad28dcc3898": {
      "id": "5ad28dcc3898",
      "path": "assets/normalized_videos/Meet_Navan_the_Industrys_Best_Travel_and_Expense_Solution.mp4",
      "filename": "Meet_Navan_the_Industrys_Best_Travel_and_Expense_Solution.mp4",
      "duration": 112.70966,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 30489769,
      "transcript_segments": [
        {
          "text": "Business travel is a lot. Endless searches, confusing policies, being trapped on hold.",
          "start_time": 0.0,
          "end_time": 8.0
        },
        {
          "text": "Fees, receipts, expense reports. Travel shouldn't be a liability. It should be an opportunity.",
          "start_time": 8.0,
          "end_time": 14.0
        },
        {
          "text": "Enter Navan, the industry's best travel and expense solution.",
          "start_time": 14.0,
          "end_time": 18.0
        },
        {
          "text": "Navan has a singular mission: make travel easy for every frequent traveler.",
          "start_time": 18.0,
          "end_time": 24.0
        },
        {
          "text": "The magic begins with booking across flights, hotels, trains, and rental cars. Navan's custom-built platform curates an unparalleled global travel inventory.",
          "start_time": 24.0,
          "end_time": 34.0
        },
        {
          "text": "Then, proprietary AI backed by a decade of data and fine-tuning serves up personalized results based on preferences, prior trips, loyalty programs, and more.",
          "start_time": 34.0,
          "end_time": 43.0
        },
        {
          "text": "With company policies built-in, so businesses can save money, track spend, and support their teams.",
          "start_time": 43.0,
          "end_time": 50.0
        },
        {
          "text": "Navan also rewards smart spending. When travelers choose lower-cost hotels, their company gets the savings, and they get credits to use towards a dream vacation, or to extend a business trip with just a click.",
          "start_time": 50.0,
          "end_time": 62.0
        },
        {
          "text": "Making changes? No problem. Add luggage, swap seats, or cancel. In the office or on the move.",
          "start_time": 62.0,
          "end_time": 70.0
        },
        {
          "text": "Need help? Whether you call our world-class agents or chat with our multilingual AI assistant, Navan is there for you 24/7.",
          "start_time": 70.0,
          "end_time": 78.0
        },
        {
          "text": "Travelers can track their spend against company policies in real-time and kick time-consuming expense reports to the curb. Navan automatically captures and categorizes transactions right away. Tap, spend, done.",
          "start_time": 78.0,
          "end_time": 92.0
        },
        {
          "text": "Finance and accounting teams can proactively manage spend and leverage actionable insights for smarter budgeting, saving time and money.",
          "start_time": 92.0,
          "end_time": 101.0
        },
        {
          "text": "When Navan is in your reach, the whole world is within your grasp. Navan. Making travel easy for every frequent traveler.",
          "start_time": 101.0,
          "end_time": 111.0
        }
      ]
    },
    "30c16c8cd58c": {
      "id": "30c16c8cd58c",
      "path": "assets/normalized_videos/Booking-step4-Track.webm",
      "filename": "Booking-step4-Track.webm",
      "duration": 8.588,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 180757,
      "transcript_segments": []
    },
    "446ede562687": {
      "id": "446ede562687",
      "path": "assets/normalized_videos/8x8_Saves_33_on_Hotels_Pays_100_of_Expenses_with_Navan.mp4",
      "filename": "8x8_Saves_33_on_Hotels_Pays_100_of_Expenses_with_Navan.mp4",
      "duration": 205.832667,
      "resolution": [
        1920,
        1080
      ],
      "fps": 24.0,
      "file_size": 25797587,
      "transcript_segments": [
        {
          "text": "So we implemented Navan just over four months ago. We have about a million dollars in spend already,",
          "start_time": 0.0,
          "end_time": 6.5
        },
        {
          "text": "but that is to say that we've saved $65,000 on air travel",
          "start_time": 6.5,
          "end_time": 11.5
        },
        {
          "text": "and over $100,000 on hotel stays to date.",
          "start_time": 11.5,
          "end_time": 17.5
        },
        {
          "text": "So 8x8 is a cloud-based communications company here in the Silicon Valley.",
          "start_time": 17.5,
          "end_time": 23.0
        },
        {
          "text": "We provide communications platforms as a service globally.",
          "start_time": 23.0,
          "end_time": 27.0
        },
        {
          "text": "As a process improvement manager and global T&E administrator here at 8x8, I oversee 8x8's",
          "start_time": 27.0,
          "end_time": 35.0
        },
        {
          "text": "travel booking and expense and reimbursement sides of things.",
          "start_time": 35.0,
          "end_time": 39.0
        },
        {
          "text": "So yeah, we had a few key requirements. One, we needed a global travel tool.",
          "start_time": 39.0,
          "end_time": 44.0
        },
        {
          "text": "We no longer wanted to use one that required us to have two separate systems and then didn't cover all our locations worldwide.",
          "start_time": 44.0,
          "end_time": 51.0
        },
        {
          "text": "We needed an expense tool that would circumvent our payroll process.",
          "start_time": 51.0,
          "end_time": 56.0
        },
        {
          "text": "We were processing thousands of expense reports every month, and that was just taking so much time from all the other work that payroll has to do.",
          "start_time": 56.0,
          "end_time": 64.0
        },
        {
          "text": "And we needed it to integrate with all the systems that we had.",
          "start_time": 64.0,
          "end_time": 69.5
        },
        {
          "text": "So once we decided on Navan, we had a very ambitious onboarding timeline.",
          "start_time": 69.5,
          "end_time": 74.0
        },
        {
          "text": "We were able to do it in three months instead of six months.",
          "start_time": 74.0,
          "end_time": 79.5
        },
        {
          "text": "We were a little apprehensive once we were starting the onboarding process because it was going so quickly and so smoothly.",
          "start_time": 79.5,
          "end_time": 85.0
        },
        {
          "text": "We wondered here at 8x8 what we were missing, what was going to be the other shoe to drop, what did we leave out, what did we forget.",
          "start_time": 85.0,
          "end_time": 91.5
        },
        {
          "text": "And it turns out Navan hadn't forgotten anything. It was just that easy and that intuitive.",
          "start_time": 91.5,
          "end_time": 100.0
        },
        {
          "text": "We're always extremely worried about compliance and employees being and staying within policy.",
          "start_time": 100.0,
          "end_time": 105.0
        },
        {
          "text": "Our biggest concern was employees might not know that they are within policy or not.",
          "start_time": 105.0,
          "end_time": 111.0
        },
        {
          "text": "We didn't have that real-time feedback when they would submit an expense, and it gave you the heads up of this expense line item will be flagged,",
          "start_time": 111.0,
          "end_time": 118.0
        },
        {
          "text": "and you have that inside Navan. Navan's going to tell you as you're making your booking if you're within policy or not.",
          "start_time": 118.0,
          "end_time": 122.5
        },
        {
          "text": "For instance, here at 8x8, we have a policy that says you need to book travel outside of 14 days.",
          "start_time": 122.5,
          "end_time": 128.5
        },
        {
          "text": "You know as soon as you select your dates within that 14-day window that you're going to be flagged for being out of policy.",
          "start_time": 128.5,
          "end_time": 134.5
        },
        {
          "text": "If a hotel room or a flight is out of policy, you're going to be notified before you even make that selection.",
          "start_time": 134.5,
          "end_time": 142.0
        },
        {
          "text": "That was something that we didn't have with our last travel management solution.",
          "start_time": 142.0,
          "end_time": 147.0
        },
        {
          "text": "It's been super easy for our finance team. We didn't have to take on any more employees,",
          "start_time": 147.0,
          "end_time": 152.0
        },
        {
          "text": "and more importantly, we didn't have to lose anybody.",
          "start_time": 152.0,
          "end_time": 157.0
        },
        {
          "text": "But the workload that we did have here in the finance org, that wasn't built to be a travel management team,",
          "start_time": 157.0,
          "end_time": 165.0
        },
        {
          "text": "no longer has to deal with all those travel management expense responsibilities that they did before.",
          "start_time": 165.0,
          "end_time": 171.0
        },
        {
          "text": "Employee feedback has been largely positive, and that's reflected in our Net Promoter Score of +52.",
          "start_time": 171.0,
          "end_time": 176.0
        },
        {
          "text": "We have a CSAT score of 4.5 out of 5.",
          "start_time": 176.0,
          "end_time": 181.0
        },
        {
          "text": "So I would absolutely recommend Navan to a colleague or someone in the same position I am.",
          "start_time": 181.0,
          "end_time": 186.0
        },
        {
          "text": "I would absolutely recommend that they take a look at Navan as their travel management solution going forward",
          "start_time": 186.0,
          "end_time": 194.0
        },
        {
          "text": "because it's a global solution, it's easy to integrate, it's a one-stop shop for booking expense reimbursement,",
          "start_time": 194.0,
          "end_time": 199.0
        },
        {
          "text": "and the feedback has been overwhelmingly positive.",
          "start_time": 199.0,
          "end_time": 204.0
        }
      ]
    },
    "2798fb33376c": {
      "id": "2798fb33376c",
      "path": "assets/normalized_videos/How_to_submit_a_manual_expense.mp4",
      "filename": "How_to_submit_a_manual_expense.mp4",
      "duration": 54.497234,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 4783126,
      "transcript_segments": [
        {
          "text": "Intro and title card: How to submit a manual expense.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Hi, my name is Doug, I'm an account manager here at Navan, and today we're going to run through submitting a manual expense through the Navan app.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "On the expense tab of the app, you'll see the option to add new transaction at the bottom right.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "When we click this, we'll have the option to scan a receipt, type in details, log distance driven, or import from personal card.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "I'm going to scan a receipt where I've purchased a coffee here. You see that I've taken a photo and I'm saying I'm going to use this photo here.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "In this time, we're scanning the receipt for all the relevant details, including merchant, tax, pricing, whatever it might be.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "And we can double check the details in here. You'll see that we have the merchant, the expense type, and we can also track if we're on a trip or not.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Once we're ready, we can submit this and it goes to the admin for approval.",
          "start_time": 0.0,
          "end_time": 0.0
        }
      ]
    },
    "2da3154bb300": {
      "id": "2da3154bb300",
      "path": "assets/normalized_videos/Ziff_Davis_Centralized_Global_Spend_and_Saves_21_with_Navan.mp4",
      "filename": "Ziff_Davis_Centralized_Global_Spend_and_Saves_21_with_Navan.mp4",
      "duration": 153.78576,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 33291286,
      "transcript_segments": [
        {
          "text": "Ziff Davis is a media company. We own many, many brands all over the spectrum within health, wellness, tech, shopping, and in the video gaming industry as well.",
          "start_time": 0.0,
          "end_time": 8.5
        },
        {
          "text": "Our corporate headquarters are here in New York City. However, we have employees all over the world.",
          "start_time": 8.5,
          "end_time": 14.5
        },
        {
          "text": "Navan allows us to have all of these employees book travel to wherever they need to visit all over the world seamlessly,",
          "start_time": 14.5,
          "end_time": 22.0
        },
        {
          "text": "and for us to have the visibility to see where they are and that they're safe and can get the assistance that they need anytime.",
          "start_time": 22.0,
          "end_time": 30.0
        },
        {
          "text": "Prior to Navan, we did not have any sort of centralized booking or applications for the employees to use.",
          "start_time": 30.0,
          "end_time": 38.0
        },
        {
          "text": "But the rest of the company was booking on their own and then submitting for reimbursement.",
          "start_time": 38.0,
          "end_time": 42.0
        },
        {
          "text": "Well, booking outside on their own, there was no visibility where employees were and when they were going places.",
          "start_time": 42.0,
          "end_time": 48.0
        },
        {
          "text": "One of our divisions was using a booking tool, but it was a very small part of the company that was doing it,",
          "start_time": 48.0,
          "end_time": 56.0
        },
        {
          "text": "and we wanted the entire company to use one uniform solution.",
          "start_time": 56.0,
          "end_time": 100.0
        },
        {
          "text": "We also wanted to find a way to centralize all of the costs and have reporting and visibility.",
          "start_time": 100.0,
          "end_time": 107.0
        },
        {
          "text": "When we were comparing the different options that were on the market, we found that Navan seemed to have more options that could be well-utilized at our company.",
          "start_time": 107.0,
          "end_time": 119.0
        },
        {
          "text": "Once we committed to Navan, our implementation went very smooth. It was probably about a two-week process. We had great working sessions with our account manager, Aryan.",
          "start_time": 119.0,
          "end_time": 132.0
        },
        {
          "text": "We have definitely saved in our travel spend. We have been able to budget better with our group travel. We've been able to invite guests and reduce reimbursement to outsiders.",
          "start_time": 132.0,
          "end_time": 146.0
        },
        {
          "text": "We have also been able to track and reconcile our credit card spend on travel much easier, and we've reduced the amount of work on our accounts payable team.",
          "start_time": 146.0,
          "end_time": 162.0
        },
        {
          "text": "by not having all of these expenses be reimbursed and be centralized in one place, especially on a single card.",
          "start_time": 162.0,
          "end_time": 202.0
        },
        {
          "text": "Since implementing Navan, we've saved 21% in travel spend, and we attribute this to the controls we've built in to keep employees aligned in our policy.",
          "start_time": 202.0,
          "end_time": 211.0
        },
        {
          "text": "Navan is always reimagining their solution, so we're excited to see where their new developments are going to take us with them.",
          "start_time": 211.0,
          "end_time": 221.0
        },
        {
          "text": "If a company wants to control travel spend, they need to control the spend at the time of a booking, not after when it's being reimbursed. And that's what we get from Navan.",
          "start_time": 221.0,
          "end_time": 233.0
        }
      ]
    },
    "794068026f34": {
      "id": "794068026f34",
      "path": "assets/normalized_videos/The_Travel_Platform_That_Makes_Every_Employee_Happy_Navan.mp4",
      "filename": "The_Travel_Platform_That_Makes_Every_Employee_Happy_Navan.mp4",
      "duration": 64.853333,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 25259315,
      "transcript_segments": [
        {
          "text": "This is you, trying to book a trip on your business travel platform. And this is me, using Navan.",
          "start_time": 0.0,
          "end_time": 6.0
        },
        {
          "text": "This is you, wondering why your company uses a platform that looks like it's from the 90s.",
          "start_time": 6.0,
          "end_time": 12.0
        },
        {
          "text": "This is me, seeing my itinerary in one beautiful screen on my computer. And now my phone. And now my watch. I even earned all my loyalty points.",
          "start_time": 12.0,
          "end_time": 21.0
        },
        {
          "text": "This is you, stuck on hold trying to change your flight. This is me on Navan, changing my flight on my own.",
          "start_time": 21.0,
          "end_time": 29.0
        },
        {
          "text": "Now I'm halfway to Austin, sipping my welcome drink while reclining in my favorite seat. Bon voyage.",
          "start_time": 29.0,
          "end_time": 38.0
        },
        {
          "text": "This is you, comforting your CFO after she sees last month's travel spend. And this is me, sending a selfie to our CFO who's happy that Navan is saving her company loads.",
          "start_time": 38.0,
          "end_time": 50.0
        },
        {
          "text": "This is your company finally switching to Navan. And this is me, welcoming you to the good life. Navan. Get started, it's free.",
          "start_time": 50.0,
          "end_time": 64.0
        }
      ]
    },
    "116432e32a1e": {
      "id": "116432e32a1e",
      "path": "assets/normalized_videos/How_ThoughtSpot_Uses_Navan_to_Drive_Savings_Employee_Satisfaction.mp4",
      "filename": "How_ThoughtSpot_Uses_Navan_to_Drive_Savings_Employee_Satisfaction.mp4",
      "duration": 148.689489,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 27646389,
      "transcript_segments": [
        {
          "text": "ThoughtSpot is a business analytics tool for the agentic AI age. So we develop tools that help businesses make decisions and act on information inside and outside of their business.",
          "start_time": 0.0,
          "end_time": 12.0
        },
        {
          "text": "We're located in Mountain View. We've been around 13 years and have over 900 employees globally.",
          "start_time": 12.0,
          "end_time": 19.5
        },
        {
          "text": "Before Navan, we really had a pretty chaotic system. As a startup company, so we pretty much had ad hoc systems. People used various Orbits or Expedia or personal travel agents to manage their travel.",
          "start_time": 19.5,
          "end_time": 31.0
        },
        {
          "text": "So I've been a CFO for about 15 years in Silicon Valley. For prior companies, I've not used Navan. We were using other legacy tools from large travel companies. They're really bulky. They're inefficient.",
          "start_time": 31.0,
          "end_time": 50.0
        },
        {
          "text": "Navan is the first travel platform that's provided the user experience that you expect from our users as a consumer-friendly, forward-looking product, but also the backend controls that are user-friendly to the accounting team.",
          "start_time": 50.0,
          "end_time": 67.0
        },
        {
          "text": "Visibility to the CFO so that you can help manage the travel and expense spend. This last year, I think we added about $50,000 in gross savings just on the airline options.",
          "start_time": 67.0,
          "end_time": 107.0
        },
        {
          "text": "We've improved our ability to control travel that's out of policy and we've looked at ways to improve our travelers' experiences with mobile applications.",
          "start_time": 107.0,
          "end_time": 123.0
        },
        {
          "text": "We've now further expanded that partnership and added a product that Navan's using as a partnership with ThoughtSpot inside the tool called Advanced Analytics.",
          "start_time": 123.0,
          "end_time": 151.0
        },
        {
          "text": "If we had to put the Navan relationship in three words, we'd look at seamless, collaborative, and aligned. It's a seamless experience because our employees through our back office team can see the whole portfolio of travel spend.",
          "start_time": 151.0,
          "end_time": 223.0
        }
      ]
    },
    "f5560e9c61ef": {
      "id": "f5560e9c61ef",
      "path": "assets/normalized_videos/Article_Student_Living_Cuts_Manual_Expense_Approvals_by_80_and_Saves_17_on_Travel.mp4",
      "filename": "Article_Student_Living_Cuts_Manual_Expense_Approvals_by_80_and_Saves_17_on_Travel.mp4",
      "duration": 197.601814,
      "resolution": [
        1920,
        676
      ],
      "fps": 24.0,
      "file_size": 18735265,
      "transcript_segments": [
        {
          "text": "With Navan, you can rely on the data extracts that you receive and know that you have 100% of the data.",
          "start_time": 0.0,
          "end_time": 6.8
        },
        {
          "text": "With our previous solution, it was genuinely like a whole finance and accounting department's undertaking to reconcile the data every month.",
          "start_time": 6.8,
          "end_time": 17.5
        },
        {
          "text": "Article Student Living is a vertically integrated student housing company with 500 employees and 50 assets throughout the United States.",
          "start_time": 17.5,
          "end_time": 27.6
        },
        {
          "text": "There were challenges with travel management specifically, so much so that people opted not even to use it.",
          "start_time": 27.6,
          "end_time": 33.6
        },
        {
          "text": "So they would use their JP Morgan corporate credit card and just book off the platform and use Expedia or some other online service.",
          "start_time": 33.6,
          "end_time": 43.1
        },
        {
          "text": "With Navan, everything being centralized makes it so much easier for the user.",
          "start_time": 43.1,
          "end_time": 50.1
        },
        {
          "text": "From our perspective on the finance and accounting group, we didn't have any sort of visualizations or dashboards, so we couldn't really get information out of the system without doing deep data dives, pivot tables, Excel work.",
          "start_time": 50.1,
          "end_time": 66.8
        },
        {
          "text": "Our previous solution had no integrations with any of our systems.",
          "start_time": 66.8,
          "end_time": 74.0
        },
        {
          "text": "It was essentially fully manual from people coding their expenses to approvals to recording things within our ledger.",
          "start_time": 74.0,
          "end_time": 84.4
        },
        {
          "text": "Because of our challenges, I knew that due to the size of our company, we needed something that would be a more comprehensive solution.",
          "start_time": 84.4,
          "end_time": 92.5
        },
        {
          "text": "We moved away from having disparate systems. With Navan, that was all lumped into one program.",
          "start_time": 92.5,
          "end_time": 100.2
        },
        {
          "text": "So it allows us to have quicker insights and actually put controls on the front end to prevent excessive spend or any sort of fraudulent activity.",
          "start_time": 100.2,
          "end_time": 110.1
        },
        {
          "text": "Our previous solution, 100% of transactions needed to be submitted, approved, and processed before they were actually included within our financial statements.",
          "start_time": 110.1,
          "end_time": 121.7
        },
        {
          "text": "So the fact that Navan is essentially automatically approving transactions because they're within our policy, that saves time for managers because they know that their team is spending within policy and they can really focus on either higher dollar spend amounts or things that might fall outside of the normal course of business.",
          "start_time": 121.7,
          "end_time": 139.7
        },
        {
          "text": "With our old T&E platform, our director of marketing would actually have to carve out four to six hours for one Saturday in a month to go through all the individual transactions for in-house ad spend.",
          "start_time": 139.7,
          "end_time": 154.5
        },
        {
          "text": "With Navan, because we're able to quickly set up the virtual P-cards and have individual funding accounts and pre-allocated GL codes, all of that Saturday coding work is a thing of the past.",
          "start_time": 154.5,
          "end_time": 170.1
        },
        {
          "text": "Moving from our old T&E system to Navan, we've saved 17% on travel.",
          "start_time": 170.1,
          "end_time": 178.1
        },
        {
          "text": "That's our biggest bucket of discretionary spend, so it was important for us to find a solution where we can monitor it effectively and ultimately save money.",
          "start_time": 178.1,
          "end_time": 186.2
        },
        {
          "text": "The fact that we have a 96% adoption rate with people using the travel platform and the Navan expense card, that provides immediate visibility for our department heads and our finance and accounting team.",
          "start_time": 186.2,
          "end_time": 200.0
        }
      ]
    },
    "7c47e9dcd010": {
      "id": "7c47e9dcd010",
      "path": "assets/normalized_videos/book_a_flight_1920_1440.webm",
      "filename": "book_a_flight_1920_1440.webm",
      "duration": 22.32,
      "resolution": [
        1624,
        1282
      ],
      "fps": 25.0,
      "file_size": 312488,
      "transcript_segments": []
    },
    "27a389036652": {
      "id": "27a389036652",
      "path": "assets/normalized_videos/How_to_book_a_flight.mp4",
      "filename": "How_to_book_a_flight.mp4",
      "duration": 179.18839,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 12684160,
      "transcript_segments": [
        {
          "text": "Intro animation showing Navan branding and airplane cabin.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Introduction and overview of the Navan homepage after profile setup.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Inputting flight details: departure, arrival, dates, and trip type.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Platform searching across multiple airlines for the best options.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Explanation of filters: direct flights, times, airlines, and policy compliance.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Demonstrating the shield icons for in-policy vs. out-of-policy bookings.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Grouping fares by class and reviewing specific amenities and inclusions.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Selecting a flight and generating a trip itinerary.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Checkout process: renaming the trip (e.g., 'Client Visit').",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Reviewing change/cancellation policies and travel document requirements.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Managing traveler info: adding bags, selecting seats, and loyalty points.",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "Payment method selection and final booking confirmation.",
          "start_time": 0.0,
          "end_time": 0.0
        }
      ]
    },
    "6e8600c8b5cc": {
      "id": "6e8600c8b5cc",
      "path": "assets/normalized_videos/Pay back employees - Employee Pays.webm",
      "filename": "Pay back employees - Employee Pays.webm",
      "duration": 4.791,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 66935,
      "transcript_segments": []
    },
    "98c5e159dfa7": {
      "id": "98c5e159dfa7",
      "path": "assets/normalized_videos/Aircall_adopts_Navan_to_simplify_its_accounting_processes_and_boost_efficiency.mp4",
      "filename": "Aircall_adopts_Navan_to_simplify_its_accounting_processes_and_boost_efficiency.mp4",
      "duration": 140.294966,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 40368258,
      "transcript_segments": [
        {
          "text": "Aircall is a telecommunication platform.",
          "start_time": 0.0,
          "end_time": 5.4
        },
        {
          "text": "It's a phone app with AI integrated.",
          "start_time": 5.4,
          "end_time": 9.2
        },
        {
          "text": "We have offices in Paris, in the US, in Spain, in Germany, and also in Australia.",
          "start_time": 9.2,
          "end_time": 21.0
        },
        {
          "text": "Aircall used to have TravelPerk as a vendor.",
          "start_time": 21.0,
          "end_time": 26.5
        },
        {
          "text": "Our main struggle was about the reconciliation between the invoices and the payments.",
          "start_time": 26.5,
          "end_time": 33.0
        },
        {
          "text": "Aircall chose Navan for two reasons.",
          "start_time": 33.0,
          "end_time": 35.5
        },
        {
          "text": "The first one is reducing the amount of vendors for traveling and expense purposes.",
          "start_time": 35.5,
          "end_time": 41.5
        },
        {
          "text": "And we also didn't have a direct integration with NetSuite.",
          "start_time": 41.5,
          "end_time": 46.5
        },
        {
          "text": "We don't need to import any data - everything is integrated.",
          "start_time": 46.5,
          "end_time": 51.5
        },
        {
          "text": "So it's a lot of time saving every month.",
          "start_time": 51.5,
          "end_time": 54.5
        },
        {
          "text": "With Navan, Aircall covers all the costs, and employees don't have to pay up front any more.",
          "start_time": 54.5,
          "end_time": 59.5
        },
        {
          "text": "The first time I used Navan, I found it really user-friendly.",
          "start_time": 59.5,
          "end_time": 107.0
        },
        {
          "text": "And although I had multiple flight options, it was very tailored to what I was looking for.",
          "start_time": 107.0,
          "end_time": 113.2
        },
        {
          "text": "Because I didn't have my card at the time, the meals that we had over there, we had to pay it out of pocket,",
          "start_time": 113.2,
          "end_time": 118.5
        },
        {
          "text": "but I found it very easy to submit the expenses, and the refund went through really quickly.",
          "start_time": 118.5,
          "end_time": 125.0
        },
        {
          "text": "What we need to track as AP accountants is all the costs.",
          "start_time": 125.0,
          "end_time": 131.0
        },
        {
          "text": "Usually we struggle to have the payments and to know what we need to book as costs.",
          "start_time": 131.0,
          "end_time": 137.5
        },
        {
          "text": "So having the Navan cards, people can spend and we already know that this money is spent.",
          "start_time": 137.5,
          "end_time": 144.0
        },
        {
          "text": "We just need the receipts.",
          "start_time": 144.0,
          "end_time": 147.2
        },
        {
          "text": "So it's easy to track. We can get the data by department, by cost centres,",
          "start_time": 147.2,
          "end_time": 152.0
        },
        {
          "text": "by teams, and also by companies. It's very friendly and easy to use.",
          "start_time": 152.0,
          "end_time": 156.0
        },
        {
          "text": "You can easily set up policies and it's applicable instantly.",
          "start_time": 156.0,
          "end_time": 204.0
        },
        {
          "text": "Navan is adaptive, flexible, and easy to use.",
          "start_time": 204.0,
          "end_time": 216.0
        }
      ]
    },
    "c37290274a30": {
      "id": "c37290274a30",
      "path": "assets/normalized_videos/Automate_Expense_Management_with_Navan.mp4",
      "filename": "Automate_Expense_Management_with_Navan.mp4",
      "duration": 38.127166,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 8576259,
      "transcript_segments": [
        {
          "text": "I don't brag about business tools often, but when I do, I'm probably talking about Navan.",
          "start_time": 0.0,
          "end_time": 5.0
        },
        {
          "text": "Navan automates expenses from swipe to reconciliation.",
          "start_time": 5.0,
          "end_time": 7.0
        },
        {
          "text": "I added our spend policy once,",
          "start_time": 7.0,
          "end_time": 10.0
        },
        {
          "text": "and now our employees just upload a photo of the receipt and then it gets automatically approved or flagged for review.",
          "start_time": 10.0,
          "end_time": 14.5
        },
        {
          "text": "Before Navan we spent hours chasing after expenses, reports, approvals. Now it's off our plate.",
          "start_time": 14.5,
          "end_time": 20.0
        },
        {
          "text": "And, Navan syncs with most ERPs and accounting tools, so everything is aligned.",
          "start_time": 20.0,
          "end_time": 25.0
        },
        {
          "text": "For employees with corporate cards, Navan Connect links them to the platform, giving us more flexibility.",
          "start_time": 25.0,
          "end_time": 30.0
        },
        {
          "text": "All in all, introducing Navan to the company was probably my biggest win yet. Make it yours too. Get started on Navan.com.",
          "start_time": 30.0,
          "end_time": 38.0
        }
      ]
    },
    "0bd607cf75fa": {
      "id": "0bd607cf75fa",
      "path": "assets/normalized_videos/Deputy_Streamlines_Global_Operations_Reduces_Travel_Spend_with_Navan.mp4",
      "filename": "Deputy_Streamlines_Global_Operations_Reduces_Travel_Spend_with_Navan.mp4",
      "duration": 156.530656,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 34074194,
      "transcript_segments": [
        {
          "text": "Deputy is the people platform for hourly work.",
          "start_time": 0.0,
          "end_time": 4.5
        },
        {
          "text": "We operate in three main geos: here in the US, in Australia, and in the UK.",
          "start_time": 4.5,
          "end_time": 8.0
        },
        {
          "text": "And for us at Deputy, we really see travel as a way to invest in our people, our culture, and really our future.",
          "start_time": 8.0,
          "end_time": 18.5
        },
        {
          "text": "Prior to using Navan, we used a company called Egencia.",
          "start_time": 18.5,
          "end_time": 21.5
        },
        {
          "text": "And what we found with Egencia is that it just wasn't really fit for purpose for a global business like ours.",
          "start_time": 21.5,
          "end_time": 28.5
        },
        {
          "text": "We were not at all getting the corporate rates that we expected,",
          "start_time": 28.5,
          "end_time": 33.0
        },
        {
          "text": "and we need an intuitive system that each individual can plan their travel on their own.",
          "start_time": 33.0,
          "end_time": 38.0
        },
        {
          "text": "Egencia did not provide that to us.",
          "start_time": 38.0,
          "end_time": 40.5
        },
        {
          "text": "And so we went out and looked for a new system, a new platform, and Navan clicked all the boxes for us.",
          "start_time": 40.5,
          "end_time": 47.0
        },
        {
          "text": "Once we selected Navan as our partner, the implementation could not have been easier.",
          "start_time": 47.0,
          "end_time": 52.0
        },
        {
          "text": "The entire process lasted less than 30 days. It was just a few weeks and we were up and running.",
          "start_time": 52.0,
          "end_time": 57.5
        },
        {
          "text": "As a global business, we're operating in all different time zones. We need to have 24/7 support.",
          "start_time": 57.5,
          "end_time": 64.0
        },
        {
          "text": "We need somebody accessible on the other end of the line, whether that's by phone or by chat.",
          "start_time": 64.0,
          "end_time": 71.5
        },
        {
          "text": "And Navan has always been there for us when we've needed them.",
          "start_time": 71.5,
          "end_time": 74.5
        },
        {
          "text": "And so having somebody who's there when you're panicked, when your flight gets canceled, when your hotel maybe isn't what you expected, Navan is always there.",
          "start_time": 74.5,
          "end_time": 84.5
        },
        {
          "text": "So we're seeing really great savings from Navan.",
          "start_time": 84.5,
          "end_time": 88.0
        },
        {
          "text": "I actually just heard from our VP of Finance. We saw over 10% savings in just the first half of 2025 from the negotiated rates that we're seeing from Navan Travel.",
          "start_time": 88.0,
          "end_time": 98.0
        },
        {
          "text": "When we're booking travel, there are a number of different choices that employees have at their fingertips.",
          "start_time": 98.0,
          "end_time": 105.0
        },
        {
          "text": "So many of these policies that we have are for our employees' safety and security. And we want to make sure that we're maintaining that when the employees are booking their travel.",
          "start_time": 105.0,
          "end_time": 113.0
        },
        {
          "text": "We're also, of course, maintaining a budget. And so we want to have oversight when the employees are booking travel",
          "start_time": 113.0,
          "end_time": 118.0
        },
        {
          "text": "and adherence to those policies so that we can stay within budget and make sure that everybody's safe.",
          "start_time": 118.0,
          "end_time": 128.5
        },
        {
          "text": "So at Deputy, we value travel so much and we want our employees to get excited about travel.",
          "start_time": 128.5,
          "end_time": 134.0
        },
        {
          "text": "The last thing that we want is for people to be bogged down by the administrative burden of travel.",
          "start_time": 134.0,
          "end_time": 140.0
        },
        {
          "text": "And Navan helps us to wipe all of that away. It just makes it easy for us and people can focus on visiting our employees, our customers, and focus on what matters.",
          "start_time": 140.0,
          "end_time": 147.0
        }
      ]
    },
    "36ab8a43fd28": {
      "id": "36ab8a43fd28",
      "path": "assets/normalized_videos/Booking-step3-Approve.webm",
      "filename": "Booking-step3-Approve.webm",
      "duration": 7.734,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 192781,
      "transcript_segments": []
    },
    "bcb82c078280": {
      "id": "bcb82c078280",
      "path": "assets/normalized_videos/How_Navan_fine-tuned_travel_and_expense_management_for_SoundCloud.mp4",
      "filename": "How_Navan_fine-tuned_travel_and_expense_management_for_SoundCloud.mp4",
      "duration": 172.593923,
      "resolution": [
        1920,
        1080
      ],
      "fps": 29.97002997002997,
      "file_size": 38814322,
      "transcript_segments": [
        {
          "text": "Navan is integrated, supportive, and efficient.",
          "start_time": 0.0,
          "end_time": 6.5
        },
        {
          "text": "I lead the teams that are involved in shared services.",
          "start_time": 6.5,
          "end_time": 14.5
        },
        {
          "text": "So basically making sure that all our invoices get processed and paid on time, but also a lot of our general ledger work, making sure that everything is ready for reporting at month end.",
          "start_time": 14.5,
          "end_time": 28.3
        },
        {
          "text": "SoundCloud is an online streaming platform. We're an artist-first platform empowering artists to build and grow their careers.",
          "start_time": 28.3,
          "end_time": 35.1
        },
        {
          "text": "We have four offices: New York, LA, London, and Berlin. Our HQ is here in Berlin and we have about 400 employees worldwide.",
          "start_time": 35.1,
          "end_time": 44.5
        },
        {
          "text": "Before onboarding with Navan, we managed expenses and travel through a multitude of tools and across different locations. and unifying that really made a lot of sense in light of the growth of the company.",
          "start_time": 44.5,
          "end_time": 58.7
        },
        {
          "text": "We onboarded in Navan in January of 2019, so we've been using Navan for six years.",
          "start_time": 58.7,
          "end_time": 103.1
        },
        {
          "text": "As a traveller, Navan is a very easy tool to use. I just go on the tool, enter my dates and my destination, and I can very easily select and filter for the trip that's most convenient for me.",
          "start_time": 103.1,
          "end_time": 116.8
        },
        {
          "text": "Navan Expense improves the accuracy and speed of expenses because controls are integrated, which makes approvals a lot more seamless. It makes sure that if certain expenses are okay, then they will go through rather than an accountant having to look at every single spend and having to approve them, yes or no.",
          "start_time": 116.8,
          "end_time": 136.2
        },
        {
          "text": "So Navan Expense's automations really take a lot of the heavy lift off the shoulders of my team. And that is really, really helpful and makes us save a lot of time that we can then invest in other tasks that add more value.",
          "start_time": 136.2,
          "end_time": 150.2
        },
        {
          "text": "75% of our transactions are pre-approved automatically now, and that really is a huge benefit to my team.",
          "start_time": 150.2,
          "end_time": 156.4
        },
        {
          "text": "Some of the features that have been the most beneficial to my team is the automatic assignment of expense types. So when you go to a restaurant, for example, the card will know and it will automatically give you the correct budget for those spends.",
          "start_time": 156.4,
          "end_time": 210.3
        },
        {
          "text": "Navan has enhanced my day-to-day tasks in the sense that it really allows me to focus on strategic questions.",
          "start_time": 210.3,
          "end_time": 218.4
        },
        {
          "text": "The feedback I've received about Navan Expense is that it's a seamless process. People like using it. The cards work always, and having that available really makes their life easier. It also avoids people having to be out of pocket.",
          "start_time": 218.4,
          "end_time": 238.2
        },
        {
          "text": "It is a good solution and our people are happy using it.",
          "start_time": 238.2,
          "end_time": 244.1
        },
        {
          "text": "The rating of support is 4.6 out of 5, which means that Navan is solving our problems.",
          "start_time": 244.1,
          "end_time": 253.0
        }
      ]
    },
    "4ca8229183fe": {
      "id": "4ca8229183fe",
      "path": "assets/normalized_videos/Fixing Business Travel’s Screenshot Problem： Maximize savings, minimize risk.mp4",
      "filename": "Fixing Business Travel’s Screenshot Problem： Maximize savings, minimize risk.mp4",
      "duration": 1575.891882,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 81527309,
      "transcript_segments": [
        {
          "text": "All right. Hello everybody. I can't see the participants actually, but I'm being told that we have about 18 people on this call today. Nice to meet you all.",
          "start_time": 0.0,
          "end_time": 9.0
        },
        {
          "text": "My name is Jess. I'm our Vice President of Travel and Expense. I've been with Navan for four years, and this is actually my last week before maternity leave.",
          "start_time": 9.0,
          "end_time": 20.0
        },
        {
          "text": "And I call that out because you can probably hear the congestion and the fact that I'm out of breath. But thank you all for joining. We haven't done webinars in a little bit.",
          "start_time": 20.0,
          "end_time": 35.0
        },
        {
          "text": "I think there was some webinar fatigue post-COVID, but we're back and we think it's a great way to share some context on what Navan's doing, what we're seeing in the travel and expense industry.",
          "start_time": 35.0,
          "end_time": 47.0
        },
        {
          "text": "And we like to keep these short because I don't know that people can really pay attention for more than 30 minutes. So I'll actually kick us off today.",
          "start_time": 47.0,
          "end_time": 55.0
        },
        {
          "text": "I encourage you to post questions. I will have someone that can field some of the Q&A questions. So as we're going through this, if you have questions, please post them in there",
          "start_time": 55.0,
          "end_time": 64.0
        },
        {
          "text": "and we'll do our best to answer them as we go. For this first session of our webinar, I actually wanted to talk about fixing business travel's screenshot problem, as I call it.",
          "start_time": 64.0,
          "end_time": 73.0
        },
        {
          "text": "I'm on hundreds of customer calls monthly, and when we talk to prospective customers, they're often telling us, 'I'm constantly getting screenshots from people.'",
          "start_time": 73.0,
          "end_time": 84.0
        },
        {
          "text": "They're either finding cheaper rates elsewhere, they don't understand why they can't find something in platform, and so I like to call it the screenshot problem, right?",
          "start_time": 84.0,
          "end_time": 96.0
        },
        {
          "text": "Where they're trying to book a hotel and it seems that that boutique hotel is not in their system, or they are looking for a flight and for some reason it's slightly cheaper on the United website.",
          "start_time": 96.0,
          "end_time": 105.0
        },
        {
          "text": "Or maybe they're looking to fly to Europe and then take a train and they can't find that either.",
          "start_time": 105.0,
          "end_time": 114.0
        },
        {
          "text": "And so really we're here to address today why the screenshot problem is happening and potentially why it's gotten worse post-COVID as well.",
          "start_time": 114.0,
          "end_time": 125.0
        },
        {
          "text": "Before we do that, I wanted to anchor us in a couple interesting numbers. We published a report in partnership with Skift earlier this year",
          "start_time": 125.0,
          "end_time": 135.0
        },
        {
          "text": "where we surveyed 15,000 travelers and admins to actually get their take on how compliance in their program has been post-pandemic, right? Since return to travel.",
          "start_time": 135.0,
          "end_time": 145.0
        },
        {
          "text": "And I think a really interesting stat is that most managers in finance, in procurement, actually feel like getting their program to 75 or 90% compliance,",
          "start_time": 145.0,
          "end_time": 154.0
        },
        {
          "text": "which was often the norm pre-COVID, has significantly declined. So coming out of COVID, 45% of them still felt like they were getting that 90% compliance they were looking for,",
          "start_time": 154.0,
          "end_time": 164.0
        },
        {
          "text": "and we've seen that decrease to 39% this year. And this is really the first time in history, I would say, that business travelers and the actual managers agree on something when it comes to travel.",
          "start_time": 164.0,
          "end_time": 179.0
        },
        {
          "text": "And the most common theme we've seen when we surveyed the travelers and the leaders in the business is that pretty much both of them cite that 46% of the time they're finding lower prices,",
          "start_time": 179.0,
          "end_time": 194.0
        },
        {
          "text": "right? Between 30 and 40%, it's usually either 'I'm finding lower prices elsewhere' or 'I'm finding better inventory elsewhere.' Better inventory could mean, you know,",
          "start_time": 194.0,
          "end_time": 209.0
        },
        {
          "text": "this one route that I couldn't find in Concur, or this one hotel that I couldn't find in Egencia or whatever online booking tool they're using.",
          "start_time": 209.0,
          "end_time": 224.0
        },
        {
          "text": "And so really, whenever we talk to leaders, and we've actually seen a significant uptick in companies going out to market,",
          "start_time": 224.0,
          "end_time": 234.0
        },
        {
          "text": "so in the last year alone, we saw a 70% uptick in companies actually going out to market, sometimes prematurely. You know, if they had a three or five-year contract,",
          "start_time": 234.0,
          "end_time": 249.0
        },
        {
          "text": "they were going to market much earlier because they're really faced with this forced tradeoff, right? On the one hand, they can either decide to prioritize cost savings",
          "start_time": 249.0,
          "end_time": 264.0
        },
        {
          "text": "and say, 'You know what? If our employees are doing the research and they're finding cheaper rates outside of the platform, let's let them book it. It'll save us money.'",
          "start_time": 264.0,
          "end_time": 279.0
        },
        {
          "text": "But as a result of that, the negative consequence is that they lose visibility and often times it's a duty of care risk, right? You're not sure where your travelers are traveling,",
          "start_time": 279.0,
          "end_time": 294.0
        },
        {
          "text": "and you know, I think the last few months has taught us that there's CrowdStrike outages and there's power outages in Europe and some planes are having issues.",
          "start_time": 294.0,
          "end_time": 309.0
        },
        {
          "text": "And so, you know, on the one hand they either have to decide, do we let these employees book off-platform if it's cheaper, or are we actually taking the other extreme which is no,",
          "start_time": 309.0,
          "end_time": 324.0
        },
        {
          "text": "we want to prioritize compliance, regardless of what you found elsewhere, we need you to book in-platform, that is our policy. And we want to drive compliance so we can keep you safe and have visibility,",
          "start_time": 324.0,
          "end_time": 339.0
        },
        {
          "text": "but then as a result, you're overspending. So that's really where we come in and try to help businesses solution through that piece.",
          "start_time": 339.0,
          "end_time": 354.0
        },
        {
          "text": "And I think that most people probably don't nerd out over travel as much as I do, and so I really wanted to talk through the root causes and why this is actually happening.",
          "start_time": 354.0,
          "end_time": 369.0
        },
        {
          "text": "The first reason this is actually happening, and actually all of them boil down to the legacy travel management company infrastructure. But the first reason that you're seeing missed inventory",
          "start_time": 369.0,
          "end_time": 384.0
        },
        {
          "text": "and you're getting those screenshots is because the legacy travel management companies rely primarily on the Global Distribution System (GDS).",
          "start_time": 384.0,
          "end_time": 399.0
        },
        {
          "text": "So when you think about it, three or four years ago everyone, every travel management company was at parity in terms of where we actually sourced our content.",
          "start_time": 399.0,
          "end_time": 414.0
        },
        {
          "text": "We all got content from the Global Distribution System. As technology has become more prevalent in travel and corporate travel, there are multiple different sources of inventory that can be pulled in.",
          "start_time": 414.0,
          "end_time": 429.0
        },
        {
          "text": "And so when you're only relying on the Global Distribution System and you're a more legacy travel management company that hasn't necessarily invested in the technology to pull this content,",
          "start_time": 429.0,
          "end_time": 444.0
        },
        {
          "text": "you're missing direct airline fares. You're not pulling that same content off the American Airlines or United website. You don't have access to low-cost carriers in Europe",
          "start_time": 444.0,
          "end_time": 459.0
        },
        {
          "text": "like the Ryanairs and EasyJets which are really popular. It even goes as far as rail providers in Europe who build technology and have no real appetite to be on the Global Distribution System.",
          "start_time": 459.0,
          "end_time": 474.0
        },
        {
          "text": "So the actual reason that you're getting those screenshots is because most legacy travel management companies haven't evolved to be able to be multi-provider by default",
          "start_time": 474.0,
          "end_time": 489.0
        },
        {
          "text": "and pull in these different types of content as content becomes more democratized. The second piece is the problem of higher prices, right? You're constantly seeing those screenshots",
          "start_time": 489.0,
          "end_time": 504.0
        },
        {
          "text": "and so yes, part of it is how inventory is sourced, but it's also actually how the GDS and that system prevents airlines and hotels from making pricing dynamic, right?",
          "start_time": 504.0,
          "end_time": 519.0
        },
        {
          "text": "So when you think of consumer sites or airline sites, hotel and airfare is one of the most dynamically priced pieces of content, right?",
          "start_time": 519.0,
          "end_time": 534.0
        },
        {
          "text": "I don't know that things on Amazon change prices that often or as often as airfare and hotels do. And so there's limitations with that old technology in terms of being able to pull dynamic pricing",
          "start_time": 534.0,
          "end_time": 549.0
        },
        {
          "text": "that mimics those consumer sites. Lastly, and the two are kind of intertwined, if you think of the travel management companies, many of them were started in the 80s or 90s",
          "start_time": 549.0,
          "end_time": 564.0
        },
        {
          "text": "and they were professional services firms, right? They built their business on human beings and they built their business on you calling agents for support.",
          "start_time": 564.0,
          "end_time": 579.0
        },
        {
          "text": "As a result, in the early 2000s when they had to innovate and actually invest in technology, they chose to partner instead of investing in technology, right?",
          "start_time": 579.0,
          "end_time": 594.0
        },
        {
          "text": "They partnered with that Global Distribution System and then they also partnered with online booking tools. And they never really invested in their own native in-house technology,",
          "start_time": 594.0,
          "end_time": 609.0
        },
        {
          "text": "which today leads to that second problem which is it's a very disjointed process where if you are building a global business travel program, you probably have multiple instances of an online booking tool.",
          "start_time": 609.0,
          "end_time": 624.0
        },
        {
          "text": "You might have one if you're lucky, but probably multiple travel management companies. These systems don't speak to each other and also really there's very little incentive",
          "start_time": 624.0,
          "end_time": 639.0
        },
        {
          "text": "for the online booking tool and those companies and the travel management companies to work together. The agency would prefer that you continue to call because that is their business.",
          "start_time": 639.0,
          "end_time": 654.0
        },
        {
          "text": "Are we getting any questions so far before I touch into Navan? I'm going to take that as a no. No questions just yet, but everyone is encouraged to drop anything they'd like",
          "start_time": 654.0,
          "end_time": 664.0
        },
        {
          "text": "to get answered into the Q&A box. Amazing. And so lastly, before we talk about how Navan can help the problem, these off-platform bookings,",
          "start_time": 664.0,
          "end_time": 673.0
        },
        {
          "text": "the screenshot problem that has become so prevalent post-COVID, is actually quite problematic, right? It leads to blind spots and duty of care gaps.",
          "start_time": 673.0,
          "end_time": 688.0
        },
        {
          "text": "So if we have any anyone that's on the physical security team or security team more broadly, you're probably thinking about that piece. If we have any finance leaders on the call, right?",
          "start_time": 688.0,
          "end_time": 703.0
        },
        {
          "text": "It's very difficult when people are finding content outside of the system to drive compliance blindly, right? And tell them that they must book in app.",
          "start_time": 703.0,
          "end_time": 718.0
        },
        {
          "text": "It also leads to just untracked spend and lost savings because they're not being governed by policy when they book outside.",
          "start_time": 718.0,
          "end_time": 733.0
        },
        {
          "text": "And then lastly on the back end, you're manually reconciling a lot of that data and you really don't have visibility into that travel spend until it's reimbursed or you know submitted for reimbursement",
          "start_time": 733.0,
          "end_time": 748.0
        },
        {
          "text": "30, 60 days later. So that's really what we set out to solve. And so when these companies are going to market, we usually see pretty common themes in terms of what they're looking for.",
          "start_time": 748.0,
          "end_time": 763.0
        },
        {
          "text": "They're looking for more content and better pricing, right? They want to know that they have a future-proof partner that is going to give them access to better content but also the ability to continue,",
          "start_time": 763.0,
          "end_time": 778.0
        },
        {
          "text": "right? To pull content as it shows up. You know I'll give you an example, Navan has a very strong offering in India. Very few Indian carriers and providers are actually on the GDS, right?",
          "start_time": 778.0,
          "end_time": 793.0
        },
        {
          "text": "We have to go and connect to them directly. But program owners want more content and better pricing. They want an intuitive booking experience for their travelers.",
          "start_time": 793.0,
          "end_time": 808.0
        },
        {
          "text": "The reality is the systems you're providing them today have just evolved, right? Whether it's Zoom like we are on today or a DocuSign or whatever else it is,",
          "start_time": 808.0,
          "end_time": 823.0
        },
        {
          "text": "like these people need an intuitive experience when they're actually on the road that is also mobile friendly. And then lastly, they just want to be able to drive higher adoption and increase employee efficiency.",
          "start_time": 823.0,
          "end_time": 838.0
        },
        {
          "text": "Many companies have had to reduce their workforce and so it's becoming more important now than ever to ensure that your workforce is actually extremely efficient.",
          "start_time": 838.0,
          "end_time": 853.0
        },
        {
          "text": "All right, so who is Navan? I have no idea how many of you actually know our business, so if this is repetitive, you'll have to hear it again. But Navan is 10 years old.",
          "start_time": 853.0,
          "end_time": 868.0
        },
        {
          "text": "We're the only fully native travel and expense management platform. And what I mean by that is from day one, 10 years ago, we set out to build an all-in-one travel and expense platform.",
          "start_time": 868.0,
          "end_time": 883.0
        },
        {
          "text": "Travel is a company's largest expenditure. We always felt that it made sense to actually build the infrastructure in the back end to be a native travel and expense platform.",
          "start_time": 883.0,
          "end_time": 898.0
        },
        {
          "text": "I share that because most of our competitors out there today are not natively built as a travel and expense management platform. It's been put together and added on via acquisition, right?",
          "start_time": 898.0,
          "end_time": 913.0
        },
        {
          "text": "And so the way those systems speak to each other, the way data feeds from one part of the system to the other is very different when you've built it natively from the ground up",
          "start_time": 913.0,
          "end_time": 928.0
        },
        {
          "text": "as opposed to connecting these systems and white labeling them via acquisition. Navan today has 12,000 customers. We are the fourth largest travel management company and we have 61 offices globally.",
          "start_time": 928.0,
          "end_time": 943.0
        },
        {
          "text": "So we've grown extremely rapidly in the last 10 years. At this stage, we support customers across every vertical. Be it financial services, tech, manufacturing, CPG,",
          "start_time": 943.0,
          "end_time": 958.0
        },
        {
          "text": "we have a pretty wide array of customers that also range in shapes and sizes, right? So we support Unilever or Jones Lang LaSalle, right?",
          "start_time": 958.0,
          "end_time": 973.0
        },
        {
          "text": "Massive real estate company across their 100,000 employees. But then we also support, you know, the smaller more nimble companies that are looking to grow, whether it's Instacart or DoorDash and etc.",
          "start_time": 973.0,
          "end_time": 988.0
        },
        {
          "text": "So at this point we have, I would say we're at that sweet spot of being mature as a company, we know how to launch travel and expense quickly and efficiently, but because we're still founder-led,",
          "start_time": 988.0,
          "end_time": 1003.0
        },
        {
          "text": "we've kept that same level of agility when it comes to how fast we innovate the product. And in fact, close to 30% of our revenue is still very much invested in R&D",
          "start_time": 1003.0,
          "end_time": 1018.0
        },
        {
          "text": "so we can keep pushing the boundaries of where our product is going. So in the simplest of terms, what does Navan do? We're an all-in-one platform.",
          "start_time": 1018.0,
          "end_time": 1033.0
        },
        {
          "text": "We were always started to be multi-provider by default, meaning we never wanted to build our entire business around the Global Distribution System.",
          "start_time": 1033.0,
          "end_time": 1048.0
        },
        {
          "text": "We built the infrastructure to be able to pull content from anywhere, be it direct connections, low-cost carriers, rail providers, cars, hotels, whatever it might be, we ingest it all.",
          "start_time": 1048.0,
          "end_time": 1063.0
        },
        {
          "text": "We from the get-go wanted to own the consumer experience, both on the travel and expense side. We felt that it was paramount to obsess over the user and own the actual experience ourselves.",
          "start_time": 1063.0,
          "end_time": 1078.0
        },
        {
          "text": "And so, you know, when you think of the user, it's actually not just the traveler. It's also the admins on the back end, right? How do we ensure that reporting is real-time?",
          "start_time": 1078.0,
          "end_time": 1093.0
        },
        {
          "text": "How can managers access their own content without needing to ping accounting for an end-of-month report? So we've been maniacally focused on that consumer experience.",
          "start_time": 1093.0,
          "end_time": 1108.0
        },
        {
          "text": "We also set out to help companies to proactively manage spend, right? So when you shift gears slightly on the expense side, we felt that expense management was too reactive of a process",
          "start_time": 1108.0,
          "end_time": 1123.0
        },
        {
          "text": "and it needed to become a proactive process. And so what we've done is build the connections so that enterprises can bring their own card program and we can embed policies on those cards",
          "start_time": 1123.0,
          "end_time": 1138.0
        },
        {
          "text": "to allow you to essentially set policy, right? And dictate what people are spending on proactively as opposed to reactively when they submit an expense report 30 or 60 days later.",
          "start_time": 1138.0,
          "end_time": 1153.0
        },
        {
          "text": "And then lastly, a big thing that differentiates us is just transparent pricing, right? So I've talked a lot about the technology today, but we are of course a full-blown travel management company",
          "start_time": 1153.0,
          "end_time": 1168.0
        },
        {
          "text": "with 64 offices globally. There are also human beings on the back end. What we didn't want to do is follow suit with the legacy industry of having a laundry list of fees",
          "start_time": 1168.0,
          "end_time": 1183.0
        },
        {
          "text": "and almost disincentivizing travelers from calling support when they need to. So from the get-go we set out to create very clear and transparent pricing so that finance and procurement leaders",
          "start_time": 1183.0,
          "end_time": 1198.0
        },
        {
          "text": "can essentially forecast how much they're going to spend on travel fees and expense fees every single year. And I got a question from someone, so before I touch on Zuora,",
          "start_time": 1198.0,
          "end_time": 1213.0
        },
        {
          "text": "we connect with all the major ERP systems: Workday, SAP, Oracle, NetSuite, whatever it might be. And so I would definitely encourage you to set up time if you want to speak to our team,",
          "start_time": 1213.0,
          "end_time": 1228.0
        },
        {
          "text": "but we would connect via API to whatever ERP system you're using at this point. All right, keep the questions coming. Really, this is one customer story but there's many anecdotes we can tell.",
          "start_time": 1228.0,
          "end_time": 1243.0
        },
        {
          "text": "I picked Zuora because I figured that we might have a lot of finance leaders on this call who might be familiar with Zuora or used it in the past. Zuora was one of those companies",
          "start_time": 1243.0,
          "end_time": 1258.0
        },
        {
          "text": "that was growing very rapidly and when we met them, via growth, they had kind of set up different travel management companies in each region because the perception was",
          "start_time": 1258.0,
          "end_time": 1273.0
        },
        {
          "text": "that we should use a different company that has actual expertise in each major region, which was actually a really common trend where it was like, you know,",
          "start_time": 1273.0,
          "end_time": 1288.0
        },
        {
          "text": "we should have a TMC in Europe that is really good with Europe or we should pick the best of the best in the US. And so they were in a situation where they had a couple different travel management companies,",
          "start_time": 1288.0,
          "end_time": 1303.0
        },
        {
          "text": "they had an expense system but they were connecting to so many different travel management companies that the data wasn't really flowing in and so it was really a massive effort to just think through",
          "start_time": 1303.0,
          "end_time": 1318.0
        },
        {
          "text": "how do we consolidate this, right? Is one of the three better and should we go with them, or do we actually just scratch the whole thing and start fresh?",
          "start_time": 1318.0,
          "end_time": 1333.0
        },
        {
          "text": "And so the key challenges that really led them to a change was they were missing content, there was a complete lack of automation in the travel booking process,",
          "start_time": 1333.0,
          "end_time": 1348.0
        },
        {
          "text": "nothing was really flowing to that expense management system seamlessly, and it was a lot of back-end work for the accounting teams who were having to manually process and review and audit every single expense report.",
          "start_time": 1348.0,
          "end_time": 1363.0
        },
        {
          "text": "And I think the biggest differentiator for Navan here was our global scope, the fact that we were all in one, but more importantly, our time to value, right?",
          "start_time": 1363.0,
          "end_time": 1378.0
        },
        {
          "text": "So we were able to launch them sub-60 days globally for travel and expense, right? And so part of our strength and agility is also how quickly we can launch customers.",
          "start_time": 1378.0,
          "end_time": 1393.0
        },
        {
          "text": "This is kind of a systemic problem that a lot of companies have felt, like the screenshot problem has existed for a few years but it seems daunting to change a system that touches every employee in the business.",
          "start_time": 1393.0,
          "end_time": 1408.0
        },
        {
          "text": "And so we really pride ourselves on being able to launch a customer, you know, if they're smaller within 30 days, and we have launched customers like Unilever in sub-90 days globally across all of their different offices.",
          "start_time": 1408.0,
          "end_time": 1423.0
        },
        {
          "text": "So keep that in mind, it tends to be one of the highest visibility but low impact projects that a finance and procurement team can work on. All right, I think I saw two more questions pop up.",
          "start_time": 1423.0,
          "end_time": 1438.0
        },
        {
          "text": "Ooh, I love that question. The platform is obviously top-tier, what's coming to Navan that gets you very excited? Yes, so two things.",
          "start_time": 1438.0,
          "end_time": 1448.0
        },
        {
          "text": "If any of you do follow our business, you will know that our co-founder and CTO Elon has been at the forefront of Agentic AI. So yes, of course we will remain a human business,",
          "start_time": 1448.0,
          "end_time": 1463.0
        },
        {
          "text": "you can't be a TMC without having agents in the back end that are supporting travelers, but what will allow Navan to continue to scale at this pace is that our Agentic AI,",
          "start_time": 1463.0,
          "end_time": 1478.0
        },
        {
          "text": "our AI agent Ava, today is handling 50% of our support requests. So it's really allowing our real human agents to focus on the more complex requests and the rest is handled by our AI.",
          "start_time": 1478.0,
          "end_time": 1493.0
        },
        {
          "text": "And so taking that a step farther, Elon our CTO believes that user experience as we know it really hasn't been disrupted in years, right?",
          "start_time": 1493.0,
          "end_time": 1508.0
        },
        {
          "text": "If you think about even just the shift to ChatGPT or how we're having a more conversational discussion with technology, travel should be no different.",
          "start_time": 1508.0,
          "end_time": 1523.0
        },
        {
          "text": "And so we're going to be launching something very exciting soon that is more related to user experience and should really allow travelers to essentially speak to an AI assistant.",
          "start_time": 1523.0,
          "end_time": 1538.0
        },
        {
          "text": "There's no reason you shouldn't be able to tell them 'Hey, you saw it on my calendar I have a big meeting in New York, organize my trip,' right? And it's more of a conversation than it is you clicking through buttons.",
          "start_time": 1538.0,
          "end_time": 1553.0
        },
        {
          "text": "All right, hopefully that answers your question. I can't see any faces which is very, very odd. I don't know if people are bored and off-camera or if they're actually engaged.",
          "start_time": 1553.0,
          "end_time": 1568.0
        },
        {
          "text": "The other question I got was can you walk us through how Navan improves the day-to-day experience for employees? Yes, great question. So on the travel side today,",
          "start_time": 1568.0,
          "end_time": 1583.0
        },
        {
          "text": "most employees are what we call cross-shopping. So they no longer trust Concur, so what they're doing before they book a trip is they go and they do a bunch of research,",
          "start_time": 1583.0,
          "end_time": 1598.0
        },
        {
          "text": "they find a trip that they like, and then they try to mimic that in the Concur system. What we've seen when they move over to Navan is a 90% reduction in that cross-shopping that they do.",
          "start_time": 1598.0,
          "end_time": 1613.0
        },
        {
          "text": "They then go book their trip, and the biggest difference is that very little of that trip requires any agent's assistance. So 95% of our trip bookings",
          "start_time": 1613.0,
          "end_time": 1628.0
        },
        {
          "text": "and the actual trip completion does not require you calling a live agent, which is not the case with legacy agencies. Travelers have to call agents if they need to apply an unused ticket,",
          "start_time": 1628.0,
          "end_time": 1643.0
        },
        {
          "text": "they have to call agents if they want to make a change to their trip, all of that is done self-service in Navan and especially post-pandemic, the feedback we get from travelers is",
          "start_time": 1643.0,
          "end_time": 1658.0
        },
        {
          "text": "'Well I just let that unused ticket expire because I wasn't going to be on hold for an hour trying to use that ticket to book my trip.' So on the travel side it's the self-service piece.",
          "start_time": 1658.0,
          "end_time": 1673.0
        },
        {
          "text": "Because it's connected to expense, what it also does for those travelers is that the flight receipt and flight details flow automatically into Navan and that expense is just auto-expensed for them,",
          "start_time": 1673.0,
          "end_time": 1688.0
        },
        {
          "text": "they don't have to touch it. And then generally speaking as well on the expense side, what we're trying to do is remove the need for expense reports.",
          "start_time": 1688.0,
          "end_time": 1703.0
        },
        {
          "text": "So because the finance team is embedding policies on their cards and because we have all that card data and we have their travel booking data, we know if they're on a trip or not on a trip.",
          "start_time": 1703.0,
          "end_time": 1718.0
        },
        {
          "text": "So we know that they're allowed to spend on meals for example. So all of those expenses would be automatically approved, especially if they're under $75, because they're on a trip they have a per diem they're allowed to spend.",
          "start_time": 1718.0,
          "end_time": 1733.0
        },
        {
          "text": "So the whole idea is how much can we automate that experience for travelers and how much can we remove the need to actually speak to human beings when you're on a trip.",
          "start_time": 1733.0,
          "end_time": 1748.0
        },
        {
          "text": "So hopefully that answers your question, but I would very much encourage you to just take a demo and look at the actual system yourself. Can you speak on the security around AI?",
          "start_time": 1748.0,
          "end_time": 1763.0
        },
        {
          "text": "Yes, at a high level I can. You know we're SOC 2 compliant, every major security clearance we've needed we've gotten, I really should have our CISO here.",
          "start_time": 1763.0,
          "end_time": 1778.0
        },
        {
          "text": "Of course we provide single sign-on. When it comes to AI, your data is completely de-identified, we're not using company data to train the model, so none of your data actually makes it.",
          "start_time": 1778.0,
          "end_time": 1793.0
        },
        {
          "text": "And we're using OpenAI's LLM to train our AI. I think we have a lot of that information on our website, but if not I encourage you again through our website to just request more information",
          "start_time": 1793.0,
          "end_time": 1808.0
        },
        {
          "text": "and we can send you some of that. Last question, I feel like you and I need to do a solo call after this. What kind of real-time expense data or dashboards are available",
          "start_time": 1808.0,
          "end_time": 1818.0
        },
        {
          "text": "to manager and finance teams? A lot. So I would say that's really our strength. There's pre-built dashboards, we have an API so you could feed it into your BI tool",
          "start_time": 1818.0,
          "end_time": 1833.0
        },
        {
          "text": "and more importantly, we've actually partnered with ThoughtSpot to create advanced analytics so that essentially managers who perhaps aren't in finance, right?",
          "start_time": 1833.0,
          "end_time": 1848.0
        },
        {
          "text": "So I'm thinking of like revenue leaders in the business, who might want to do a specific query, could go in there and similar to ChatGPT say, 'You know, I'm planning a sales kickoff",
          "start_time": 1848.0,
          "end_time": 1863.0
        },
        {
          "text": "and I want to know how much we spent on sales kickoff the last three years,' right? And it's becoming much more conversational where it can then build that dashboard for them. So everything is real-time",
          "start_time": 1863.0,
          "end_time": 1878.0
        },
        {
          "text": "and we have standard reports that break down, you know, how much the business is spending within each one of your major general ledger categories, how that compares month-over-month,",
          "start_time": 1878.0,
          "end_time": 1893.0
        },
        {
          "text": "we have some peer data in there as well that's anonymized. So yeah, I would encourage you to take a look at it. Amazing. I don't want to keep people over the 30-minute mark,",
          "start_time": 1893.0,
          "end_time": 1908.0
        },
        {
          "text": "but please go to our website, schedule a meeting if helpful. Hopefully we can speak about your business one-on-one and really, really understand what your challenges are.",
          "start_time": 1908.0,
          "end_time": 1918.0
        },
        {
          "text": "And next time you get a screenshot from an angry traveler, now you know why. Thank you everybody.",
          "start_time": 1918.0,
          "end_time": 1927.0
        }
      ]
    },
    "243b6d20e1ab": {
      "id": "243b6d20e1ab",
      "path": "assets/normalized_videos/On-demand： Savings from managed, high-adoption travel programs.mp4",
      "filename": "On-demand： Savings from managed, high-adoption travel programs.mp4",
      "duration": 1651.472834,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 72615403,
      "transcript_segments": [
        {
          "text": "Let's get started. So welcome everybody to our webinar today discussing savings from managed high-adoption travel programs.",
          "start_time": 0.0,
          "end_time": 1.45
        },
        {
          "text": "Today we're going to discuss research conducted by Euromonitor in our partnership with Navan that did a deep dive into the global business travel sector.",
          "start_time": 1.45,
          "end_time": 2.58
        },
        {
          "text": "This is going to include an estimation of the total addressable market for global business travel, B2B survey results on businesses travel outlooks for the next five years, and a comparison between the profiles of managed versus unmanaged companies.",
          "start_time": 2.58,
          "end_time": 3.35
        },
        {
          "text": "Following a recap of the research, we'll be having a discussion around the implications of the research in managed high-adoption travel programs for businesses.",
          "start_time": 3.35,
          "end_time": 4.19
        },
        {
          "text": "From the Euromonitor team, we have Christopher Quintos and myself, Sarah Sanders.",
          "start_time": 4.19,
          "end_time": 4.46
        },
        {
          "text": "Chris is a senior consulting manager on Euromonitor's North America consulting team. For this research specifically, Chris helped lead the estimations for the total addressable market for the global business travel market.",
          "start_time": 4.46,
          "end_time": 5.44
        },
        {
          "text": "And I'm a senior consultant on Euromonitor's North America consulting team. I specialize in consumer insights and I specifically worked on the B2B survey piece of this research partnership that we'll go into depth and cover shortly.",
          "start_time": 5.44,
          "end_time": 7.15
        },
        {
          "text": "Finally, from the Navan team, we have Amy Butte. Amy is CFO of business travel and expense management firm Navan, an experienced finance leader.",
          "start_time": 7.15,
          "end_time": 9.1
        },
        {
          "text": "Amy is an advisor to high-growth companies and corporates and previously was CFO at New York Stock Exchange. Looking forward to speaking with you, Amy, about what these research findings mean for businesses.",
          "start_time": 9.1,
          "end_time": 11.2
        },
        {
          "text": "I love some good data, Sarah, so thank you. Looking forward to it.",
          "start_time": 11.2,
          "end_time": 12.42
        },
        {
          "text": "Okay, so without further ado, we'll jump into the research.",
          "start_time": 12.42,
          "end_time": 13.45
        },
        {
          "text": "Euromonitor's research partnership with Navan included sizing the addressable market, forecasting growth, and understanding those key drivers of market development.",
          "start_time": 13.45,
          "end_time": 14.47
        },
        {
          "text": "The methodology combined with a top-down and bottom-up approach that leverages sources including Euromonitor's own proprietary Passport database, secondary sources, and a custom B2B survey that I mentioned conducted across nine markets, and finally interviews with 11 industry experts from across the world.",
          "start_time": 14.47,
          "end_time": 17.19
        },
        {
          "text": "Our goal with this approach was to arrive at a holistic view of the global market, taking key regional factors into account before arriving at one total global view.",
          "start_time": 17.19,
          "end_time": 19.5
        },
        {
          "text": "Today we'll talk about the outcomes of the study, including the total addressable market or TAM that was estimated for global business travel as well as the insights from the B2B survey on annual number of business trips, average spend per trip, anticipated changes in cost to businesses, and how those can differ across segments such as managed, so those who use a travel management system, and unmanaged, those who do not.",
          "start_time": 19.5,
          "end_time": 21.11
        },
        {
          "text": "The survey that I mentioned was a B2B survey that reached a total sample of 756 respondents across nine markets.",
          "start_time": 21.11,
          "end_time": 22.58
        },
        {
          "text": "This was fielded from March to April of this year and the countries in the survey were determined by selecting the largest geographic markets for business travel.",
          "start_time": 22.58,
          "end_time": 25.13
        },
        {
          "text": "For example, according to our research, we know that North America accounts for around 25% of the global total addressable market for business travel in 2024. So the US and Canada were important markets for us to target in our survey.",
          "start_time": 25.13,
          "end_time": 27.58
        },
        {
          "text": "So this is just an overview of that sample.",
          "start_time": 27.58,
          "end_time": 29.58
        },
        {
          "text": "So diving into our key takeaways from the research, we'll start with our global business travel spend estimates.",
          "start_time": 29.58,
          "end_time": 31.42
        },
        {
          "text": "Euromonitor estimates that in 2024, the global business travel spend is $2.1 trillion and that will increase by $800 billion to $2.9 trillion in 2029.",
          "start_time": 31.42,
          "end_time": 33.36
        },
        {
          "text": "We know that the global business travel market reached its peak in 2019 before the COVID-19 pandemic, which we know caused a global slowdown in business travel.",
          "start_time": 33.36,
          "end_time": 35.37
        },
        {
          "text": "However, a really key piece of our research indicated that global business travel is actually expected to surpass pre-pandemic spending levels this year.",
          "start_time": 35.37,
          "end_time": 37.19
        },
        {
          "text": "And when we begin to look at what is driving that total addressable market, from the surveyed businesses, 85% of them actually anticipate their business travel expenditure to increase over the next five years.",
          "start_time": 37.19,
          "end_time": 38.35
        },
        {
          "text": "That is 85% from our global survey, meaning that globally the vast majority of businesses are actually anticipating a spending increase over the next five years.",
          "start_time": 38.35,
          "end_time": 41.13
        },
        {
          "text": "And there are multiple drivers of this anticipated expenditure increase.",
          "start_time": 41.13,
          "end_time": 43.14
        },
        {
          "text": "The primary drivers are an anticipated increase in travel fare costs, such as plane and rail tickets, with 63% of respondents citing that as a driver for anticipated cost increases, as well as increase in accommodation costs.",
          "start_time": 43.14,
          "end_time": 44.47
        },
        {
          "text": "Then general business growth and company expansion. Nearly half of respondents anticipated an increase in travel frequency.",
          "start_time": 44.47,
          "end_time": 47.15
        },
        {
          "text": "This shows us that companies are anticipating spending more on travel over the next five years from both price increases from airlines and hotels, while also anticipating positive business growth that will be increasing headcount, numbers of trips, numbers of clients, and the number of employees traveling and also their travel frequency.",
          "start_time": 47.15,
          "end_time": 49.33
        },
        {
          "text": "So although travel is becoming more expensive, businesses are not actually anticipating that to translate into an overall reduction in travel.",
          "start_time": 49.33,
          "end_time": 51.15
        },
        {
          "text": "I'll pass it over to Chris to dive more into our data. Thank you, Sarah.",
          "start_time": 51.15,
          "end_time": 52.44
        },
        {
          "text": "Yeah, so part of our approach in forecasting the total addressable market for global business travel was estimating the current and forecast average business trip costs, both at a market level and as a global average.",
          "start_time": 52.44,
          "end_time": 55.44
        },
        {
          "text": "Our research confirmed our survey respondents' expectation that average business trip costs are likely to rise over the next few years, driven both by growth in prices as well as longer trips and farther destinations.",
          "start_time": 55.44,
          "end_time": 57.19
        },
        {
          "text": "For example, Canada had the highest average trip cost in 2024 based on our research, which was estimated at about $2,400 per trip.",
          "start_time": 57.19,
          "end_time": 60.1
        },
        {
          "text": "However, trip costs for Canadian businesses are forecast to increase slowly at about 0.8% per year to about $2,500 US dollars by 2029.",
          "start_time": 60.1,
          "end_time": 62.42
        },
        {
          "text": "Comparatively, trip costs for US businesses are expected to grow by about 1.2% per year to over $1,800 US dollars per trip by 2029.",
          "start_time": 62.42,
          "end_time": 64.38
        },
        {
          "text": "Trip costs are expected to grow the most for companies that have a higher share of international trips, such as those based in Europe or countries like Singapore.",
          "start_time": 64.38,
          "end_time": 67.15
        },
        {
          "text": "As we can see from this chart, the average trip cost in Singapore is expected to grow from around $1,400 per trip in 2024 to nearly $1,800 per trip in 2029, averaging out to an annual growth rate of about 4.8% per year.",
          "start_time": 67.15,
          "end_time": 69.11
        },
        {
          "text": "While the rising cost per trip is a major driver of global business travel spend, it's the expected growth in the number of business trips that is contributing most to the 2029 forecast total addressable market for business travel.",
          "start_time": 69.11,
          "end_time": 71.13
        },
        {
          "text": "When looking at the number of round-trip business trips globally, according to Euromonitor's Passport database, we anticipate that the total number of business trips to increase from 3.7 billion in 2024 to 5.6 billion in 2029. That's a growth rate of about 8.8% per year.",
          "start_time": 71.13,
          "end_time": 73.3
        },
        {
          "text": "Just a quick note, the historical estimate for business trips from Euromonitor's Passport database is primarily sourced from the UN World Tourism Organization and forecasts are modeled by Euromonitor's data engineering and travel research teams.",
          "start_time": 73.3,
          "end_time": 75.33
        },
        {
          "text": "So looking at the composition of domestic versus international trips, we estimate that domestic trips will drive growth and account for nearly 90% of all business trips by 2029.",
          "start_time": 75.33,
          "end_time": 77.15
        },
        {
          "text": "Finally, while trips that include air travel are expected to account for less than 15% of total business trips by 2029, the growth in the number of flights is still expected to outpace the anticipated rise in costs of airfare over that time period.",
          "start_time": 77.15,
          "end_time": 79.1
        },
        {
          "text": "All this of course is assuming a baseline scenario of normality over the next four to five years.",
          "start_time": 79.1,
          "end_time": 81.1
        },
        {
          "text": "Those that doubt growth in business travel will point to the pandemic and resulting remote or hybrid work, or to current geopolitical factors like trade barriers or regional conflicts as reasons why business travel should actually or likely fall.",
          "start_time": 81.1,
          "end_time": 83.15
        },
        {
          "text": "Yet, as the chart on the right shows, survey respondents from our research indicated that client visits and travel to other offices are the top reasons for business travel, reinforcing how face time with both customers and other employees remain essential for business growth and operational effectiveness.",
          "start_time": 83.15,
          "end_time": 85.33
        },
        {
          "text": "So now we turn to the differences in business travel between companies with a travel management system, which we refer to as managed, and those without, which we refer to as unmanaged.",
          "start_time": 85.33,
          "end_time": 87.1
        },
        {
          "text": "When we refer to companies as unmanaged, it doesn't mean that these companies aren't traveling. Rather, it means that they are not currently using a travel management system.",
          "start_time": 87.1,
          "end_time": 89.1
        },
        {
          "text": "Therefore, their travel is unmanaged as opposed to a company who uses a travel management system, like Navan or other systems, to manage their travel.",
          "start_time": 89.1,
          "end_time": 91.1
        },
        {
          "text": "Our research estimates that in 2024, about 65% of total global business travel spend was made by unmanaged companies.",
          "start_time": 91.1,
          "end_time": 93.1
        },
        {
          "text": "That share is expected to grow slightly to about 67% of global business travel spend by 2029.",
          "start_time": 93.1,
          "end_time": 95.1
        },
        {
          "text": "Even among managed companies, leakage, or business travel booked outside of their travel management systems, is estimated to account for about 10% of total global business travel spend.",
          "start_time": 95.1,
          "end_time": 97.1
        },
        {
          "text": "Or put another way, about 30% of managed companies' business travel that should be booked through their travel management system are instead purchased outside of it, often by employees who later submit for reimbursement.",
          "start_time": 97.1,
          "end_time": 99.1
        },
        {
          "text": "Adoption accounts for the remainder of that managed business travel spend and it's defined as travel properly booked through a company's travel management system.",
          "start_time": 99.1,
          "end_time": 101.1
        },
        {
          "text": "So diving deeper into leakage, which is travel booked outside of the travel management system, we estimate that the global travel spend attributed to leakage in 2024 was about $112 billion US dollars.",
          "start_time": 101.1,
          "end_time": 103.1
        },
        {
          "text": "If the share of managed travel that is booked outside of travel management systems remains the same as in 2024, then leakage is anticipated to grow over the next five years to about $147 billion dollars. That's estimated at about an annual growth rate of about 5.6%.",
          "start_time": 103.1,
          "end_time": 105.1
        },
        {
          "text": "So if unmanaged companies account for such a high share of global business travel spend, the logical next question is who are they?",
          "start_time": 105.1,
          "end_time": 107.1
        },
        {
          "text": "Based on our B2B survey, over half of unmanaged companies have 200 employees or fewer, compared to managed companies which predictably are overrepresented by larger companies.",
          "start_time": 107.1,
          "end_time": 109.1
        },
        {
          "text": "Similarly, a smaller share of business trips booked by unmanaged companies are international trips compared to those by managed companies: 26% for unmanaged, 33% for managed.",
          "start_time": 109.1,
          "end_time": 111.1
        },
        {
          "text": "This is also intuitive given that most multinational companies have already adopted a travel management system.",
          "start_time": 111.1,
          "end_time": 113.1
        },
        {
          "text": "However, the percentage share of employees who travel for business at unmanaged companies is not significantly lower than that of managed companies, estimated at 43% versus 51% based on the survey.",
          "start_time": 113.1,
          "end_time": 115.1
        },
        {
          "text": "Why is this statistic important? Yes, there are typically fewer employees at an average unmanaged company, but it is not a select few at these companies who are traveling.",
          "start_time": 115.1,
          "end_time": 117.1
        },
        {
          "text": "So at these unmanaged companies, somebody is likely responsible for managing expense reporting and reimbursements across multiple employees, as well as enforcing travel policies in order to keep costs low.",
          "start_time": 117.1,
          "end_time": 119.1
        },
        {
          "text": "Finally, client visits or trade shows overindex for unmanaged companies as reasons for business travel, highlighting the in-person emphasis on meeting customers and or generating leads or suppliers for these unmanaged companies.",
          "start_time": 119.1,
          "end_time": 121.1
        },
        {
          "text": "Comparatively, reasons for business trips are a lot more diverse for managed companies and include visits to other offices, sales or marketing events, and training and development.",
          "start_time": 121.1,
          "end_time": 123.1
        },
        {
          "text": "Finally, when taking a look at business travel costs of managed versus unmanaged companies, our research found that on average, lodging accounts for 11 percentage points more of an unmanaged business's travel expenditure compared to managed companies' annual spend on lodging.",
          "start_time": 123.1,
          "end_time": 125.1
        },
        {
          "text": "And airfare accounted for four percentage points more for unmanaged companies versus managed companies.",
          "start_time": 125.1,
          "end_time": 127.1
        },
        {
          "text": "These data points highlight how much more exposed unmanaged companies' business travel budgets are to lodging and airfare prices compared to those of managed companies.",
          "start_time": 127.1,
          "end_time": 129.1
        },
        {
          "text": "This also relates to leakage, given that 10% of global business travel spend in 2024 was booked outside of a travel management system.",
          "start_time": 129.1,
          "end_time": 131.1
        },
        {
          "text": "That leakage spend would also be exposed to the higher prices seen by unmanaged companies, even though these companies experiencing leakage are already working with a travel management system.",
          "start_time": 131.1,
          "end_time": 133.1
        },
        {
          "text": "And now I'll turn it over to Sarah and Amy for some questions.",
          "start_time": 133.1,
          "end_time": 134.45
        },
        {
          "text": "Thanks, Chris. So what do these findings mean for businesses? So now I'd like to welcome Amy Butte, Navan CFO. Welcome, Amy.",
          "start_time": 134.45,
          "end_time": 135.52
        },
        {
          "text": "Thank you, Sarah. It was so great to work with you and Chris and the Euromonitor team.",
          "start_time": 135.52,
          "end_time": 137.19
        },
        {
          "text": "And you know this data—you know I love data—but there were some really surprising results.",
          "start_time": 137.19,
          "end_time": 138.54
        },
        {
          "text": "And it was great to see, if you will, things we thought we were seeing in the business prove true through the data that you were able to uncover through your research.",
          "start_time": 138.54,
          "end_time": 140.42
        },
        {
          "text": "Definitely. And thinking back on working on this research, one of the most surprising findings for me was that despite the rise of remote and hybrid working and even with these higher travel costs, companies are actually forecasted to travel more in the future. Why do you think that is?",
          "start_time": 140.42,
          "end_time": 142.22
        },
        {
          "text": "Well, on a personal level, we just came back from an executive team offsite and I can say that we were able to get so much done.",
          "start_time": 142.22,
          "end_time": 144.13
        },
        {
          "text": "We're a global company, to be able to connect with my colleagues and have so many conversations in a short period of time in a personal way that you can see that smile, that laugh, that frown, whatever it might be, it really made a difference.",
          "start_time": 144.13,
          "end_time": 145.43
        },
        {
          "text": "I also know as a board member of companies that are partially virtual how important it is for them as well to bring people together in pods. So on a personal level I see it.",
          "start_time": 145.43,
          "end_time": 147.11
        },
        {
          "text": "From a business standpoint for Navan relative to our customers, you know the Euromonitor forecast really validates that travel is a powerful catalyst for growth for businesses on a global basis.",
          "start_time": 147.11,
          "end_time": 148.51
        },
        {
          "text": "You know in an increasingly digital world, the value of in-person connections has actually gone up and we see that in the data.",
          "start_time": 148.51,
          "end_time": 150.15
        },
        {
          "text": "Meetings build that trust with a client or a colleague and allow teams to solve complex problems.",
          "start_time": 150.15,
          "end_time": 151.52
        },
        {
          "text": "You know, and what's really fascinating is we also launched our Navan's business travel index recently which showed that business trip bookings, air and lodging, increased 15% year over year.",
          "start_time": 151.52,
          "end_time": 153.22
        },
        {
          "text": "Another signal that companies are choosing to deploy resources for these in-person connections.",
          "start_time": 153.22,
          "end_time": 154.51
        },
        {
          "text": "You know, I would say it's interesting the Euromonitor data almost called the news ahead of time. We're now seeing airlines talking about how they are raising prices.",
          "start_time": 154.51,
          "end_time": 156.12
        },
        {
          "text": "But even though we're seeing that play out in the news like you anticipated we would, we're also seeing that validation that—and I see it as a CFO—business travel isn't just an expense, it's really an investment and it's an important part of the overall budget.",
          "start_time": 156.12,
          "end_time": 157.19
        },
        {
          "text": "Definitely. And as we're seeing costs increase for travel, another surprising stat for us was that how such a large share, nearly two-thirds of business travel, remains unmanaged.",
          "start_time": 157.19,
          "end_time": 158.55
        },
        {
          "text": "So that's a significant proportion of the global spending, especially when our research is showing clear savings for managed companies and clear differences in cost structure between those that are using a travel management company and those that are not.",
          "start_time": 158.55,
          "end_time": 160.19
        },
        {
          "text": "So what do you think is behind so few businesses working with a travel management company for corporate travel?",
          "start_time": 160.19,
          "end_time": 161.42
        },
        {
          "text": "Okay, but by the way, that data is crazy, right? The data is saying that companies that choose not to work with a provider pay 11% more in lodging and 4% more in air.",
          "start_time": 161.42,
          "end_time": 162.33
        },
        {
          "text": "And so the question is are they choosing not to do that or do they feel like a managed platform is not accessible to them?",
          "start_time": 162.33,
          "end_time": 164.21
        },
        {
          "text": "And I think that's really the difference between what I would call traditional travel versus modern travel.",
          "start_time": 164.21,
          "end_time": 165.34
        },
        {
          "text": "Right. Traditional travel management companies are clearly failing a large percentage of our economy.",
          "start_time": 165.34,
          "end_time": 167.11
        },
        {
          "text": "Those businesses that are traditionally smaller, but even businesses that don't think it's accessible because of the cost or the perception or it's not good to use because employees don't like it.",
          "start_time": 167.11,
          "end_time": 168.19
        },
        {
          "text": "I was actually in a meeting yesterday with a group of people and the person across from me even admitted, like, I never book using my company's system, I always do it on... Leakage. Right, right. Massive, massive leakage.",
          "start_time": 168.19,
          "end_time": 169.51
        },
        {
          "text": "So the question is why do we think we can do it or why do we think there's a better way?",
          "start_time": 169.51,
          "end_time": 171.12
        },
        {
          "text": "You know, at Navan, making travel easier for every frequent traveler is our mission.",
          "start_time": 171.12,
          "end_time": 172.19
        },
        {
          "text": "We don't differentiate whether you come from a company that's managed or unmanaged, we differentiate on the fact that you travel for business.",
          "start_time": 172.19,
          "end_time": 173.34
        },
        {
          "text": "And that's an important thing to do. It's important to our economy, it's important to your business, and it's important to your customers and it's important to your employees and your colleagues. And that's important.",
          "start_time": 173.34,
          "end_time": 174.45
        },
        {
          "text": "So why can we do it differently? It's really a function of technology.",
          "start_time": 174.45,
          "end_time": 175.48
        },
        {
          "text": "Right. We are able to leverage basically APIs for content, AI and machine learning to make sure that people can see that content in a way that your favorite airline, your favorite hotel, your favorite time of flight, all pops up.",
          "start_time": 175.48,
          "end_time": 177.11
        },
        {
          "text": "And then we can also do it in a consumer-grade interface.",
          "start_time": 177.11,
          "end_time": 178.43
        },
        {
          "text": "And so those combinations in a way that's economically efficient for us and also economically efficient for the user or the customer means it's really a win-win-win.",
          "start_time": 178.43,
          "end_time": 180.1
        },
        {
          "text": "And I just don't think traditional players who are still using the phone or just using email are really serving the frequent traveler. And we're seeing that in your data. It's a large percentage.",
          "start_time": 180.1,
          "end_time": 181.42
        },
        {
          "text": "Yeah, absolutely. And we see that in our data that, as you mentioned, the shocking stats of 11% more on lodging, 4% more on flights, that they're spending more unmanaged companies are than managed.",
          "start_time": 181.42,
          "end_time": 183.1
        },
        {
          "text": "So why do you think those that are not using are spending more? Like what are the driving factors behind those? Because assuming maybe an employee goes off their platform to book and they think that maybe there'll be more options, so those that are not using, why are they still spending more in the end?",
          "start_time": 183.1,
          "end_time": 184.21
        },
        {
          "text": "Well, you know the old adage, if you can't measure it, you can't manage it. And I think a lot of unmanaged companies have no mechanism to enforce policy or optimize spending. Right?",
          "start_time": 184.21,
          "end_time": 185.34
        },
        {
          "text": "They can only see an out-of-policy expense after the fact when it's too late. Where a managed platform, particularly one that's real-time like Navan, can prevent that overspending from ever happening.",
          "start_time": 185.34,
          "end_time": 187.11
        },
        {
          "text": "You literally get a pop-up that says this is out of policy if you try to do it on our platform.",
          "start_time": 187.11,
          "end_time": 188.1
        },
        {
          "text": "And our dynamic policy feature also allows for automated and flexible travel rules.",
          "start_time": 188.1,
          "end_time": 189.51
        },
        {
          "text": "Like for example, have you ever tried to get a hotel room in San Francisco during Dreamforce? It's impossible, right? So you need a dynamic policy that works with how people travel.",
          "start_time": 189.51,
          "end_time": 191.12
        },
        {
          "text": "We also think that deep supplier relationships allow modern TMCs to offer optimal and dynamic prices across a wide content base. Many companies, even in a managed world, really only get one choice, whether it's for that hotel or a certain number.",
          "start_time": 191.12,
          "end_time": 192.42
        },
        {
          "text": "You know, at Navan, we're really invested in a multi-source strategy, which gives us access to critical channels to source the fares at highly competitive prices for customers.",
          "start_time": 192.42,
          "end_time": 194.1
        },
        {
          "text": "So for example, when you try to book a hotel room, we can give you three choices. And depending on whether you want it to be refundable, whether you want your points or you don't want your points, whether you want some of our travel rewards that we offer, you can—we can let the user make that decision while still benefiting the customer to save money.",
          "start_time": 194.1,
          "end_time": 195.34
        },
        {
          "text": "Now let's also not forget, which wasn't in the data, how much time most employees have to spend or EAs have to spend to book a trip.",
          "start_time": 195.34,
          "end_time": 197.11
        },
        {
          "text": "I think there's some general data out there that says an average time to book a trip is about 45 minutes.",
          "start_time": 197.11,
          "end_time": 198.1
        },
        {
          "text": "You know, we can do it in about 7 to 8 minutes on average. And so we're constantly able to save customers money in their travel budget, and we're also able to save users time, which in many ways is the equivalent of money, especially if you're in a sales function.",
          "start_time": 198.1,
          "end_time": 199.1
        },
        {
          "text": "Absolutely. And when we did conduct our research, in order to be comprehensive, we looked at companies of varying sizes, so from small and medium companies all the way to large multinationals.",
          "start_time": 199.1,
          "end_time": 200.31
        },
        {
          "text": "And then apart from size, we looked at companies across all these industries.",
          "start_time": 200.31,
          "end_time": 201.42
        },
        {
          "text": "And so we know that there are varying levels of travel, whether it's only domestic, international, client visits, off-sites like you mentioned, conferences, trainings, and more. So with this level of varying needs, like how can all companies benefit from the addition of a TMC?",
          "start_time": 201.42,
          "end_time": 202.43
        },
        {
          "text": "Right, like the worst thing that you can do as a CFO or a finance professional is one, see data too late to act on, right?",
          "start_time": 202.43,
          "end_time": 204.13
        },
        {
          "text": "And unmanaged when it's on paper or if it's coming from multiple systems, you can't see it that day or that week or that month, and so it makes it really hard to act on.",
          "start_time": 204.13,
          "end_time": 205.15
        },
        {
          "text": "You know, two, it's really important—most people don't know this, I didn't know this until I came from Navan—there's actually a duty of care that companies have when their companies travel, when their employees travel.",
          "start_time": 205.15,
          "end_time": 207.11
        },
        {
          "text": "Companies are supposed to know where they are at all times, so if a plane goes down, you know about it. And how do you do that if somebody has leaked and booked their own travel and you don't know?",
          "start_time": 207.11,
          "end_time": 208.21
        },
        {
          "text": "And third, you know, this is my finance hat, you need to audit this, right? And so that reconciliation is really important. And do you want your team spending hours at the end of the month doing manual reconciliation or can you automate that?",
          "start_time": 208.21,
          "end_time": 209.51
        },
        {
          "text": "You know, we live in a very competitive world, and so I think anything a finance leader can do to bring in modern technology to automate, increase efficiency, as well as just make sure you do a better job for your employees and you leverage the company to a higher return on investment, those are all really important things.",
          "start_time": 209.51,
          "end_time": 211.1
        },
        {
          "text": "Absolutely. Appreciated it, Amy, and appreciate everyone for coming. And if you've sent questions through related to the research, the data, our discussion, we'll take a look at them and get back to you after the webinar. But appreciate everyone's time and the discussion, Amy. Thank you. No, thanks, and thanks to the Euromonitor team. What a great partnership.",
          "start_time": 211.1,
          "end_time": 212.1
        }
      ]
    },
    "2d7176f5d84d": {
      "id": "2d7176f5d84d",
      "path": "assets/normalized_videos/Navan_Demo_Video.mp4",
      "filename": "Navan_Demo_Video.mp4",
      "duration": 129.660227,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 26321738,
      "transcript_segments": [
        {
          "text": "Welcome to Navan, the global travel and expense solution loved by CFOs and employees alike.",
          "start_time": 0.0,
          "end_time": 6.3
        },
        {
          "text": "Navan saves you time and money while giving you full visibility and control of spend.",
          "start_time": 6.3,
          "end_time": 11.8
        },
        {
          "text": "Booking a business trip, inviting guests to book, or booking a team offsite takes just minutes. Navan has a huge global inventory of flights, hotels, trains, and car rentals.",
          "start_time": 11.8,
          "end_time": 23.7
        },
        {
          "text": "In many cases, you'll find deals on hotels in our lodging collection. With every search, Navan calculates the optimal travel price based on the destination, travel dates, and time of booking.",
          "start_time": 23.7,
          "end_time": 35.1
        },
        {
          "text": "These dynamic policies show your employees exactly what they can and can't book.",
          "start_time": 35.1,
          "end_time": 41.9
        },
        {
          "text": "Navan also incentivizes your employees to book responsibly, earning rewards for personal travel while saving your company money.",
          "start_time": 41.9,
          "end_time": 49.3
        },
        {
          "text": "The Navan app is the perfect travel companion, providing travelers with the information they need in real time.",
          "start_time": 49.3,
          "end_time": 56.4
        },
        {
          "text": "And if help is needed, Navan's world-class travel concierges perform their magic 24/7. Your VIPs can enjoy an elevated high-touch travel service with Navan Pro.",
          "start_time": 56.4,
          "end_time": 103.1
        },
        {
          "text": "Say goodbye to manual expense reports. With the swipe of a card, transaction details are instantly captured and the expense is either approved automatically or flagged for review.",
          "start_time": 103.1,
          "end_time": 120.3
        },
        {
          "text": "With Navan Connect, link your existing corporate cards and all expenses are synced in real time. You keep the loyalty, rewards, rebates, and banking relationships that matter most to you.",
          "start_time": 120.3,
          "end_time": 130.6
        },
        {
          "text": "Expenses are auto-categorized and reconciled, eliminating the need for employees to submit expense reports while allowing finance teams to close the books at lightning speed.",
          "start_time": 130.6,
          "end_time": 139.7
        },
        {
          "text": "No corporate card? No problem. Employees can submit out-of-pocket expenses by snapping a photo of their receipt. They'll get reimbursed directly to their bank account in their local currency in days.",
          "start_time": 139.7,
          "end_time": 152.3
        },
        {
          "text": "Navan gives real-time visibility over spend with customizable dashboards and integrates with the tools you already use.",
          "start_time": 152.3,
          "end_time": 158.4
        },
        {
          "text": "All of these make Navan loved by employees and CFOs alike. Are you ready to see your company savings take off? Schedule a call or begin experiencing Navan for free today.",
          "start_time": 158.4,
          "end_time": 204.6
        }
      ]
    },
    "b51ba39b74d4": {
      "id": "b51ba39b74d4",
      "path": "assets/normalized_videos/Pay back employees - Track.webm",
      "filename": "Pay back employees - Track.webm",
      "duration": 6.092,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 138889,
      "transcript_segments": []
    },
    "c261547d96bd": {
      "id": "c261547d96bd",
      "path": "assets/normalized_videos/Straumann_USA_LLC_Gains_Control_Compliance_With_Navan_Travel.mp4",
      "filename": "Straumann_USA_LLC_Gains_Control_Compliance_With_Navan_Travel.mp4",
      "duration": 162.620067,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 29638446,
      "transcript_segments": [
        {
          "text": "Straumann makes dental implants, also dental implant technology, design work, and also works with digital side of the implantology.",
          "start_time": 0.0,
          "end_time": 11.5
        },
        {
          "text": "And we're headquartered in Andover, Massachusetts for North America operations.",
          "start_time": 11.5,
          "end_time": 19.3
        },
        {
          "text": "So our team supports procurement from operational perspective on the travel side by really just working hand-in-hand with Navan to review our policies,",
          "start_time": 19.3,
          "end_time": 30.7
        },
        {
          "text": "ensure compliance to those policies, making sure that all of our travel is to industry standards, and really having some of the dynamic tools within Navan truly helps us make sure that we hit our budgets.",
          "start_time": 30.7,
          "end_time": 40.5
        },
        {
          "text": "So our previous TMC, we didn't have any access to any reporting. We had access to none of the data. We had to always put in a request for that.",
          "start_time": 40.5,
          "end_time": 50.0
        },
        {
          "text": "With Navan, we have all that data at our fingertips. It's very seamless and user-friendly. We can do all the analytics that we need within seconds.",
          "start_time": 50.0,
          "end_time": 55.4
        },
        {
          "text": "One of the best benefits of Navan is the mobile app. The app is very easy to use, very user-friendly.",
          "start_time": 55.4,
          "end_time": 64.1
        },
        {
          "text": "It's really tech-forward and it's actually been able to allow us to have 84% adoption rate with all of our travelers utilizing this app.",
          "start_time": 64.1,
          "end_time": 74.3
        },
        {
          "text": "Having the Navan platform at our fingertips has allowed, on the procurement side, finance side, really every entity in Navan who utilize it, time. It gives us time back.",
          "start_time": 74.3,
          "end_time": 88.6
        },
        {
          "text": "It gives us visibility into where people are, what they're spending, where they're going. It gives us a lot of metrics for internal reporting that we wouldn't have had otherwise.",
          "start_time": 88.6,
          "end_time": 96.5
        },
        {
          "text": "Duty of care is very important to us, and knowing where our people are in the field at all times. We have dozens of people every day on the road travel, knowing where they're going, making sure they're safe.",
          "start_time": 96.5,
          "end_time": 105.7
        },
        {
          "text": "My favorite function within the Navan platform as a procurement expert is really being able to see market trends in real-time.",
          "start_time": 105.7,
          "end_time": 113.6
        },
        {
          "text": "We're able to see exactly within any given market, you know, what a going rate is for a hotel, for a car, for a room, and we're able to really use that to drive more informed purchasing decisions.",
          "start_time": 113.6,
          "end_time": 125.8
        },
        {
          "text": "Navan's customer support has been excellent. We currently have a 94% customer satisfaction rate,",
          "start_time": 125.8,
          "end_time": 133.7
        },
        {
          "text": "which really speaks to the professionalism, the dedication, and the follow-through on the Navan team to all of the Straumann needs.",
          "start_time": 133.7,
          "end_time": 142.1
        },
        {
          "text": "And to shed light on the scale of the travel support that Navan has provided to Straumann since adoption, we've traveled over 13,000 trips and 21,000 bookings.",
          "start_time": 142.1,
          "end_time": 152.0
        },
        {
          "text": "Our future goals for our travel program is to just continue to partner with Navan as much as we can.",
          "start_time": 152.0,
          "end_time": 160.8
        },
        {
          "text": "It's been a great partnership in the fact that sharing market information, learning about the travel industry, Navan has been great at sharing with us a lot of data we wouldn't have had, which has really driven us to be able to make better decisions within the company.",
          "start_time": 160.8,
          "end_time": 174.0
        }
      ]
    },
    "50239dce0256": {
      "id": "50239dce0256",
      "path": "assets/normalized_videos/Zuora_Automates_Global_Travel_Expense_with_Navans_AI-Powered_Platform.mp4",
      "filename": "Zuora_Automates_Global_Travel_Expense_with_Navans_AI-Powered_Platform.mp4",
      "duration": 152.833741,
      "resolution": [
        1920,
        1080
      ],
      "fps": 23.976023976023978,
      "file_size": 31242635,
      "transcript_segments": [
        {
          "text": "If I have to describe Navan in a few words, it's a AI for travel and expense.",
          "start_time": 0.0,
          "end_time": 5.0
        },
        {
          "text": "Zuora is a leading cloud-based SaaS provider of subscription management and monetization solutions.",
          "start_time": 5.0,
          "end_time": 12.0
        },
        {
          "text": "We started on our overall AI journey a year ago, and AI is now embedded and infused in all the things that we do.",
          "start_time": 12.0,
          "end_time": 20.0
        },
        {
          "text": "One of the key pain points and challenges that that we had in our last solution is it was not consistent, it was fragmented, it took lot of manual effort for an employee to submit expenses and get paid.",
          "start_time": 20.0,
          "end_time": 30.0
        },
        {
          "text": "And even for our finance teams it was lot of manual effort to review and approve.",
          "start_time": 30.0,
          "end_time": 38.0
        },
        {
          "text": "Now we don't have to worry when an expense comes in, okay, did it meet the policies or not?",
          "start_time": 38.0,
          "end_time": 44.0
        },
        {
          "text": "Now it is, the policies are standardized across across all of our regions. And so employees can just go put in their information and see what's out there.",
          "start_time": 44.0,
          "end_time": 54.0
        },
        {
          "text": "Navan offers the ability to really build our own unique approach for the accounting teams, focusing on those high risk areas like policy flags, different data analytics tools rather than reviewing everything at once.",
          "start_time": 54.0,
          "end_time": 66.0
        },
        {
          "text": "It also enhances our ability in terms of data, really enabling us to develop a tailored strategy that can really maximize operational efficiency and data accuracy.",
          "start_time": 66.0,
          "end_time": 77.0
        },
        {
          "text": "Navan became a consolidated travel and expense platform for business and personal use.",
          "start_time": 77.0,
          "end_time": 85.0
        },
        {
          "text": "Our experience implementing Navan, it was very seamless. Our launch was across 17 countries.",
          "start_time": 85.0,
          "end_time": 93.0
        },
        {
          "text": "Usually other platforms that as a system administrator, we need to go through the our learning curve to understand how system is structured.",
          "start_time": 93.0,
          "end_time": 103.0
        },
        {
          "text": "However, Navan configuration data structure is transparent, easy to adopt, easy to understand.",
          "start_time": 103.0,
          "end_time": 112.0
        },
        {
          "text": "I'm very excited about what Navan's AI capabilities can offer for Zuora.",
          "start_time": 112.0,
          "end_time": 118.0
        },
        {
          "text": "When we launched the new solution from Navan, we trained our Zoe on all the common questions and policies and other areas.",
          "start_time": 118.0,
          "end_time": 128.0
        },
        {
          "text": "And so when this new solution was rolled out, we directed our employees to go to Zoe and get as much as help as possible.",
          "start_time": 128.0,
          "end_time": 135.0
        },
        {
          "text": "That enabled us to drive adoption usage quickly.",
          "start_time": 135.0,
          "end_time": 140.0
        },
        {
          "text": "So that is why we are looking forward to partner with companies like Navan and to see how we can enable that agent of agent communication and to make that experience better for our employees.",
          "start_time": 140.0,
          "end_time": 152.0
        }
      ]
    },
    "47b3d8894fd4": {
      "id": "47b3d8894fd4",
      "path": "assets/normalized_videos/Setting_up_your_expense_policy.mp4",
      "filename": "Setting_up_your_expense_policy.mp4",
      "duration": 351.991293,
      "resolution": [
        1920,
        1080
      ],
      "fps": 30.0,
      "file_size": 20635513,
      "transcript_segments": [
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        },
        {
          "text": "",
          "start_time": 0.0,
          "end_time": 0.0
        }
      ]
    },
    "742a45a26a60": {
      "id": "742a45a26a60",
      "path": "assets/normalized_videos/Book_control_and_save_on_business_travel.mp4",
      "filename": "Book_control_and_save_on_business_travel.mp4",
      "duration": 37.105488,
      "resolution": [
        1920,
        1080
      ],
      "fps": 25.0,
      "file_size": 3683959,
      "transcript_segments": [
        {
          "text": "Book, control, save on all things business travel with Navan.",
          "start_time": 0.0,
          "end_time": 4.0
        },
        {
          "text": "Navan is the platform where employees book their own travel. Flights, hotels and more.",
          "start_time": 4.0,
          "end_time": 9.0
        },
        {
          "text": "And see exactly what they can and can't spend based on your policy. So you don't go over budget on travel expenses again.",
          "start_time": 9.0,
          "end_time": 17.0
        },
        {
          "text": "Get real-time visibility into travel spend and find more ways to save.",
          "start_time": 17.0,
          "end_time": 21.0
        },
        {
          "text": "Speaking of ways to save, Navan rewards employees toward their personal travel when they book cheaper options.",
          "start_time": 21.0,
          "end_time": 28.0
        },
        {
          "text": "With Navan, employees self-book business trips and you stay within budget.",
          "start_time": 28.0,
          "end_time": 33.0
        },
        {
          "text": "Ready to try Navan? Get started for free at navan.com.",
          "start_time": 33.0,
          "end_time": 37.0
        }
      ]
    },
    "1a8ba3bc771f": {
      "id": "1a8ba3bc771f",
      "path": "assets/normalized_videos/Spend Control - Categorise.webm",
      "filename": "Spend Control - Categorise.webm",
      "duration": 4.343,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 152510,
      "transcript_segments": []
    },
    "ebe72112ddd3": {
      "id": "ebe72112ddd3",
      "path": "assets/normalized_videos/SumUp_switches_to_Navan_and_sees_big_savings_and_a_23_increase_in_platform_adoption.mp4",
      "filename": "SumUp_switches_to_Navan_and_sees_big_savings_and_a_23_increase_in_platform_adoption.mp4",
      "duration": 163.398821,
      "resolution": [
        1920,
        1080
      ],
      "fps": 29.97002997002997,
      "file_size": 49061330,
      "transcript_segments": [
        {
          "text": "SumUp's main offices are located in Berlin, in London, in Sofia,",
          "start_time": 0.0,
          "end_time": 4.1
        },
        {
          "text": "in Sao Paulo, and all over the world. We are present now on four continents.",
          "start_time": 4.1,
          "end_time": 8.0
        },
        {
          "text": "Very often, you know, we're traveling because of many team events and off-sites, hackathons.",
          "start_time": 8.0,
          "end_time": 14.0
        },
        {
          "text": "We believe that the magic is in the team. That's why we like to meet each other.",
          "start_time": 14.0,
          "end_time": 18.0
        },
        {
          "text": "I help the team celebrate and organize a lot of events that come with expenses, and thanks to Navan,",
          "start_time": 18.0,
          "end_time": 25.0
        },
        {
          "text": "I have a partner in managing expenses and the reporting.",
          "start_time": 25.0,
          "end_time": 29.0
        },
        {
          "text": "Before Navan, SumUp handled travel and expense in a mixed way.",
          "start_time": 29.0,
          "end_time": 35.0
        },
        {
          "text": "A lot of people were expensing out-of-pocket expenses, and it was nightmare—",
          "start_time": 35.0,
          "end_time": 41.0
        },
        {
          "text": "maybe is the word that best describes this process.",
          "start_time": 41.0,
          "end_time": 44.0
        },
        {
          "text": "If I have to describe the previous solutions that we used, I would say they were time-consuming, layered, and non-intuitive.",
          "start_time": 44.0,
          "end_time": 49.0
        },
        {
          "text": "We had one solution for travel, one solution for expenses.",
          "start_time": 49.0,
          "end_time": 54.0
        },
        {
          "text": "Manual from the employee's perspective and then hard from finance perspective to control the expenses,",
          "start_time": 54.0,
          "end_time": 60.0
        },
        {
          "text": "also to get proper reporting. But with Navan, everything changed.",
          "start_time": 60.0,
          "end_time": 64.0
        },
        {
          "text": "This is the first time that we have a consolidated solution for all our needs in those areas.",
          "start_time": 64.0,
          "end_time": 72.0
        },
        {
          "text": "We were using three tools previously. We were able to aggregate them in one.",
          "start_time": 72.0,
          "end_time": 76.0
        },
        {
          "text": "Navan offers us all the travel, expenses, and reporting features that we had in the previous tools but in one place.",
          "start_time": 76.0,
          "end_time": 83.0
        },
        {
          "text": "We have visibility, the dashboards are really clear.",
          "start_time": 83.0,
          "end_time": 87.0
        },
        {
          "text": "We've seen impact because now people are actually using the service. For instance, we've seen a 23% increase",
          "start_time": 87.0,
          "end_time": 94.0
        },
        {
          "text": "in the adoption rate, which means that people are actually enjoying the service.",
          "start_time": 94.0,
          "end_time": 98.0
        },
        {
          "text": "It makes me feel very safe. It's very simple to use, it's super intuitive, it's easy to attach the receipts afterwards.",
          "start_time": 98.0,
          "end_time": 104.0
        },
        {
          "text": "It's super fast in terms of the transaction going through.",
          "start_time": 104.0,
          "end_time": 110.0
        },
        {
          "text": "I use the physical card, which is always with me, because very often we are paying some things for the office with the card,",
          "start_time": 110.0,
          "end_time": 116.0
        },
        {
          "text": "so it's very practical to have it.",
          "start_time": 116.0,
          "end_time": 120.0
        },
        {
          "text": "We feel that Navan as a solution for the European market for us was not a difficult choice to make because you,",
          "start_time": 120.0,
          "end_time": 128.0
        },
        {
          "text": "just like us, are a global business with local impact.",
          "start_time": 128.0,
          "end_time": 133.0
        },
        {
          "text": "The SumUp clap is when we achieve something, we just celebrate with the SumUp clap.",
          "start_time": 133.0,
          "end_time": 138.0
        },
        {
          "text": "This is the SumUp clap that everybody's talking about. We celebrate Navan with the SumUp clap.",
          "start_time": 138.0,
          "end_time": 142.0
        }
      ]
    },
    "33057da62594": {
      "id": "33057da62594",
      "path": "assets/normalized_videos/Pay back employees - Reimburse.webm",
      "filename": "Pay back employees - Reimburse.webm",
      "duration": 5.942,
      "resolution": [
        1194,
        1242
      ],
      "fps": 25.0,
      "file_size": 117737,
      "transcript_segments": []
    }
  }
}